[
  {
    "post_id": 1,
    "title": "Detecting my cat using my security cameras",
    "author": "Turbulent-Guest-4278",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mmyerj/detecting_my_cat_using_my_security_cameras/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-11T00:12:36Z",
    "flair": null,
    "post_text": "Is trying to detect my cat using my existing security cameras possible? \n\nI'm thinking of getting the camera feed training my own ai model that detects only my cat, or all cats so that I can find out before it escapes, I have an yard + open garage with a gate and a camera that covers the whole garage and yard"
  },
  {
    "post_id": 2,
    "title": "Security Camera Recommendations For Property",
    "author": "KingofNerdom",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mmwy1w/security_camera_recommendations_for_property/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-10T23:05:13Z",
    "flair": null,
    "post_text": "Looking for recommendations for a budget friendly security camera for a piece of property we are building on that currently lacks power/wifi. We have equipment on the property so we are looking for something that can locally record with battery power and would be preferable if it either has solar power built in or the option to add to it would be nice as well. Should also note we'd rather not have to use cellular either, we aren't really concerned with being able to access it remotely, Just that it can capture decent video with motion detection and a decently wide view. "
  },
  {
    "post_id": 3,
    "title": "I'm tired of Reolink.",
    "author": "ThomasBP81",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mmoiye/im_tired_of_reolink/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-10T17:28:50Z",
    "flair": null,
    "post_text": "We have some Reolink RLC-822A cameras, and 3 out of 4 produce blurry images (Out of focus), with none of them having autofocus enabled.  \nThey are set to manual focus, and I have to go in and adjust the focus on those 3 every 4–5 weeks. It’s so frustrating that they can’t just stick to the settings I give them.  \nThey are running the latest firmware… so now I’m actually considering switching to something else.\n\nCan anyone recommend a 2/4K camera that doesn’t have to be more expensive, and preferably an IP camera (wired)?"
  },
  {
    "post_id": 4,
    "title": "Best way to install camera on soffit",
    "author": "ExternalUpper8542",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mmgd5b/best_way_to_install_camera_on_soffit/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-10T11:40:21Z",
    "flair": null,
    "post_text": "Looking at getting some cameras and would like to install in a few areas near hardwired spotlights. Most non battery cameras that sync up easily via a app utilize a brick power adapter. What is the best way to conceal this if I will be mounting near the spotlights and pulling power from the junction boxes they are on? Attached a pic of the junction box and of soffit area similar to mine. Any input is helpful"
  },
  {
    "post_id": 5,
    "title": "Need camera for house",
    "author": "Soft-Juggernaut7699",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mm9amp/need_camera_for_house/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-10T04:25:34Z",
    "flair": null,
    "post_text": "Someone stole the internet cables from the side of my house. Then yesterday I got a internet box from fed x. Someone had used my address to set up internet .  I need to get cameras. Are there any from temu that I could buy that doesn't have computer or wifi needed. I only have a smartphone. "
  },
  {
    "post_id": 6,
    "title": "Apartment battery powered",
    "author": "Old_Tie628",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mm4gwg/apartment_battery_powered/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-10T00:17:31Z",
    "flair": null,
    "post_text": "New to the community and was wondering what would be the best and easiest to work with. I don’t know if all need subscriptions for certain things, but preferably a decent bang for buck subscription if it’s needed. Nothing to specific needed just want to know what the best options are in certain price ranges!"
  },
  {
    "post_id": 7,
    "title": "Recommendations for security camera/nvr",
    "author": "Hackingmango",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mluxhb/recommendations_for_security_cameranvr/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-09T17:21:41Z",
    "flair": null,
    "post_text": "Hello\n\nIm trying to help my father find a security camera system but im having trouble finding good ones/unsure what is good.\n\nHe needs to have some sort of app or ability to view on his smartphone. Iphone/androird capability\n\nHe will need outdoor cameras that have good night vision as it is very dark where he is at night.\n\nAs well as 2 way audio and live video for deliveries and such as he has trouble walking fast.\n\nAnd to make it better i need it to be nvr compatible so i can have it locally in his home.\n\nPreferabbly on wifi for easier setup but not necessary\n\nNo subscription as well.\n\nAny suggestions would be great thank you all."
  },
  {
    "post_id": 8,
    "title": "Does ambient light help at all in IR night mode?",
    "author": "david_ph",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mlngqo/does_ambient_light_help_at_all_in_ir_night_mode/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-09T11:46:39Z",
    "flair": null,
    "post_text": "I have an outdoor camera paired with a separate 30 watt LED flood light.  I'm able to get color imagery all night, but it's not as clear as it is during the day.\n\nIf I switch to IR mode on the camera at night (built in IR), it is crisper and clearer vs. the color image with the flood light.\n\nI'm wondering, does the ambient light from the flood light have any effect in IR night mode?  Or it's completely filtered out?\n\nAlso, what do you think is preferred at night?  Well lit color, even if it isn't as sharp, or black &amp; white IR?"
  },
  {
    "post_id": 9,
    "title": "Trying to reset Hikvision DVR password - don't have the GUID file or key. Help!",
    "author": "BreakfastAntelope",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mljlew/trying_to_reset_hikvision_dvr_password_dont_have/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-09T07:33:12Z",
    "flair": null,
    "post_text": "I recently bought a house, and the previous owners left behind a Hikvision DVR system. I'm trying to access it to change parameters and update the clock, but I don't have the password.\n\nWhen I tried to use the iVMS software on my Mac to reset the password, it was asking for a GUID file or a key. Since I'm not the original owner, I have neither.\n\nHas anyone dealt with this situation before? What are my options for a password reset without the GUID file? Is there a physical reset button on the DVR itself?\n\nAny advice would be greatly appreciated! I'm hoping to avoid a full factory reset if possible, but I'm willing to do it if that's the only way.\n\nThanks!"
  },
  {
    "post_id": 10,
    "title": "Reliable home security/monitoring system...does one exist?",
    "author": "Friendly-Mammoth494",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mlfq2s/reliable_home_securitymonitoring_systemdoes_one/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-09T03:46:01Z",
    "flair": null,
    "post_text": null
  },
  {
    "post_id": 11,
    "title": "Home security cameras",
    "author": "Mexhai",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mlccg3/home_security_cameras/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-09T00:57:46Z",
    "flair": null,
    "post_text": "What are some good quality cameras we can put around our house ?"
  },
  {
    "post_id": 12,
    "title": "ZOSI IP info",
    "author": "Longjumping-Ball8942",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mktcbt/zosi_ip_info/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-08T12:04:00Z",
    "flair": null,
    "post_text": "Hi I have the model ZR08JP network video recorder with 4 C199/c199 pro cameras. (not sure wish any more) The recorder has died after 3 years, and I would like to try to set the cameras up to be viewed on my Has anyone the IP address, subnet mask, and port number that the recorder came with right from the factory? I would like to set up a work station just for the cameras. Any help here would be great."
  },
  {
    "post_id": 13,
    "title": "Many Cheap Cameras vs. Few Expensive Ones",
    "author": "HappyPoodle2",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mkqejw/many_cheap_cameras_vs_few_expensive_ones/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-08T09:14:08Z",
    "flair": null,
    "post_text": "For residential use, I find that in most cases, the cameras will either be very close to a choke point or I just want a camera to get an overview of what is going on. \n\nI have a 4K Hikvision one, which is great, but it looks dystopian. I then found much smaller no-name cameras for around 20-30$ that are 2K, but I can get 6 of them for the price of the 4K one. \n\nAm I missing something or does it make more sense to place several smaller, cheaper cameras than a few very high quality ones?"
  },
  {
    "post_id": 14,
    "title": "Reliability",
    "author": "meogma",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mkncxn/reliability/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-08T06:00:34Z",
    "flair": null,
    "post_text": "I had Nest cameras a few years ago but due to a billing issue they refused to resolve I gave that brand up in favor of Ring. Horrible mistake. I hate Ring. I don't know if I should go back to Nest or go with something else. I asked chatgpt what were the top 3 most reliable battery operated security cameras. It said Eufy 3 (S330), Reolink Argus 3 Pro and the Arlo Pro 5S 2k. I'm not particularly impressed by the reviews for any of them. Is there a decently reliable battery operated camera out there? \nMy Ring missed 4 events today. I can't deal with this anymore. "
  },
  {
    "post_id": 15,
    "title": "Yi Camera",
    "author": "Chance_Education6512",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mkm8mi/yi_camera/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-08T04:55:21Z",
    "flair": null,
    "post_text": "I am pet sitting and the house is covered in YI brand cameras, including the room I am sleeping in (camera is mounted on the wall so I can’t just unplug it.) Is there a way to tell if it is being viewed in their app, such as a light coming on or a noise? Or any kind of indicator? Didn’t find anything about that on the website. Thank you! \n"
  },
  {
    "post_id": 16,
    "title": "Need Recommendations!",
    "author": "Wooden_Physics7150",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mkl6xq/need_recommendations/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-08T04:00:04Z",
    "flair": null,
    "post_text": "Hello, Im in canada and live in a what I thought was a safe area, but lastnight my truck got rifled through and out garage was open 6 inches.\n\nThere is a tree in our yard id love mount a security camera onto but it needs to be wireless! And preferably under $150 CAD, does anyone have any recommendations?"
  },
  {
    "post_id": 17,
    "title": "Aosu 5MP Ultra HD",
    "author": "Big_Bare11",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mkl5wu/aosu_5mp_ultra_hd/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-08T03:58:36Z",
    "flair": null,
    "post_text": "I’m looking to get my very first Doorbell camera but I’m notsure which to get.\nI see online amazing reviews on this camera as the camera quality seems to be excellent and what is a positive (for me) is that there is not a monthly subscription.\n\nWhat I am looking for as well is 24/7 recording as If I need to rewind a few minutes/hours to see what is going on near my house, does this doorbell camera allow that?\n\nIf not, which doorbell camera would?\nI’m in Canada.\n\nThanks!"
  },
  {
    "post_id": 18,
    "title": "Help with cam recommendation!",
    "author": "brox121",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mkb18x/help_with_cam_recommendation/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-07T20:25:57Z",
    "flair": null,
    "post_text": "I recently installed the AOSU Solar Max wi-Fi camera system on my house. I really liked it and had success with the motion activation settings. I ended up returning it because I really wanted a camera system that sends announcements via Alexa and I did not realize that those cameras would not do that.\n\nNext, I purchased the Reolink, Argus Eco ultra solar camera kit. The physical build quality of this kit is impressive, however, the connectivity is lacking. I have also had problems with motion detection many times several of the cameras failed to notify of motion. I also have one camera in particular that sends notifications when cars pass, even after I have disabled vehicle detection and set Where I want motion detected. I had really high hopes for this kit, but was let down.\n\nSo, my question is, what are your recommendations for a Wi-Fi camera system that offers the following features:\n\nSet of at least 4\nSolar charging \nAI detection  (people, vehicle, animal)\nAlexa announcements\nNo subscription \n4k (does not necessarily have to be, but I would prefer it)\nExpandability for more cameras in the future \nPrice right around $500\n\n**(Considering the Eufy S330 (Amazon has $200 off coupon))"
  },
  {
    "post_id": 19,
    "title": "Bosch Camera Login Issue?",
    "author": "OneCroissant",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mkammz/bosch_camera_login_issue/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-07T20:10:30Z",
    "flair": null,
    "post_text": "I have a set of Bosch cameras that are letting my laptop login to them. But only my laptop, which set the password. I am remotely logged into the server I am trying to attach them to, but I keep getting a \"Login failed: Wrong user name or password.\" notification when I try to login. Even when I set the password, then copy and paste it across the two computers, trying to remove the human element of error from my typing. Is there anyone familiar with this issue that could help me log into these cameras, and hopefully attach them to my Genetec system? "
  },
  {
    "post_id": 20,
    "title": "Nextiva S1808e Encoder - Accessing Cameras?",
    "author": "bbestvin",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mk8ux4/nextiva_s1808e_encoder_accessing_cameras/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-07T19:02:44Z",
    "flair": null,
    "post_text": "Hello, I'm trying to support a very old camera encoder, the Nextiva s1808e.  It currently has two cameras connected to it, but I'm unsure how I can configure those cameras directly.  I can get to the encoders \"web configuration\" page using the IP address, but from there I cannot change much about the connected cameras.  I would even just like to see the Camera model information if possible!  The one camera connected is constantly panning and zooming in a pattern, so I'm thinking that was setup years and years ago.  I have no idea how to modify that if I wanted to!  Any suggestions?"
  },
  {
    "post_id": 21,
    "title": "Cover for Light Bulb Camera?",
    "author": "Financial-Isopod-703",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mk27q3/cover_for_light_bulb_camera/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-07T14:53:14Z",
    "flair": null,
    "post_text": "Hi everyone! \n\nJust finished setting up a bulb camera. I’ll attach a picture of the specs. \n\nI live in an apartment and I had to unscrew the cover to the lightbulb to access the socket to put the camera in it. Everything’s working smoothly, but now it’s pretty obvious (in my opinion) that a camera is there. To me, that kinda defeats the purpose. I got this camera from the YWCA to help protect myself from an abuser. I would hate for him to see it up there and damage it. \n\n\nAnywho, do yall have any recommendations for a cover of some sort? Do they have something like that? Of course whatever it is needs to be the kind of material that the camera can still see out of. My brain is thinking along the lines of a 2- way mirror/window of some sort, but I don’t know how to find that on Amazon 🤣\n\nAny advice would be appreciated! Thanks!!"
  },
  {
    "post_id": 22,
    "title": "Compromised Sibel NVR",
    "author": "Sintek",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mk1xys/compromised_sibel_nvr/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-07T14:42:45Z",
    "flair": null,
    "post_text": "My network kept getting flooded and take offline.\n\nI discovered that my Sibel NVR NVR-SB8ME-8P has some malware or something on it that is sending data out to unknown wierd IP addresses that come back as malicious. I set the network setting to a different DNS [9.9.9.9](http://9.9.9.9) to see if that help but, the packet captures still show the malware is using [8.8.8.8](http://8.8.8.8) to reach out to bad URL and IP's\n\n  \nI have tried to factory reset the NVR to see if that would wipe the hack, but that didn't work.\n\nDoes anyone know how this would have been accessed where I can get onto the system and remove it?\n\nI think it was exposed directly to the internet for a few weeks and that's how it got compromised"
  },
  {
    "post_id": 23,
    "title": "Can anyone help me find a security camera that uses 5G cellular? They all seem to be 4G. I don't want a Wi-Fi camera, must be cellular.",
    "author": "Saildirt",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mk0kr9/can_anyone_help_me_find_a_security_camera_that/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-07T13:47:50Z",
    "flair": null,
    "post_text": "Need a 5G cellular camera, not Wi-Fi.\nBeen searching and having a hard time finding any. Thanks in advance for any suggestions.\n\nTo further clarify, my business partner bought an additional line for his family plan and received a SIM card from AT&amp;T. \nThe SIM card works in my telephone, no problem. \nDoes not work at all in the camera. Camera works just fine with my T-Mobile SIM card.\n\n\nEDIT:\nGuys, thanks for all the help.  Changing the APN did it.\nFinally had time to work on this today, and figured it out.  \nYou have to force the APN to be NEXTGENPHONE to make it work with 4g only,\nThe default on the new AT&amp;T sim card is ENHANCEDPHONE which works with 5g.\nthis is the camera by the way:\nhttps://www.amazon.com/dp/B0BD7JQXBB?psc=1&amp;ref_=cm_sw_r_cp_ud_ct_AW892582FF1V6ST6NHF3\nAll is working now, thanks again!!"
  },
  {
    "post_id": 24,
    "title": "I need a cheep but reliable security camera with motion detection and ability to save videos, any recommendations? (That ships to Italy)",
    "author": "MinaCiclamina",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mjt13m/i_need_a_cheep_but_reliable_security_camera_with/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-07T06:52:30Z",
    "flair": null,
    "post_text": "Hello, next month I will be moving in with some people I don’t really trust so I wanted to put up a camera in my bedroom for security. It doesn’t really need great quality for the image, but I wanted to be able to see if someone enters when I’m not there and to save any evidence if it happens.\nAny advice is welcome"
  },
  {
    "post_id": 25,
    "title": "Need help to monitor elderly father",
    "author": "Internal_Rooster_242",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mjmqa1/need_help_to_monitor_elderly_father/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-07T01:19:51Z",
    "flair": null,
    "post_text": "My dad lives in a community living setting. Ive come to not trust some of his \"roomates\" and until i get him into a different place i want a camera in his room. This will serve as security,  as well as a way for me to check in on him as he is a fall risk. I bought blink cameras (not knowing they don't record 24/7) so I'm looking for a reliable company,  and an affordable camera that records 24/7 as well as motion notifications, live viewing theough an app and 2 way auto. I will 100% pay for a subscription.  Just want it to work. It will have access to power, so no power bank needed. But wifi internet perfered. Thank you so much for giving your input.\n"
  },
  {
    "post_id": 26,
    "title": "looking for reliable security camera system",
    "author": "WoWGirlRPer",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mjffk1/looking_for_reliable_security_camera_system/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-06T20:17:01Z",
    "flair": null,
    "post_text": "hello community!\n\nanyone have any suggestion on a reliable security camera system that'll record audio uninterrupted, (maybe lower down ambience of the outside sounds city, etc, not sure if that sort of thing exist?), great night vision, records 24/7, and one that i can add more cams for different angles if needed. I think most, of not a lot, are standardized security cams comes with apps for you to download the videos or see your cams live. \n\n  \nI'm not sure if wired or wireless/wi-fi would be the best route (not sure of any of this, hoping some of you can shed light on which would be best to have) in case we lose internet, I'd like to have the security cams still recording. Please help &lt;3 thank you in advance.\n\n  \nnote: I'm not sure if i need to mention this; but looking for a home in the states (USA)"
  },
  {
    "post_id": 27,
    "title": "Suggestions for a SC that can withstand extreme outdoor heat?",
    "author": "Key_Drawer_3581",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mjc9d0/suggestions_for_a_sc_that_can_withstand_extreme/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-06T18:17:17Z",
    "flair": null,
    "post_text": "I'm new to the Security Camera market, please bear with me if I forget any other requirements: \n\nI'm looking for a wired (POE?) system with no subscription obligations. I plan on having at least 2 exterior cameras **and** a doorbell camera, along with about 2 indoor cameras. \n\nI live in a very hot place with extremely long summers (over 44C on average for over 4 months). I'm open to all suggestions in most price ranges (nothing commercial) as long as it's good quality."
  },
  {
    "post_id": 28,
    "title": "Where should I put PTZ cam",
    "author": "Bettering-Myself1",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mj8wnw/where_should_i_put_ptz_cam/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-06T16:11:33Z",
    "flair": null,
    "post_text": "Will be replacing a Hikvision PTZ  (in pic) with a Ubiquiti PTZ. The Ubiquiti does not have ceiling/soffit mount option, only wall or pole option. It will cover a large open backyard. \n\nI have access to anywhere behind the brick wall above the second floor window. \n\nShould I install high up at the flashing or lower onto the brick wall? Should I keep it high up or as low as possible (above the window)? I do want it to surveil the second floor patio to the left in the picture. "
  },
  {
    "post_id": 29,
    "title": "AOSU Playback help",
    "author": "Lolitayaya1",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mj63is/aosu_playback_help/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-06T14:25:38Z",
    "flair": null,
    "post_text": "does anyone have an AOSU security cam? I just bought one and can’t seem to playback events past an hour. I upgraded to the Basic Plan and still cannot see past events. I’ve put an SD card in it as well, I believe it’s a 32GB.\n\nthanks! "
  },
  {
    "post_id": 30,
    "title": "Which security cameras do u guys recommend?",
    "author": "ThrowRAtemporaryday",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mj56d8/which_security_cameras_do_u_guys_recommend/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-06T13:48:50Z",
    "flair": null,
    "post_text": "Or which ones do u have? What prices? I've been looking but I'm not sure which are better. I saw some window ones on tiktok and I kind of like those but idk if I'm able to keep the recordings in a cloud or something. I just need about 2 with night vision and audio and that I can watch from my phone. "
  },
  {
    "post_id": 31,
    "title": "Power cables for dome?",
    "author": "Otomotu",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mj2fr0/power_cables_for_dome/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-06T11:46:59Z",
    "flair": null,
    "post_text": "Hello, sorry I am a bit new to the electronics, especially  when it comes to the wiring and powering.\nCan someone explain me how to power up this hikvision mini dome? As I understand I need add power cable I just don't know wich cable I need to and where to connect.\nThanks"
  },
  {
    "post_id": 32,
    "title": "Home security camera recommendations",
    "author": "eliitedisowned",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mj02hu/home_security_camera_recommendations/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-06T09:31:28Z",
    "flair": null,
    "post_text": "So I brought a house that had 2 eufy floodlight cam E which I liked as it saved me having to buy a whole setup. \n\nI went ahead and brought the homebase 3 in order to continuously record, turns out the cameras don't support that (that's on me should've checked but what a broken system)\n\nSo now I'm looking for alternatives. Should I keep going down the eufy security camera route with either cameras that take mains power or swap to an entirely different system.\n\nIdeally I'd like cameras to be mains powered and capable of 24/7 recording back to something (either through Ethernet or wireless) and has a good app. \n\nSo if anyone has any recommendations or thoughts on whether I should start over or simply stick with eufy, that would be greatly appreciated. Thanks. "
  },
  {
    "post_id": 33,
    "title": "YI cameras and their ads.Here is how to report them for pushing ads and making this security camera terrible for your peace of mind please read.",
    "author": "AltruisticTruck6884",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mix2le/yi_cameras_and_their_adshere_is_how_to_report/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-06T06:17:34Z",
    "flair": null,
    "post_text": "To report a potentially \"fraudulent app, you can file a complaint with the Federal Trade Commission (FTC). You can also report it to the Internet Crime Complaint Center (IC3), which is run by the FBI, if the scam involves online fraud. Additionally, the Better Business Bureau!!!!!!!!"
  },
  {
    "post_id": 34,
    "title": "Question about PoE switches",
    "author": "JustALittleBetter",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mij68j/question_about_poe_switches/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-05T19:42:26Z",
    "flair": null,
    "post_text": "Hello,\n\nI'm planning on installing an external home CCTV system using PoE cameras and a NVR.\n\nMy question is can I connect the cameras via ethernet to a PoE switch and then run a single ethernet cable to the NVR? Is it possible to run the switch powered by PoE without using an external power supply? I want to mount the switch in a waterproof junction box on the wall but getting external power to it will be really difficult.\n\n\nThanks"
  },
  {
    "post_id": 35,
    "title": "Outdoor LTE/Solar Solution - Recs?",
    "author": "locura79",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1miher2/outdoor_ltesolar_solution_recs/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-05T18:37:07Z",
    "flair": null,
    "post_text": "I need to install security cameras on a vacant tract of land with no power or internet access. Obviously, this means solar power and mobile internet. I have looked at the Tactacam Defend and the Reolink Trackmix but am open to other suggestions. I want something that will record video to the cloud at a high enough resolution to identify trespassers and that I can view as a live stream. I don't have a problem with paying for the LTE connection, but I would prefer to not have to pay a separate fee for each camera since I would like to install 2-3 cameras on the property. I'm completely out of my depth here and looking for complete recommendations (i.e., camera + power + internet solutions). Help?"
  },
  {
    "post_id": 36,
    "title": "How does everyone feel about Ring actively declaring that they will violate their client's privacy without a warrant?",
    "author": "PartnersInCrimePhoto",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1miaq4s/how_does_everyone_feel_about_ring_actively/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-05T14:28:29Z",
    "flair": null,
    "post_text": null
  },
  {
    "post_id": 37,
    "title": "Wireless security camera that records over itself on SD 24/7",
    "author": "Lunchbox6624",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mi8nze/wireless_security_camera_that_records_over_itself/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-05T13:05:19Z",
    "flair": null,
    "post_text": "I can't find anything! We manage an apartment complex and would like to install a camera in the parking lot. The only power options we currently have is to use a solar panel. We are looking for something basic that we can install high on a pole, powered by the solar panel, and records 24/7 locally to an SD card. Do these exist? I've looked at several different brands and can't find anything that makes sense. TIA!"
  },
  {
    "post_id": 38,
    "title": "Camera recommendations for wildlife recording and creating a large network",
    "author": "iheartinfinity",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mi1ahl/camera_recommendations_for_wildlife_recording_and/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-05T06:01:09Z",
    "flair": null,
    "post_text": "OK, so I have about 10 acres of ground at my house, I want to start adding cameras around the grounds to capture the wildlife, including cameras in the nests (birds, badgers, foxes e.t.c.) as well as other cameras posted around the forest/lake.\n\nI won't be able to budget for all the cameras straight away, so its important that I can add on in the future, as you would expect the cameras need to be battery powered/solar powered and some how a direct feed going into a PC in my home, which won't work over wifi as it won't reach, so not sure if there is a solution there.\n\nQuality wise, ideally 4K, ideally some camera options for thermal/night vision...\n\nIt sounds like I am asking for too much or the price is going to be insane, but any help would be appreciated. I noticed a person doing something similar uses Axis, but I am not sure how many boxes they tick and of course, they do seem expensive, but expected I guess."
  },
  {
    "post_id": 39,
    "title": "Looking for some advice",
    "author": "muffinnmannn",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mhyeht/looking_for_some_advice/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-05T03:22:46Z",
    "flair": null,
    "post_text": "likely asked a million times before, but this is just the easiest way. Ive found people are often receptive to offering their opinion on products. \n\nI don't know alot about cameras except there are millions of them with prices all over. we can start from a wyze. Cheap, works. But you can't get a plate from any distance. I need to get plates, a minimum of 40 yards? Night vision, no need for flood lights or sirens. ANd, this is the big and, NO subscirption, no paywall bullshit. I by a camera, I own it. Cloud storage and some extras is fine and maybe I will, but I will not be forced to. I want native control of footage. My dashcam BlackVue has a proprietary storage format and apps, but thats fine. I can download, control, cut, send anything I want. I recently found out none of that is possible with a wyze camera. \n\nI cant spend 600 dollars either. I can go around 200, and will even go used if the deal is right for a more expensive one. best referral gets Award!"
  },
  {
    "post_id": 40,
    "title": "Wireless camera with its own WiFi",
    "author": "Toddvg",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mhpoci/wireless_camera_with_its_own_wifi/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-04T21:02:16Z",
    "flair": null,
    "post_text": "I am looking for a Camera with a Wide angle lens that has its own WiFi.\n\nI want to be able to attach a battery pack to it, mount it anywhere. Use my IPhone to view proper angle/start &amp; stop recording to its SD card. I am not hiding it, but smaller would be better.\n\nSome places I mount it will not have internet and might not even have cellular service. Best case would be a camera that has it’s own WiFi (stronger the better) so it I am 100’ away or so I can view the camera and have complete control of it’s settings."
  },
  {
    "post_id": 41,
    "title": "Wyze banned me again, permanently; for suggesting a brand that doesn't paywall built-in features.",
    "author": "TekWarren",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mhms6i/wyze_banned_me_again_permanently_for_suggesting_a/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-04T19:14:05Z",
    "flair": null,
    "post_text": "Title. I guess they are fully invested in this tactic now. Silence anyone suggesting other brands that don't make you pay subscription fees to get the full use out of products purchased. Screenshot of comment didn't even even say anything bad about Wyze, they just know they are scamming people and this is how they keep trying to \"hide\" it."
  },
  {
    "post_id": 42,
    "title": "Help with camera positions",
    "author": "Proper-Flounder-3786",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mhh2rl/help_with_camera_positions/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-04T15:47:37Z",
    "flair": null,
    "post_text": "I'm going to upgrade my spotty wifi cameras with PoEs and an NVR. \n\nI'm just not sure how many cameras I need or where to place them to ensure 360 degree coverage. [Here's my house](https://ibb.co/cS18L021) \\- I'd really appreciate it if anyone could help with suggested camera mounting locations."
  },
  {
    "post_id": 43,
    "title": "What's the least I should expect to pay for a decent, not necessarily great, 4K outdoor WiFi home camera, both fixed and PTZ, that doesn't only work with their proprietary software or app?",
    "author": "RaplhKramden",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mhh0f3/whats_the_least_i_should_expect_to_pay_for_a/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-04T15:45:14Z",
    "flair": null,
    "post_text": "I'm mostly ok with our 1K &amp; 2K WiFi cameras, but better resolution would be nice, to make out license plates and peoples' faces such. Perhaps even more important is that it work with 3rd party camera software, using RTSP and such.\n\nWhat's the least that I can expect to pay for a new one that's worth buying? I've seen ones as low as $50, but I assume that they're crap and only work with their proprietary app, which based on my experience is really limiting, like you can't review recorded footage on your PC at faster than 2x speed."
  },
  {
    "post_id": 44,
    "title": "needing 24 cams for a warehouse",
    "author": "Curious_Party_4683",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mhapd5/needing_24_cams_for_a_warehouse/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-04T11:20:46Z",
    "flair": null,
    "post_text": "does not have to be the best money can buy. \n\nthis should be good enough from Reolink right?  [https://www.amazon.com/REOLINK-Security-Surveillance-Detection-Recorder/dp/B0B5XGXCNP](https://www.amazon.com/REOLINK-Security-Surveillance-Detection-Recorder/dp/B0B5XGXCNP)  \n\nkit comes with 32 cams so i will keep the 8extras as spares...."
  },
  {
    "post_id": 45,
    "title": "Security camera that doesn't get washed out at night by street light etc.",
    "author": "JMVNYC",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mh7lpx/security_camera_that_doesnt_get_washed_out_at/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-04T08:09:49Z",
    "flair": null,
    "post_text": "\n\nI'm trying to figure out what's going on with a property of mine in Manhattan. There's a small outdoor area that keeps getting opened or possibly broken into—I’m not sure if it’s people or animals. It’s nothing valuable, just a basement window, but it’s happening repeatedly, and it's driving me crazy.\n\nI have a camera on it, but at night, the image gets completely washed out. The alley light and the basement interior light blow out the picture, so I can’t make out any details. I’ve turned off the camera’s IR and status lights, and it’s pressed against the glass. During the day, the image is fine. At night, it’s useless. I don’t want to stay up all night watching it—I just need to capture what’s happening.\n\nIs there a Wi-Fi camera that won’t get blown out at night through a window? Zoom would be great (optical preferred), but not critical. I just want a clear image so I can finally get to the bottom of this. \n\nFor reference, I've tried several Wyze and Reolink cameras with limited success. The quality just isn't good. I'm ready to spend some serious money. I use the Ring ecosystem for my smart home devices—are there any good indoor cameras?\n\nOh, and mounting a camera outside isn't an option - it's about 100 feet from my window, and between my window and the garage basement, there's a public alley."
  },
  {
    "post_id": 46,
    "title": "Moving to Platinum Shavano Oaks Apartments And just found out there is a peeping Tom terrorizing women. FML",
    "author": "momsvaginaresearcher",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mh5wb7/moving_to_platinum_shavano_oaks_apartments_and/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-04T06:19:41Z",
    "flair": null,
    "post_text": null
  },
  {
    "post_id": 47,
    "title": "Anyone know what this security camera brand and model is?",
    "author": "OkContext2161",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mh596e/anyone_know_what_this_security_camera_brand_and/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-04T05:40:27Z",
    "flair": null,
    "post_text": "Just moved into a home and found these existing security cameras installed. The seller was a real estate company and didn’t have any info about them.\n\nI’m planning to replace them with Ring PoE cameras, but identifying the current camera model would help me figure out how (or if) I can reuse the existing wiring. Any help would be appreciated\n\nhttps://preview.redd.it/3i0ubn6rwxgf1.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=acdb4092009d6231056bcd68ca1d1040feab058d\n\nhttps://preview.redd.it/wbtw2j1vwxgf1.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=9cf454a19c75af43acc370d41dbb78286807fc2c\n\nhttps://preview.redd.it/hsstza1ywxgf1.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=facfe19f119abe1d36074c6bbe290c5f6dbd6cb9\n\nhttps://preview.redd.it/in0guuaywxgf1.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=215e9ae90f3cc4fcdbb2ff36c0b1e8fed72742e9\n\nhttps://preview.redd.it/pygm83lywxgf1.jpg?width=2316&amp;format=pjpg&amp;auto=webp&amp;s=2ee5d7e73c1f31388d5b3b808930183057358d3a\n\n  \n"
  },
  {
    "post_id": 48,
    "title": "Ad and subscription free cameras",
    "author": "Putrid-Fig4166",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mgz4kf/ad_and_subscription_free_cameras/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-04T00:25:20Z",
    "flair": null,
    "post_text": "I've been using Yi/Kami cameras for years. Recently they added all these non-stop advertisements. It takes forever to open up the cameras now. They're offering a subscription but I don't feel comfortable with private video out in the cloud like that.  \n\nAny suggestions for ad/subscription free cameras to keep tabs on my elderly parents?"
  },
  {
    "post_id": 49,
    "title": "What is the best way to search videos ?",
    "author": "Pale-Tie-3691",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mgyo9r/what_is_the_best_way_to_search_videos/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-04T00:03:59Z",
    "flair": null,
    "post_text": "Got some videos to analyse and I m too lazy to watch it, what is your workflow to analyse videos? Are you using any software (cloud base or installed app) to do it ?"
  },
  {
    "post_id": 50,
    "title": "Wireless Security Cameras",
    "author": "PushPsychological967",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mgwh3x/wireless_security_cameras/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-03T22:24:57Z",
    "flair": null,
    "post_text": "I am looking for solar paneled cameras that I can mount high enough in the trees that my brother cannot find them or steal them! As unfortunately he has done many times in the past! I also do not have internet where I live, but I do have Internet on my phone! I'm wondering if there are any cameras out there I can access through my phone Hotspot or Bluetooth without a subscription! HELP PLEASE 🙏"
  },
  {
    "post_id": 51,
    "title": "Y Home Camera unusable now, best alternative?",
    "author": "montgolfier",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mgfhe3/y_home_camera_unusable_now_best_alternative/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-03T09:59:09Z",
    "flair": null,
    "post_text": "Hi all, had two Y home cameras for last few years which worked ok. Small clips for free is all we needed, now you can’t watch any recordings without a subscription so I’m looking for something similar \n\nAre there any budget cameras that record short clips without the need for a ‘cloud’ \n\nInterested in a budget camera doorbell also but not essential \n\nTIA"
  },
  {
    "post_id": 52,
    "title": "recommendations for a wireless camera?",
    "author": "Top_Blueberry9241",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mgbalt/recommendations_for_a_wireless_camera/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-03T05:28:51Z",
    "flair": null,
    "post_text": "I need a wireless indoor camera that we can mount or stick to our wall. Unfortunately it cannot have wires because we have two kittens who will chew on it. I’m having trouble finding something on amazon that doesn’t have crappy reviews. Any recommendations?"
  },
  {
    "post_id": 53,
    "title": "Sd card for security camera 2 3 hrs backup",
    "author": "Turbulent_Light_2538",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mg18u0/sd_card_for_security_camera_2_3_hrs_backup/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-02T21:03:53Z",
    "flair": null,
    "post_text": null
  },
  {
    "post_id": 54,
    "title": "Camera options?",
    "author": "JustTrying2Survive22",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mfga2w/camera_options/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-02T03:22:03Z",
    "flair": null,
    "post_text": "I want to get a doorbell, a camera for my driveway, backyard, a pet cam, and a camera to watch my Gecko (bonus if they do time lapse but not necessary) \nThis is obviously a lot of cameras. I want them to be under the same subscription and I don’t want to pay a crazy amount a month. Or a crazy start up fee. I don’t need the best of the best. Just decent any suggestions? "
  },
  {
    "post_id": 55,
    "title": "Outdoor Security cameras for my business",
    "author": "AdmirableAd2440",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mfdk3q/outdoor_security_cameras_for_my_business/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-02T01:03:34Z",
    "flair": null,
    "post_text": "I was previously using the Cobra surveillance with 4 cameras and they have worked very well even during hurricanes however recently the dvr won’t turn on anymore so I’m looking for something similar or even better if possible at a affordable price, the ones I had were around $300 and something so something around that price range would work. \n"
  },
  {
    "post_id": 56,
    "title": "Front-door Camera Recommendations",
    "author": "PianoMelodic3297",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mf8z0l/frontdoor_camera_recommendations/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-01T21:34:39Z",
    "flair": null,
    "post_text": "Hi, looking for some recommendations that best fit this situation. My grandma's security camera at her front door broke so I need a replacement for it.\n\n**Details:**\n\nI need a budget security camera (below $50) that wire will extend to her monitor (about 15-20 feet from the door) and show live feed on it. her original one was in black and white so no preference on that. I don't mind buying a extention cord, just don't want someone able to unplug it from outside. thank you."
  },
  {
    "post_id": 57,
    "title": "Is it possible to view cameras remotely using a LAN?",
    "author": "WishboneTemporary232",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mf752u/is_it_possible_to_view_cameras_remotely_using_a/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-01T20:20:23Z",
    "flair": null,
    "post_text": "I like the idea of setting up my NVR on my local network with no internet connection.\n\nMy concern is not being able to use the NVR app to view the feed wirelessly on a smartphone. \n\nDo I have any options here?"
  },
  {
    "post_id": 58,
    "title": "Looking for dual-lens camera and NVR to start a new setup with, moving away from Yi cameras",
    "author": "gislands",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mf3djv/looking_for_duallens_camera_and_nvr_to_start_a/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-01T17:54:51Z",
    "flair": null,
    "post_text": "Hi all, I have been lurking and reading for about the last week and am interested in getting a dual lens camera and an NVR to start with to begin a hardwired POE setup. I most likely will add more cameras down the road. Right now I have eight Yi cameras, I know about all the issues and the ads on the app, part of the reason I am moving on. That being said, I guess I'd lean towards an eight-port NVR. I have been looking at Hikvision and Amcrest products primarily, so to give you a sense, I am looking to spend $600-$800 or so on both the NVR and a dual-lens camera. I am looking to monitor about 50 feet of area on the front of my house by a garage and have it shoot out about 100 feet past the driveway into the street.\n\nThe question I have right now is about the Amcrest dual lens cameras on Amazon. One comes in at $400 and is 8MP per lens, and the cheaper $180 one appears to be 4MP per lens. Oh, and the $400 one has 131 feet of night color while the $180 one has 65 feet of night color. I am not sure if that is worth the extra $220, including twice the megapixels, or if that is a gimmick. Below are the links to the two cameras.\n\nAlso, I am pretty open to other brands, and to be honest, I have no real idea about NVRs and whether more expensive ones offer features worth the extra cost. All I know is some require you to buy an HDD, and some have them installed.\n\nMy main focus in this system would be ease of monitoring from an iPhone. I have had enough of watching goofy ads on the Yi app. I even tried to toggle off the personal ads, but I still seem to get them. Oh, and something from a brand that has a good reputation and products, as I can see myself replacing the rest of the Yi cameras in the future. The camera in my front is the one I look at probably 95% of the time, so that is the top priority now.\n\nI am open to everyone's opinion and expertise. This is a really interesting subreddit, and I have enjoyed all the information that is posted. Thanks in advance. G  \n  \n[$400 Amcrest Dual-Lens](https://www.amazon.com/gp/product/B0C9F5XK7D/ref=ewc_pr_img_3?smid=AM1AKWRN957PC&amp;psc=1)\n\n[$180 Amcrest Dual-Lens](https://www.amazon.com/gp/product/B0D2SB4CCS/ref=ewc_pr_img_4?smid=AM1AKWRN957PC&amp;psc=1)"
  },
  {
    "post_id": 59,
    "title": "Looking for dual-lens camera and NVR to start a new setup with, moving away from Yi cameras",
    "author": "gislands",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mf3b1j/looking_for_duallens_camera_and_nvr_to_start_a/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-01T17:52:11Z",
    "flair": null,
    "post_text": "Hi all, I have been lurking and reading for about the last week and am interested in getting a dual lens camera and an NVR to start with to begin a hardwired POE setup. I most likely will add more cameras down the road. Right now I have eight Yi cameras, I know about all the issues and the ads on the app, part of the reason I am moving on. That being said, I guess I'd lean towards an eight-port NVR. I have been looking at Hikvision and Amcrest products primarily, so to give you a sense, I am looking to spend $600-$800 or so on both the NVR and a dual-lens camera. I am looking to monitor about 50 feet of area on the front of my house by a garage and have it shoot out about 100 feet past the driveway into the street. \n\nThe question I have right now is about the Amcrest dual lens cameras on Amazon. One comes in at $400 and is 8MP per lens, and the cheaper $180 one appears to be 4MP per lens. Oh, and the $400 one has 131 feet of night color while the $180 one has 65 feet of night color. I am not sure if that is worth the extra $220, including twice the megapixels, or if that is a gimmick. Below are the links to the two cameras.\n\nAlso, I am pretty open to other brands, and to be honest, I have no real idea about NVRs and whether more expensive ones offer features worth the extra cost. All I know is some require you to buy an HDD, and some have them installed. \n\nMy main focus in this system would be ease of monitoring from an iPhone. I have had enough of watching goofy ads on the Yi app. I even tried to toggle off the personal ads, but I still seem to get them. Oh, and something from a brand that has a good reputation and products, as I can see myself replacing the rest of the Yi cameras in the future. The camera in my front is the one I look at probably 95% of the time, so that is the top priority now. \n\nI am open to everyone's opinion and expertise. This is a really interesting subreddit, and I have enjoyed all the information that is posted. Thanks in advance. G\n\n[https://www.amazon.com/gp/product/B0C9F5XK7D/ref=ewc\\_pr\\_img\\_3?smid=AM1AKWRN957PC&amp;psc=1](https://www.amazon.com/gp/product/B0C9F5XK7D/ref=ewc_pr_img_3?smid=AM1AKWRN957PC&amp;psc=1)  \n[https://www.amazon.com/gp/product/B0D2SB4CCS/ref=ewc\\_pr\\_img\\_4?smid=AM1AKWRN957PC&amp;psc=1](https://www.amazon.com/gp/product/B0D2SB4CCS/ref=ewc_pr_img_4?smid=AM1AKWRN957PC&amp;psc=1)"
  },
  {
    "post_id": 60,
    "title": "SZSINOCAM QG4 camera is completely dead after pressing Reset + Power",
    "author": "vranica1337",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mf1uim/szsinocam_qg4_camera_is_completely_dead_after/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-01T16:57:11Z",
    "flair": null,
    "post_text": "Hello everyone,\nI have problem with my SZSINOCAM QG4 4G camera. I unintentionally pressed the Reset and Power buttons at the same time, after which the camera completely shut down and has not powered on since.\n\nAt the moment, the only sign of life is the red charging LED, which does turn on when I connect the device to a 5V/2A power source.\n\n"
  },
  {
    "post_id": 61,
    "title": "YI Home/Kami Cameras - Paywalled all recorded video?",
    "author": "fatalPORKshank",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mexvd9/yi_homekami_cameras_paywalled_all_recorded_video/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-01T14:24:41Z",
    "flair": null,
    "post_text": "This system usability seems to have been nosediving recently. Starting with all the annoying ads on app startup to now seemingly paywalling the motion-detect recorded clips. When I try to watch a recorded clip, instead of the video very slowly loading for playback, I get a \"*Subscribe to Kaim Cloud to unlock all detected video contents*\" message. I used to be able to view a 6-second clip without subscription and could subscribe for longer clips or additional detection features. \n\nIs ALL playback now behind a subscription?? Really?? "
  },
  {
    "post_id": 62,
    "title": "Best security Cameras for GTA Canada",
    "author": "Flimsy_Adeptness1506",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mevs5i/best_security_cameras_for_gta_canada/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-01T12:57:01Z",
    "flair": null,
    "post_text": "Looking to see what are some best and affordable cameras that everyone been using that doesnt need much maintenance like frequent batter changing or charging, with a good storage options."
  },
  {
    "post_id": 63,
    "title": "Install on a dividing fence panel legal in uk ?",
    "author": "ianncc",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mes784/install_on_a_dividing_fence_panel_legal_in_uk/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-01T09:47:07Z",
    "flair": null,
    "post_text": null
  },
  {
    "post_id": 64,
    "title": "How to Automatically Disable Camera Alarm When I'm Home?",
    "author": "crepuscopoli2",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1meregy/how_to_automatically_disable_camera_alarm_when_im/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-01T08:56:48Z",
    "flair": null,
    "post_text": "Hi there!\n\nI bought an Imou camera with alarm features including motion detection, lights, and notifications that are triggered when it detects movement. It's a great device, but I want it to work only during specific times (from night to morning) **and** only when I'm not at home. When I’m home, I want the alarm to be completely disabled.\n\nI managed to set up the time schedule using the app’s \"Schedule\" feature, but how can I make it automatically turn off when I’m at home?\n\nAny suggestions?"
  },
  {
    "post_id": 65,
    "title": "Outdoor IP Camera Installation Under Angled Eave",
    "author": "Itchy_Worry4226",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1me9mw5/outdoor_ip_camera_installation_under_angled_eave/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-31T18:37:41Z",
    "flair": null,
    "post_text": "This is my first post here, and I’m hoping to get some advice on installing security cameras. I saw another post on reddit with an image that’s basically the same setup I have, but the thread was closed without any clear answers.\n\nI’ve got a slanted eave and need to drop the camera about 6 to 7 inches so the view isn’t obstructed. I’ll be using bullet cameras and want the installation to look neat and professional.\n\nHas anyone dealt with this before? Any suggestions for angled brackets or poles that would work well for this kind of mount?"
  },
  {
    "post_id": 66,
    "title": "How the heck do I take this down?",
    "author": "kelirving2",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1me7nqv/how_the_heck_do_i_take_this_down/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-31T17:22:43Z",
    "flair": null,
    "post_text": "I want to replace this trash 2mp camera that came with the house, but have no idea how to take it down. \n\nI removed both side screws, tried spinning the camera out, and spinning the casing to no avail."
  },
  {
    "post_id": 67,
    "title": "I need one wired camera with a continuous feed",
    "author": "Particular_Ladder925",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1me4o9t/i_need_one_wired_camera_with_a_continuous_feed/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-31T15:30:10Z",
    "flair": null,
    "post_text": "I am looking to setup a camera in my store that can see the front door. I work in an office and cannot see the door directly, I just want to see someone walk in on a small monitor so I know when to get up. I do not need any video storage, just a live feed I can view from my desk without any subscriptions. Wired is fine, but if there is a wireless option I won't have to drill holes to feed cables for that would be nice"
  },
  {
    "post_id": 68,
    "title": "Why dahua camera lens are set in the wrong way!",
    "author": "Spirited_Wolverine59",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mdvgh1/why_dahua_camera_lens_are_set_in_the_wrong_way/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-31T07:50:03Z",
    "flair": null,
    "post_text": "Everytime i need to change the angle of the lens, you can move it down but only up! which doesn't make sense to me, or am I wrong?"
  },
  {
    "post_id": 69,
    "title": "Is this layout good",
    "author": "mvrdoesthings",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mdj4ye/is_this_layout_good/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-30T21:31:26Z",
    "flair": null,
    "post_text": "Blue are doors , and the long stripe is a glass door wall \n\nIm gonna go with \n\nreolink duo 3v Poe (the one in the garden)\n\nReolink rlc 820-a black (the one by my driveway)\n\nAnd I have a reolink cx820 but not shure where to mount it .. \n\n "
  },
  {
    "post_id": 70,
    "title": "24/7 recording indoor system",
    "author": "andytumbles",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mcy08u/247_recording_indoor_system/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-30T05:13:46Z",
    "flair": null,
    "post_text": null
  },
  {
    "post_id": 71,
    "title": "Recommendation needed for Android /iOS apps that support bidirectional audio over RTSP or ONVIF",
    "author": "lolololxdtz",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mcxwjy/recommendation_needed_for_android_ios_apps_that/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-30T05:07:54Z",
    "flair": null,
    "post_text": "I'm experimenting building my own camera but it comes that I cannot find a good client app that support this adequately already."
  },
  {
    "post_id": 72,
    "title": "Quick review: Set up the new Baseus S2 as a Fox/Badger Cam and captured this in the middle of the night",
    "author": "robbiekhan",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mcu2le/quick_review_set_up_the_new_baseus_s2_as_a/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-30T01:51:40Z",
    "flair": null,
    "post_text": "Impressed by the quality really, it's 4K and even the IR night vision is good, though I prefer colour so the spotlight gets used on motion detection.\n\nI've now got the N1 series, S1 Pro Solar (not as good), S1 Lite Solar (new, good) and this S2 which is also solar with sun tracking panel, both of these are good quality IMO but you do also need a Micro SD card whereas the S1 Pro has internal storage as well as SD card slot. The N1 series connect to the Home Hub which has internal storage and HDD/SSD enclosure. Only the older models need the Home hub, newer models connect directly to wifi and then the app/cloud for anytime access like Ring cameras.\n\nOverall I am impressed with the Baseus app, the functionality offers some unique things over Ring's app (I have the Video Doorbell Pro 2), but otherwise functions and feels the same level of polished as Ring's app, just with no cloud sub needed.\n\nI think for the price, can't go wrong really, long as your home WiFi connection is robust. For ref my router is a Linksys Velop MX4200 Mesh series, I only have 1 in the middle of the house, and that is reached by the S2 by the shed at the end of the garden, as well as the S1 lite upstairs."
  },
  {
    "post_id": 73,
    "title": "Non-PRC/Chinese entry level system",
    "author": "WishboneTemporary232",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mct5r6/nonprcchinese_entry_level_system/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-30T01:08:34Z",
    "flair": null,
    "post_text": "I'm looking for an affordable entry level camera system that is not produced by a Chinese company.\n\nAny suggestions?\n\n"
  },
  {
    "post_id": 74,
    "title": "swann max ranger 4k mini vs Eufy 4k range?",
    "author": "davidsparky122",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mcnil7/swann_max_ranger_4k_mini_vs_eufy_4k_range/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-29T21:04:20Z",
    "flair": null,
    "post_text": "I currently own 2x  Eufy 2c pro have them them for about a year now and the interface is very easy to navigate and no cost of using this also I have them plugged into external solar chargers and they have lasted this whole time without having to charge. However they are very limiting in detail and what you can see. I’m looking at the new swann max ranger 4k mini range. It’s cheap affordable and I’m keen to hear how these have held up for people? "
  },
  {
    "post_id": 75,
    "title": "Home System Reccomendations",
    "author": "Union-Lurker",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mcjf5k/home_system_reccomendations/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-29T18:30:09Z",
    "flair": null,
    "post_text": "Recently had a roommate relapse hard and suddenly vanish from the homestead. If you are familiar with users you may know that this means all my catalytic converters are on borrowed time.\n\nSecurity cameras have been on the to do list for a few years but everything these days seems like open internet cloud based systems. Ideally I only need to access one or two cameras on my home network and maybe have them record to my NAS. Is this something you can do these days or am I just an old head? \n\nThanks y'all"
  },
  {
    "post_id": 76,
    "title": "Recommendations for a continuous recording battery powered camera, or audio triggered one.",
    "author": "Mazel2v",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mcfjgp/recommendations_for_a_continuous_recording/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-29T16:08:09Z",
    "flair": null,
    "post_text": "The neighbour has been verbally harassing us, so installing cameras that can record audio. \n\nI'm hoping to find a battery powered camera with local storage that is either:\n\n1. recording continuously so I can go back and clip footage every time there is an incident.  \nor   \n2. An audio triggered recording (sometimes there is no visual trigger and he is screaming at us from his backyard which we can't point at, with us inside.) \n\nAny recommendations would be great. "
  },
  {
    "post_id": 77,
    "title": "Need a camera with rtsp support",
    "author": "sumin101",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mcdert/need_a_camera_with_rtsp_support/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-29T14:47:21Z",
    "flair": null,
    "post_text": "like the title says.\n\nI need a stand alone 4G Sim camera (or wifi) which can stream the footage via rtsp to my api endpoint using something like opencv.\n\nim struggling to find something compatible. Reolink seems to only allow rtsp streaming if you purchase the NVR or homehub with the camera.\n\nas a minimum i need the camera to be able to stream via rtsp to my own application, but ideally, it would be perfect if it is 4g sim compatible and solar powered."
  },
  {
    "post_id": 78,
    "title": "Remove user from CloudEdge account",
    "author": "SophieMemphis",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mc8zmd/remove_user_from_cloudedge_account/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-29T11:34:05Z",
    "flair": null,
    "post_text": "I recently kicked my alcoholic husband out of the house. After he left, I realized he still has access to the two Yeskamo cameras via the CloudEdge account and can see me coming and going.... a very unsettling feeling given how unpredictable he is.\n\nHere are the steps I have taken so far:\n\n* Changed the WiFi password\n* Deleted camera device and resynced within CloudEdge account\n\nIs this enough? Would by Ex still have access to the cameras if he opened the app?"
  },
  {
    "post_id": 79,
    "title": "Best indoor and outdoor Dahua cameras ?",
    "author": "Maanu1141",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mc7o4h/best_indoor_and_outdoor_dahua_cameras/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-29T10:18:39Z",
    "flair": null,
    "post_text": "**Hello everyone!**  \n  \nI'm looking to upgrade my current Dahua NVR system and would really appreciate your input. I’d like to add an exterior camera to cover the outside of my local market, and also replace the existing camera monitoring the counter with a high-end model. Ideally, the new counter camera should offer crystal clear image ( when i playback the video to still keep the high quality when i zoom in — I need to clearly see the banknotes when they’re counted or handed over by customers )  \n  \nFor the exterior camera, I’m aiming for something reliable and high-quality. If it has built-in lights or features that can help deter thieves or burglars at night, that would be a huge bonus.  \n  \nI’ve spoken to a few security camera vendors in my area, but it feels like they’re just trying to push what they have in stock. So I’d much rather hear real recommendations from you guys.  \n  \nAlso, I’d like to install two additional cameras on my house for personal security and to monitor the surroundings when I’m not home. Since the market is located at my house's ground floor, I can connect them directly to the market's NVR also.  \n  \nMy budget is around **€150 to €300 per camera if there's something really worth it.**  \n  \nThanks in advance — I really appreciate your help!"
  },
  {
    "post_id": 80,
    "title": "Looking for a budget-friendly home security camera without subscriptions",
    "author": "Exciting_Wrap9690",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mc4mjp/looking_for_a_budgetfriendly_home_security_camera/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-29T07:00:14Z",
    "flair": null,
    "post_text": "I'm in search of a reliable home security camera that's easy to set up and doesn't require any subscriptions. Any recommendations?"
  },
  {
    "post_id": 81,
    "title": "Indoor Security Camera Question",
    "author": "Excellent_Tree_1459",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mc2ajc/indoor_security_camera_question/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-29T04:40:11Z",
    "flair": null,
    "post_text": null
  },
  {
    "post_id": 82,
    "title": "Swann DVR8-5580 camera issues",
    "author": "Waste_Revolution4457",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mbwx51/swann_dvr85580_camera_issues/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-29T00:15:44Z",
    "flair": null,
    "post_text": "Hi, Currently using the DVR8-5580 for a few years and recently not all of the cameras are working (down to 2 from 7). I have replaced the power supply ( for the cameras which hasn't helped. Is the DVR itself on the way out or the cameras(all swann but some are different models)? I'm not sure which to try next? Thanks!"
  },
  {
    "post_id": 83,
    "title": "Using tools/devices to mask/hide cameras on network (stealth)?",
    "author": "Downtown_Ordinary504",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mbu1k2/using_toolsdevices_to_maskhide_cameras_on_network/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-28T22:11:26Z",
    "flair": null,
    "post_text": "Any options to hide my Wifi network thus hiding any live cameras?\n\nThe goal is to stop Wifi intrusion/disabling property cameras remotely, which can be done if someone gains access to my network and/or they pick up my wifi signal.\n\n"
  },
  {
    "post_id": 84,
    "title": "Do Hikvision IP PoE Cameras Work Without NVR? Zoom/Orientation Control?",
    "author": "Public-Process6081",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mbkm6c/do_hikvision_ip_poe_cameras_work_without_nvr/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-28T16:18:12Z",
    "flair": null,
    "post_text": null
  },
  {
    "post_id": 85,
    "title": "Is this setup OK?",
    "author": "Solidus-Prime",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mbjxza/is_this_setup_ok/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-28T15:53:58Z",
    "flair": null,
    "post_text": "Each \"zone\" will have it's own PoE switch. All cameras in that zone plug into it. Then a single cable from each PoE switch in each zone goes to a \"main\" PoE switch that sits next to the NVR, which also plugs into this main PoE."
  },
  {
    "post_id": 86,
    "title": "Cannot identify this camera",
    "author": "Vik8000",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mbdfr8/cannot_identify_this_camera/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-28T11:17:20Z",
    "flair": null,
    "post_text": null
  },
  {
    "post_id": 87,
    "title": "USB-C to micro adapter? (For Tapo A201 / C425)",
    "author": "PracticlySpeaking",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1max755/usbc_to_micro_adapter_for_tapo_a201_c425/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-27T20:50:01Z",
    "flair": null,
    "post_text": null
  },
  {
    "post_id": 88,
    "title": "No WiFi at all, Free standing, nice looking home security camera with local storage only. No smarts, just record.",
    "author": "ShmooelYakov",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mavp02/no_wifi_at_all_free_standing_nice_looking_home/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-27T19:48:54Z",
    "flair": null,
    "post_text": "I'm looking for a system that is just one or two cameras, with no Wi-Fi signal for someone to connect to, and stores the video on either a large SD card, external HD, or DVR. I didn't want smarts, apps, remote access or anything. I'd also need it to be able to be free standing on a flat aurface and nice or discreet enough to be placed in a living room. It's like basic is harder now, I know I know everything is \"as a service\". Please help."
  },
  {
    "post_id": 89,
    "title": "Baby monitor help!",
    "author": "grangerthegoatgryff",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1masneu/baby_monitor_help/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-27T17:46:59Z",
    "flair": null,
    "post_text": null
  },
  {
    "post_id": 90,
    "title": "Camera rec for outdoor home surveillance?",
    "author": "EnoughPoem4132",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1manjhn/camera_rec_for_outdoor_home_surveillance/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-27T14:22:33Z",
    "flair": null,
    "post_text": "A high capacity Airbnb moved in across the street from our house in a quiet, residential neighborhood. It’s been such a bummer! This house has been a huge nuisance and we need to be documenting the disruptive and destructive behavior. We are dealing with parties, ride shares dropping off big groups of people, intoxicated people hanging out in the front yard and street, reckless driving, loud noise and illegal parking.\n\nI purchased a solar powered ieGeek brand camera. It is motion activated and even after playing with the settings a ton, it catches every kind of motion EXCEPT the ones we want across the street. Our tree blowing in the wind and cars driving by will set it off, but not activity at the rental property. We’ve only been able to capture things when we know it’s happening and we can manually record using the app. Of course the bad behavior is often happening in the middle of the night, and the camera stinks in the dark, even on the highest sensitivity motion detection. It has a “human detection” feature, but it doesn’t work. I played with the settings and even danced around in the front yard in front of the camera and it did not record me. \n\nDoes anyone have a rec for a camera that would be better for this kind of surveillance? Maybe something that just continually records and we could go through the footage and grab what we need? I’m not tech-savvy so not even sure what to look for. We have a Ring doorbell, so I’m wondering if one of their products could be a good fit? To capture the right angle, the camera needs to be in a place where we can not easily run a cord. I’m hoping to keep the cost reasonable. "
  },
  {
    "post_id": 91,
    "title": "Identify this camera",
    "author": "djchrisj123",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1madfrr/identify_this_camera/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-27T04:36:46Z",
    "flair": null,
    "post_text": "Recently bought a house with this camera attached. Other side of camera not shown shows brand name Flir but not sure what model it is exactly "
  },
  {
    "post_id": 92,
    "title": "What to keep in mind when hiring pros to install wired security cameras?",
    "author": "OJ_Jane",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mabrvu/what_to_keep_in_mind_when_hiring_pros_to_install/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-27T03:05:39Z",
    "flair": null,
    "post_text": "Hi, \nI’m planning to install a wired 4K security camera system (4 outdoor camera) on a home in the Seattle area. I’m leaning toward hiring professionals for the installation to make sure it’s done right and the wiring is clean.\n\nI’d love your advice on a few things:\n\t•\tWhat should I look for or ask when choosing a company or installer?\n\t•\tAny red flags or common mistakes to avoid?\n\t•\tRoughly how much should I expect to pay for professional installation ? (Ballpark estimates are fine)\n\nAppreciate any tips or insights you’re willing to share!\n"
  },
  {
    "post_id": 93,
    "title": "Hurricane strength camera",
    "author": "NervousClock2555",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1maap8i/hurricane_strength_camera/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-27T02:08:58Z",
    "flair": null,
    "post_text": "Moving to the beach.  Any suggestions on outdoor security cameras that could withstand potential hurricanes?   Preferably wireless and operating on WiFi.  "
  },
  {
    "post_id": 94,
    "title": "What can I do better",
    "author": "zackz99",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1ma8yqg/what_can_i_do_better/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-27T00:40:48Z",
    "flair": null,
    "post_text": null
  },
  {
    "post_id": 95,
    "title": "Can anyone identify this security camera make and model? (needed to scare trespassers away)",
    "author": "Traditional-Gas3477",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1ma3dqa/can_anyone_identify_this_security_camera_make_and/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-26T20:25:52Z",
    "flair": null,
    "post_text": "I've watched an urbex video where a man heard some click and looked up to see some camera with its IR sensor activated before being spooked and then bolting out of there.  I need this type of camera that has that creepy look  because I am a custodian owner of a massive facility that is often frequented by kids which is very annoying.\n\nIs this likely a security camera if it makes a click and then shows a red LED/IR sensor?\n\nCan I just add more security cameras but dress them up in miniature doll clothing to give that weird and creepy vibe???"
  },
  {
    "post_id": 96,
    "title": "Are there any wireless cameras that work only on my WiFi?  No subscription, no \"sign up\", etc....",
    "author": "LisaMay9",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1ma075m/are_there_any_wireless_cameras_that_work_only_on/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-26T18:12:46Z",
    "flair": null,
    "post_text": "I'm new to security cameras, I just want to be able to look at my iphone or iPad and see a live view of my driveway or child in the next room.  No recording, no artifcial inteligience, nothing special.  But every time I buy a set of security cameras that say \"wireless\" I end up being extorted for some kind of subscription.  I have powerful wifi (thank you Starlink) does anyone know of any kind of small camera I can use and leave plugged in to check the other side of the house without having to sign up and/or pay or give access to some third party to use the cameras?  \n\n  \nFor what it is worth, I have power outlets where I want the cameras, and they don't have to be night vision or even color.\n\n  \nThank you!"
  },
  {
    "post_id": 97,
    "title": "Wireless Security Camera that filters out cars",
    "author": "bss05",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m9z6rm/wireless_security_camera_that_filters_out_cars/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-26T17:31:13Z",
    "flair": null,
    "post_text": "I have an issue where a crazy neighbor is walking down the road in front of our house and shouts abuse at us on a daily basis, and occasionally trespasses onto our land. I thought putting a camera up on a tree by the road might dissuade him and I can collect footage in case we ever need to prosecute him. \n\nMy concerns are : \n\n1) The road is 100 ft from the house so it can't be wired - I'm hoping that buying a wifi extender will extend the range to the unit. I could have it by the house but it wouldnt be visible from the road and woudnt act as a deterrent. \n\n2) The road is busy and cars are passing almost every minute of the day. How good are the AI units in filtering out cars? It will be directed down the road - and the turning is 200ft away so that's a lot of road it will be capturing.\n\n3) I'm on a tight budget. Not keen on a subscription model.   \n\nI thought this unit might be good as it has 2 cameras so can capture him as he passes by - [https://www.amazon.com/gp/product/B0DWFKVNV3?smid=A8EBZYH92U6B8&amp;th=1](https://www.amazon.com/gp/product/B0DWFKVNV3?smid=A8EBZYH92U6B8&amp;th=1) \n\nBut if the AI isn't good about filtering cars then the SD card will be full in a day. \n\nI have read the Reolink Altas PT Ultra might be a solution as it records 24/7.\n\nWould greatly appreciate any suggestions!"
  },
  {
    "post_id": 98,
    "title": "System to catch vandalism",
    "author": "EntropySimian",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m9va93/system_to_catch_vandalism/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-26T14:52:52Z",
    "flair": null,
    "post_text": "I'm pretty certain that my neighbors lawn people are kicking in my side fence to harass my dogs. There are many broken boards that could only have gotten that way by being hit from the other side. The fence is only 2 years old and is well maintained. \nI'm looking for a camera that I can run all day, but more importantly, that records locally. I want to be able to review footage for 2-3 months and quickly find when the damage happens. I thought if there's a recording software that generateds a few pictures every day as a summary feed for quick reference, that would be great. Even better if I can host an AI to review footage. \nDoes anyone have suggestions for a solution? "
  },
  {
    "post_id": 99,
    "title": "Security camera for home",
    "author": "Powerful-Low-6726",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m9fd61/security_camera_for_home/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-26T00:17:48Z",
    "flair": null,
    "post_text": "I recently purchased a home and I’m looking for a subscription free service for home monitoring/ security. Any recommendations?"
  },
  {
    "post_id": 100,
    "title": "Tactacam defend cell camera alternatives?",
    "author": "Graham_Wellington3",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m998nl/tactacam_defend_cell_camera_alternatives/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-25T19:58:55Z",
    "flair": null,
    "post_text": "In need of some cellular cameras. 2-4. The camera seems great all around except for its paywall for viewing video or pictures. \n\nIs there an alternative that is similar?"
  }
]