[
  {
    "post_id": 1,
    "title": "Wanting mutiple cameras for the track.",
    "author": "Kindly_Teach_9285",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m75dxh/wanting_mutiple_cameras_for_the_track/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-23T10:14:06Z",
    "flair": null,
    "post_text": "I need a few cameras to record at the same time when I run at the track.\n\nIn car: facing me, the shifter and the windshield\n\nIn the grill: showing the front of the car\n\nOutside the car: side of the track recording my launches and run down the track\n\nI'll also need a way to splice the videos together. Not sure what software is reasonable to use. This is just for me, to gather more track data. What cheap cameras can I use to make this happen? How would I record the cameras in/on the car? Thanks for any help!"
  },
  {
    "post_id": 2,
    "title": "Camera Recommendations For A Church",
    "author": "rrodg12",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m74jds/camera_recommendations_for_a_church/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-23T09:21:08Z",
    "flair": null,
    "post_text": "Looking to purchase my church some security cameras. At the point I'm considering Unifi due to there AIs,expandability and ability to view on a web browser remove though the account. Im just asking here to see if anyone else k ow of any other possible alternatives. "
  },
  {
    "post_id": 3,
    "title": "Odd Question",
    "author": "5h4ckl3ford",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m73zfb/odd_question/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-23T08:44:16Z",
    "flair": null,
    "post_text": "https://preview.redd.it/5qm5qv666lef1.jpg?width=700&amp;format=pjpg&amp;auto=webp&amp;s=72475761c718c33de183bfa8b03604c3206a4ada\n\nI apologise this isnt a strictly Security camera question.\n\nAt my place of business I have a coil lifter very similar to this but it has been reengineered and in the reengineering the operator's vision is now somewhat obstructed, is the short range camera or technology (I thought maybe RF or something that could do the trick?) \n\nWe are trying to avoid having to use a SIM card (on going cost) and there is no wifi signal in yard."
  },
  {
    "post_id": 4,
    "title": "How exactly is it possible to have remote access to cameras with no cloud account?",
    "author": "BBGonda",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m6xox4/how_exactly_is_it_possible_to_have_remote_access/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-23T02:37:26Z",
    "flair": null,
    "post_text": "I recently setup some Tapo C120 cameras around the house and over the weekend I was surprised to discover I can access them remotely to live stream, change settings, etc. I was out of the house in another part of the city, nowhere close enough to be connected my house’s wifi, and I was still able to live stream all four cameras from my phone via the app. I had assumed I could only access the cameras while at home connected to my house’s wifi. I don’t have a cloud subscription or account, and all four cameras record locally to the microSD cards I've installed in each.\n\nI'm new to this tech and I'd like to understand  know how this is possible, since the main reason I purchased these cameras is that I didn't want anything on the cloud servers and all recording to be hard recorded, so locally on drives like a microSD. I suspect the Tap app enables remote control/access of the cameras through the TP-Link cloud server. Once the cameras are configured and connected via the app and my Tapo ID, it establishes a link via the TP-Link cloud server to my cameras and that’s how I can live stream remotely and change any settings/make commands. \n\nIf this is correct, my question then is are my live streams and short detection videos when the cameras are triggered uploaded to the cloud server and that’s how I can view them remotely? I mean, how else would I be able to remotely access the live stream and the video clips if they weren’t first uploaded to the TP-Link cloud server? I can edit these videos as well, really anything I could do on the app via my house’s Wifi. My concerns are for my privacy really and the reason I set these up to only record locally to a microSD. It would be helpful to understand what the intricacies of the tech process here are, and to what extend my videos and live streams are on the TP-Link cloud servers. Thank you!"
  },
  {
    "post_id": 5,
    "title": "Vichome firmware update notice",
    "author": "MsChiSox",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m6k7xb/vichome_firmware_update_notice/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-22T17:23:08Z",
    "flair": null,
    "post_text": "Hi, just got a firmware update notice in the Vicohome app for a couple of cameras. Can I just select \"later\" and not deal with it now without any issues? Looks like a new update and may have bugs in it"
  },
  {
    "post_id": 6,
    "title": "NVR to PC",
    "author": "flashly79",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m6aiwf/nvr_to_pc/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-22T10:30:49Z",
    "flair": null,
    "post_text": "I have a Swann NVR887080RN with 4x cameras attached via ethernet cable.  All cameras are working to the NVR and show up on my connected TV.  I have previously had the ethernet connected to my PC when 3x cameras were connected and was able to watch the cameras using the Swann app, HOWEVER, once I connected the 4th camera I have not been able to watch it any more on my PC.  I have absolutely no idea what I've done to make it longer work. If I remove the 4th camera I can still no longer watch anything through my PC. The ethernet cable is connected directly from the NVR to my PC. I'm using Starlink as my internet which runs to my PC through WiFi. \n\nAny idea what I'm doing wrong?  It may have just been a fluke last time I connected so please keep it simple with any explanation. (I'm getting old :P )"
  },
  {
    "post_id": 7,
    "title": "Genuinely curious: what kind of \"technical capability\" is required to review apartment security footage?",
    "author": "bluemoonshade",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m5tu3z/genuinely_curious_what_kind_of_technical/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-21T20:21:03Z",
    "flair": null,
    "post_text": "My apartment managers sent out this email to all residents and it made me curious what it is about reviewing security camera footage that requires technical capability. I have no particular need to see security footage at this moment, but I have an interest in this because I have come across this situation before. In college, my laptop was stolen from a campus common area in which there was a security camera. When I went to the campus security to see if they could see the security footage for any insight into who stole the laptop, they said they couldn't access the footage and didn't have the expertise to review it even if they did. In my mind, it seems it shouldn't be hard to pull up footage from the date and approximate time an event happened and then examine the footage, but I also want to give people the benefit of the doubt that they aren't being difficult for no reason or lazy. Is there something more complicated about the process? Is it more about legal liability/not wanting to have to get involved in any sort of court proceedings? Are they renting cameras from the actual police and therefore don't own it or have log in credentials? If anyone knows why this is a phenomenon, let me know! Super curious.\n\nEdited photo to take out city name. "
  },
  {
    "post_id": 8,
    "title": "New home construction - Ring vs Eufy vs Ubiquity Unifi?",
    "author": "lawstudent420",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m5tccl/new_home_construction_ring_vs_eufy_vs_ubiquity/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-21T20:02:34Z",
    "flair": null,
    "post_text": null
  },
  {
    "post_id": 9,
    "title": "New to cameras. Need advice",
    "author": "MrNakedPanda",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m5s064/new_to_cameras_need_advice/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-21T19:12:05Z",
    "flair": null,
    "post_text": "Hey y’all, I’m wanting the bare minimum here but I’m not sure I can get what I want. Any help is appreciated. I’m reasonably tech savvy but I’m not interested in complicated setup and maintaining a server or some central hub. I only need 1 camera. \n\nRight off the bat I’ll say I’m not paying for a subscription service. \n\nI want just 1 camera for inside a small apartment, that will give me notifications if it catches movement. If I can get live video of that movement that’s even better. We will only use the camera when away and at night. I don’t want an internet capable (I.e hackable) camera watching me all day, so I also don’t want cloud services if possible. Local storage is preferred. I do understand that getting live footage goes thru an app and they can aquire it that way… if I have to deal with that then I will. But local storage is still preferred because I’m not paying anyone to store footage I don’t care about long term. \n\nDo they make cameras that will just write over old data when the card storage is used up, essentially making it infinite storage? I don’t care about cataloging footage. It’s purely for notifying me if there is a break in or something. The apartment does not have an alarm system. \n\nDue to other post recommends. I’m looking at Reolink Poe cameras, something like an RLC-540A. But I’m having trouble determining if Poe means I can just splice it into my existing cat6 network, or if I would have to run new lines (deal breaker). I’m not interested in having to buy special software or a hub of some type, because again it’s only 1 camera for when we are not occupying the space. \n\nAm I being unrealistic with these requirements or is there something that fits the bill? \n"
  },
  {
    "post_id": 10,
    "title": "replacement needed for watchnet evi-1621-2T",
    "author": "ThatOneHypedGuy",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m5o759/replacement_needed_for_watchnet_evi16212t/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-21T16:51:59Z",
    "flair": null,
    "post_text": null
  },
  {
    "post_id": 11,
    "title": "Need help identifying this security camera",
    "author": "GuitaristKage",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m5mx4r/need_help_identifying_this_security_camera/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-21T16:04:09Z",
    "flair": null,
    "post_text": "Some added context : For around the last 3 years our Neighbor has been surveilling our backyard , side of our house , and front yard . this wouldn’t be an issue if it wasn’t also meant with constant stalking , Harrasment , and multiple police calls to our house . Other examples are motion activated lights specifically on our side of the house and no other. We have 2 cameras for legal evidence but don’t survey everything, recently when one of our cameras had to be charged he cut down a post of ours in our backyard which we were gonna use to create a blind so he couldn’t watch us on his camera , since the camera was down we have no evidence or proof and are therefore not doing anything about this . Can anyone help us know what Brand of camera this is and if it has the ability to record audio . Any legal advice would be nice too , there’s also plenty more examples of harassment but the list goes on for a long time"
  },
  {
    "post_id": 12,
    "title": "looking for cheap security camera with seperate local storage",
    "author": "Final-Scheme-7360",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m5lnsy/looking_for_cheap_security_camera_with_seperate/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-21T15:17:08Z",
    "flair": null,
    "post_text": "anyone know cheap camera with seperate sd card storage other than blink?\n\ni know blink has sync module but most other cameras seem to have sd card slot on camera\n\ni want one cheap camera with sd card hidden somewhere like blink"
  },
  {
    "post_id": 13,
    "title": "Moved into a house with a PoE camera setup. How do start I using it?",
    "author": "Baked_Brain",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m5aib0/moved_into_a_house_with_a_poe_camera_setup_how_do/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-21T05:27:26Z",
    "flair": null,
    "post_text": "Just moved into a new house and found this set up. Im trying to figure out how to actually use it. Inside the wardrobe, there's a PoE injector. Outside, there's a floodlight camera. No brand labels except for a serial number. "
  },
  {
    "post_id": 14,
    "title": "New home. Is this a camera?",
    "author": "Logical-Security7368",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m5afys/new_home_is_this_a_camera/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-21T05:23:42Z",
    "flair": null,
    "post_text": "I just moved and realized this in the back yard. I took a picture and google told me it’s a camera but my question is is it actually a camera or is it like the base to a camera and the lens is missing. In other words could someone be watching and I need to take it down? Or is it just the plastic base and there’s no lens"
  },
  {
    "post_id": 15,
    "title": "WIFI Camera with connection failover",
    "author": "Pikatchu714",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m5a9p2/wifi_camera_with_connection_failover/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-21T05:13:23Z",
    "flair": null,
    "post_text": "Is there a WIFI battery camera which has the below options.\n\n1-Connect to Home WIFI , if internet goes down(it has to monitor internet because usually it won't connect to 2nd wifi with the same SSID if the home router didn't shutdown) it connect to 2nd WIFI with different SSID\n\n2-Connect to home WIFI , If internet goes down , failover to 4G SIM Connection embedded in the camera."
  },
  {
    "post_id": 16,
    "title": "Market Validation for new product",
    "author": "Head_Arrival_6592",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m538rr/market_validation_for_new_product/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-20T23:21:22Z",
    "flair": null,
    "post_text": "Hey everyone, I am trying to create a new security product and trying to do market validation. The survey is 8 8-question MC and takes 1-2 minutes"
  },
  {
    "post_id": 17,
    "title": "Best home security camera",
    "author": "MotorEbb652",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m528xe/best_home_security_camera/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-20T22:37:09Z",
    "flair": null,
    "post_text": "I noticed it in a window of a building that has about 5 visible cameras. "
  },
  {
    "post_id": 18,
    "title": "IWFCam - No Memory Detected",
    "author": "Membrainn",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m4s7cs/iwfcam_no_memory_detected/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-20T15:48:34Z",
    "flair": null,
    "post_text": "Does anyone already experienced having a problem detecting there memory card? I already tried to format it via app but it just keeps loading for like 7-10mns then follow a message \"Session timed out\". \n\nI used 2 different memory cards just to be sure. Did a format as well via PC to FAT32 and EXFAT. Nothing works. Please help. "
  },
  {
    "post_id": 19,
    "title": "Seeking suggestions for basic home wireless NVR and IP camera setup",
    "author": "pineapplepizzabong",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m4rsma/seeking_suggestions_for_basic_home_wireless_nvr/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-20T15:31:51Z",
    "flair": null,
    "post_text": "The title pretty much sums it up. I am looking for help and suggestions on what to buy for a small and simple home security system. There are so many options that I find myself fairly overwhelmed.\n\n* I only need support for two to four cameras.\n* The cameras would be outside.\n* I already have a bunch of SSD HDs lying around for the NVR.\n* The two places I have marked for cameras already have DC power from a previous ADT home security system. AC power would also be easy to provide.\n* Since the NVR would be local to my network my goal would be avoid apps and subscriptions and I would simply view the videos locally as needed.\n* I would prefer a WiFi compatible NVR and IP cameras so I don't have to run a bunch of Ethernet cable. My wireless network reaches outside just fine and has plenty of bandwidth currently.\n* 1080p video quality is fine and 30fps would be nice to have but not necessary. I don't need 4K@60fps or anything like that haha.\n* IP cameras that have some level of low light support would be another nice to have.\n\nWhat do y'all think? Thank you for helping out a security camera beginner!"
  },
  {
    "post_id": 20,
    "title": "Camera System",
    "author": "Standard_Practice_29",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m4ehia/camera_system/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-20T03:05:21Z",
    "flair": null,
    "post_text": "I'm searching for a camera system to install in the four corners of my house that meets the following criteria:\n\n- No monthly subscription fees: This is critical.\n- Application or browser-controlled: The app must not have subscription-based features, as I want a fully functional default option without extra fees.\n- Solar-powered: Sustainability is important to me.\n- Wi-Fi enabled: For easy connectivity.\n- Local storage: Must have continuous recording capabilities in a loop"
  },
  {
    "post_id": 21,
    "title": "Where would a good spot for a security camera be for my garage . Condo townhouse",
    "author": "Frenchbulldogcanada",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m4c0hj/where_would_a_good_spot_for_a_security_camera_be/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-20T00:57:23Z",
    "flair": null,
    "post_text": null
  },
  {
    "post_id": 22,
    "title": "HELP Need Advice on Camera System to Keep Elderly Mom Safe",
    "author": "AdhesivenessOver840",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m473lf/help_need_advice_on_camera_system_to_keep_elderly/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-19T21:08:11Z",
    "flair": null,
    "post_text": "I need advice on an indoor camera system for my mom who's 96. My sisters and I have been taking 24/7 shifts at her house since a hospitalization. She's well enough to be on her own, but we want to make sure she's ok when we're not there. We just got a medical alarm system set-up. Now we need to get a camera system set up. We're looking for: Wide-angle view; night vision, audio so we can talk to her from our houses, phone app viewing (Apple), quiet/silent, small and discreet. We'll need 6 cameras altogether. Anything else we haven't thought about?"
  },
  {
    "post_id": 23,
    "title": "Question or suggestion about AOSU cameras DOA",
    "author": "Void_Listener",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m45k1t/question_or_suggestion_about_aosu_cameras_doa/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-19T20:01:24Z",
    "flair": null,
    "post_text": "I just bought the four pack of cameras from Amazon with solar panels for under $300. Seemed like a good deal. One arrived dead with no picture. All four connected to the hub. Taking them about 8 feet away from the hub turned the feed into a slide show. Anything further resulted in lost connections with an occassional single frame. The dead one being the exception, it only send a blue/green screen. I've seen good reviews but these came out of the box in a bad state. If they're broken out of the box, I don't want to deal with them.  \n\nI have been using Arlo cameras but they are now turning off features if you don't use their subscription service. Does anyone have good deals on a reliable 4 camera system? "
  },
  {
    "post_id": 24,
    "title": "Which 180° panoramic PoE camera with person detection under $300?",
    "author": "riverviewpark",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m40qvt/which_180_panoramic_poe_camera_with_person/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-19T16:41:24Z",
    "flair": null,
    "post_text": "I need to replace an existing 110° horizontal field of view (FOV) turret camera, would like a wider FOV.  Considering Amcrest's IP8M-DLB2998EW-AI dual-lens camera with in-camera image stitching, but open to alternatives with similar functionality.\n\nNeeds to be PoE, [Synology-supported](https://www.synology.com/en-us/compatibility/camera/37665) as a single stitched image stream, and should offer RTSP and storage/backup via MicroSD and SFTP, and in-camera person detection.\n\nLeaning towards the Amcrest for the FOV (H:180° x V:81°) has more vertical field compared to Reolink Duo 3 (H: 180°; V: 55°) and also because Reolink still only offers cleartext FTP, no SFTP support.\n\nAre there other turret/bullet cameras worth considering in my budget?"
  },
  {
    "post_id": 25,
    "title": "Yi camera. Don't buy it",
    "author": "Public_Key8956",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m3uf1q/yi_camera_dont_buy_it/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-19T11:55:48Z",
    "flair": null,
    "post_text": "I have 3 of these cameras and I bought them a while ago. The app now is infested with ads. You can't skip it. You have to wait like 30 seconds before you can see the place you are monitoring. Piece of junk anymore. "
  },
  {
    "post_id": 26,
    "title": "Fuzzy lines on camera at night",
    "author": "Azztrix",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m3tuzk/fuzzy_lines_on_camera_at_night/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-19T11:24:27Z",
    "flair": null,
    "post_text": "Howdy people I have a ptz camera 54x zoom Sony chip 8mp Aliexpress job which works surprisingly well except at night it has a bunch of fuzzy lines like from IR feedback or something. Once the picture focuses it's reasonably clear I guess just got these weird lines. It gets programmed via preset values just wondering if there is a fix or if I should just get another. I've attached a picture of my paddock and horse for example which is about 40 meters away. "
  },
  {
    "post_id": 27,
    "title": "Does anyone use this modem?",
    "author": "Unlikely_Wombat10",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m3rr2a/does_anyone_use_this_modem/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-19T09:08:30Z",
    "flair": null,
    "post_text": "I'm looking for a 4g wifi router/modem that I can hook up to a solar panel to provide wifi to a couple of solar cameras. Just wondering if anyone could share their experiences or thoughts on this one? Or maybe had a suggestion of a more suitable one. I dont want to spend a lot of money as it's only temporary. I will get the power connected eventually🤞 I'm in Australia."
  },
  {
    "post_id": 28,
    "title": "Eufy",
    "author": "FLEAL76",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m3m332/eufy/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-19T03:25:48Z",
    "flair": null,
    "post_text": "I just received an order of Eufy C31 door bell video camera. I bought it because it has an onboard built-in camera which could be used to keep the camera on when the power goes out. Next thing that is important is 24/7 video recording. And it would get power from the current doorbell transformer. I also want to use the original chime. Well, I temp installed the doorbell after setting it up and when I connected it to the doorbell transformer power it detected power and then gave me other options. Basically it either allows 24/7 recording without the use of my original chime or it allows use of my original chime without 24/7 recording. Both features are not allowed to function together by which is a major deal breaker for me. Anyone know if a workaround is possible? The reality is that this is a simple fix with a firmware update if Eufy so chose. I don’t have any interest in a camera with a subscription and that’s why I’ve stuck with eufy.  I emailed eufy support about it and am waiting for their response."
  },
  {
    "post_id": 29,
    "title": "best bedroom security cameras ?",
    "author": "digigirlwurld",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m3fnz3/best_bedroom_security_cameras/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-18T22:16:12Z",
    "flair": null,
    "post_text": "hi reddit i’m looking for a security camera that can be mounted on the ceiling in a corner ! a lot of the ones i’ve seen online are desktop with limited plugins , but also they seem too sleek for me . if anyone has any suggestions i would really appreciate it !!"
  },
  {
    "post_id": 30,
    "title": "Installing mesh/AP in between NVR and POE switch that is connected to 4 cameras",
    "author": "jeggernawt",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m3cyap/installing_meshap_in_between_nvr_and_poe_switch/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-18T20:23:42Z",
    "flair": null,
    "post_text": "https://preview.redd.it/2ukma27hxodf1.png?width=1799&amp;format=png&amp;auto=webp&amp;s=6159c951fef7c9b6414661b70555891ce62f8f27\n\nWe recently switched ISP providers. Previous provider took back their mesh system. New ISP does have better wifi coverage throughout our home, except in the garage and basement bathroom(wifi reaches about 70% of the time). Now in order to get full wifi coverage in the garage, I was thinking of getting a single unit of a TP link wifi extender/AP/mesh. Problem is, I'm not sure if it'll work with how I setup the cameras for our home. We do spend a lot of time in the garage to hangout as well, so we do need wifi there.\n\nCurrently, 4 cameras are connected to a POE switch in the garage, that POE is connected via ethernet to the NVR in the living room that is directly connected to our NAH/Modem/Router.  \nWould my attached diagram work for both wifi in the garage and NVR receiving the camera signals?\n\nAny advise/answer would be greatly appreciated before I make a purchase.\n\nedit: all connections are hard-wired. i just didnt want to have to drill extra holes. the AP would act as a pass-through in between the NVR and POE switch.  \nNVR in living room to the POE switch in the garage are connected via an ethernet line that runs outside the house. i don't have the skills to run these lines within the walls nor do i have the time. lol. and would/could not spend upwards and maybe over $1000 CAD on getting it done professionally."
  },
  {
    "post_id": 31,
    "title": "Recomendation for DVR using Trackmix wifi.",
    "author": "u_siciliano",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m2rv3p/recomendation_for_dvr_using_trackmix_wifi/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-18T03:32:49Z",
    "flair": null,
    "post_text": null
  },
  {
    "post_id": 32,
    "title": "LTS camera adjustment",
    "author": "BloodyNightwalker",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m2rqlt/lts_camera_adjustment/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-18T03:26:18Z",
    "flair": null,
    "post_text": "Hello everybody quick question. I’m the building maintenance for our building and I need to slightly adjust these LTS cameras and I cannot for the life of me figure out how to adjust them. They are very tight. I am not the one that installed them, but they need to be adjusted Any assistance is greatly appreciated"
  },
  {
    "post_id": 33,
    "title": "Aosu cameras connecting to monitor.",
    "author": "Mike-huntts",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m2qp35/aosu_cameras_connecting_to_monitor/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-18T02:33:49Z",
    "flair": null,
    "post_text": "Anyone have any idea how I can connect my aosu cameras to a computer monitor? Want to have it continuously running beside my tv with the cameras up. "
  },
  {
    "post_id": 34,
    "title": "Ring Camera hacked?!",
    "author": "Ok_Accountant_4954",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m2nz8s/ring_camera_hacked/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-18T00:23:39Z",
    "flair": null,
    "post_text": null
  },
  {
    "post_id": 35,
    "title": "Whats wrong",
    "author": "cashma352",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m2lkgu/whats_wrong/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-17T22:36:10Z",
    "flair": null,
    "post_text": "Why are my cameras doing this"
  },
  {
    "post_id": 36,
    "title": "Hiseeu",
    "author": "jnctx2020",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m2emco/hiseeu/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-17T18:02:47Z",
    "flair": null,
    "post_text": "Hello we just purchased a hiseeu system for our business and the led lights we have a affecting the cameras so that black lines are running through the screen. Anyone know what I can do to fix this or a similar system that will work. Our older revo system works fine with the lights but it's from 2008 and needs replacing. Any help would be great thank you "
  },
  {
    "post_id": 37,
    "title": "Looking for wireless, solar, no subscription security camera",
    "author": "Spetz",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m2dp4v/looking_for_wireless_solar_no_subscription/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-17T17:27:55Z",
    "flair": null,
    "post_text": "I’m looking for a wireless security camera for the side of my house. The plan is to have the camera sit behind a motion activated security light from Sansi as a deterrent.\n\nCriteria:\n\n* No monthly subscription – critical\n* Application or browser controlled, but the application must not have subscription fee based options, because this means that the default option without subscription is not good enough.\n* Solar powered\n* Wifi\n* Local storage with continuous recording in loop capability\n* No budget limit, but I do not want to run wires through my house.\n\nThanks for the advice in advance."
  },
  {
    "post_id": 38,
    "title": "Help document emotional abuse in Texas",
    "author": "mugskitten",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m2d4x8/help_document_emotional_abuse_in_texas/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-17T17:06:35Z",
    "flair": null,
    "post_text": "Hi, I am working to try and find a camera that will accurately record situations in my house. My stbx husband is extremely volatile and emotionally abusive, screaming, broken furniture, a broken window, doors, punched holes in walls ect. My current blink cameras are notorious for not activating when motion is sensed right away so a lot is missed. I have filed for divorce, just waiting for him to be served, if it was just me I would just leave, but I have 4 kids, one works locally, and school starts in a few weeks, and we have 2 ferrets, and 8 cats whom he has threatened to kill. So please help me find a c camera solution that I can document this for court. "
  },
  {
    "post_id": 39,
    "title": "Security Camera Recommendations",
    "author": "Anxious_Hearing9607",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m2a6wv/security_camera_recommendations/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-17T15:13:53Z",
    "flair": null,
    "post_text": "What are some budget-friendly security cameras that i can place around the perimeter of my home?\n\nI’m 18F and I live with my mom, her boyfriend, oldest brother, his gf and 4 of his kids. \nWe do live on a budget and just this morning someone broke into both of our storage buildings next to our single-wide trailer and camper, and poured gasoline on my brother’s reptiles while it was me and my nephew home alone.\n\nThis is not the first time someone has attempted to break into our storage buildings."
  },
  {
    "post_id": 40,
    "title": "UNV NVR having issues with cameras extended via network",
    "author": "LightGuy48",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m26cbn/unv_nvr_having_issues_with_cameras_extended_via/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-17T12:34:13Z",
    "flair": null,
    "post_text": "I'm working on a UNV NVR system with 100% UNV cameras, no third party hardware. The NVR is a 302-16E-P16-B.  Due to the facility layout having multiple buildings we have four cameras in another building and those four cameras are connected via fiber back to the NVR and plugged into switchport 16 on the rear 16 port PoE switch of the NVR.\n\nHowever, for some reason the NVR does not seem to 'like' a 2nd switch where multiple cameras are residing on one interface,  I've seen this before at another site too where multiple cameras shared one interface.  Sometimes one or two cameras will disappear and then reappear, sometimes they all disappear. The connection is via two Cisco switches on a GB fiber connection via Cisco SFP's.  Cisco switches show no port errors, no connection drops, nothing abnormal on the line between the buildings.\n\nSo is the built in switch on the NVR not a true switch or something unique to the UNV unit where it only wants to see one camera per interface?   Is there a workaround to fix the issue of the cameras disappearing and reappearing?  Thanks!"
  },
  {
    "post_id": 41,
    "title": "Need advice for buying a security camera for my apartment",
    "author": "andreas_kieling",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m20dw8/need_advice_for_buying_a_security_camera_for_my/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-17T06:37:23Z",
    "flair": null,
    "post_text": null
  },
  {
    "post_id": 42,
    "title": "Is this setup worth it",
    "author": "SAFETYfirsst",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m1tq5m/is_this_setup_worth_it/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-17T00:47:04Z",
    "flair": null,
    "post_text": "Very new to Security Cameras, and need a setup similar to this for my business. My question is, will this work off grid (More than 1000ft away from a currently established wifi connection. Also, is this way overpriced, and if so, how much would I save building this by myself.\n\nhttps://preview.redd.it/fymc3gl90cdf1.png?width=2356&amp;format=png&amp;auto=webp&amp;s=60269eeae2dd21664013b46ce4d62f9f9687e4b1\n\nhttps://preview.redd.it/3wntwi1a0cdf1.png?width=850&amp;format=png&amp;auto=webp&amp;s=5fb3b8995f71f543e64652ad2f1efe7f34d88c85\n\n"
  },
  {
    "post_id": 43,
    "title": "Swann Security camera not recording",
    "author": "Sunor-",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m1cl2i/swann_security_camera_not_recording/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-16T13:27:35Z",
    "flair": null,
    "post_text": "Hello just got a new swann security camera set. ive set up 2 cameras 2 days ago yet theyve not been recording anything. theyve got a 256gb micro sd inside aswell however nothing has been captured. i want it to record 24/7 not just motion."
  },
  {
    "post_id": 44,
    "title": "tight budget, camera system that uses google one storage",
    "author": "nexgenasian",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m13v0w/tight_budget_camera_system_that_uses_google_one/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-16T04:58:08Z",
    "flair": null,
    "post_text": "Is there a security camera that lets you set up google one as the storage? I'd like to store data to the cloud whenever there's motion or sound and get alerts. I'm on a budget of about $100 a camera and would like to only pay for the google one subscription. Preferably it would also only use so much of the google one drive and delete older files say after 10 GBs.  Thanks for the help in advance!"
  },
  {
    "post_id": 45,
    "title": "DW Spectrum cloud issues",
    "author": "hamel2021",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m10qwq/dw_spectrum_cloud_issues/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-16T02:14:12Z",
    "flair": null,
    "post_text": "Is anyone using DW Spectrum and having issues with the cloud accounts getting timed out weekly?  I have multiple sites that have clients logged in with a cloud account for remote view of their systems and in the past few months I have been having them get timed out every week even though on those servers the settings are set to not limit session duration.  When this happens my phone and laptop will have issues getting back into the cloud account as well.  I have raised multiple support tickets and have gotten nowhere with support.  The last one was to update to the latest version which has been done on all the sites but then again tonight it timed out again.  It also seems to be hit and miss on whether I can just sign them right back in or I have to wait for an hour or so like tonight.  The only thing i have noticed is that systems that are on V5 still do not appear to have this issue.  Just V6..  "
  },
  {
    "post_id": 46,
    "title": "Camera for catching fly tippers",
    "author": "lonelydaduk",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m0oecx/camera_for_catching_fly_tippers/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-15T17:42:02Z",
    "flair": null,
    "post_text": "I need a camera that’s covert, battery powered and can see number plates at night.\n\nAt home I have a unifi system but this location up the road from my house is used by fly tippers weekly. Driving to work and seeing fridges, mattresses and the contents of some unscrupulous house clearing is depressing me so I need to take some vigilante action and capture them.\n\nI’ve done some base research but I think most night cameras reflect number plates (i know my unifi cameras do) so looking for recommendations.\n\n"
  },
  {
    "post_id": 47,
    "title": "First time security camera",
    "author": "Copingphonix79",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m0ldrm/first_time_security_camera/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-15T15:50:30Z",
    "flair": null,
    "post_text": "First time wiring up security cameras in new home what y'all think. Mounted the box under desk. "
  },
  {
    "post_id": 48,
    "title": "YI Home can't view clips anymore unless you have cloud... time to sent camera to the trash",
    "author": "elyuma",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m0it46/yi_home_cant_view_clips_anymore_unless_you_have/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-15T14:11:24Z",
    "flair": null,
    "post_text": null
  },
  {
    "post_id": 49,
    "title": "Camera for license plates/stalker",
    "author": "Organic-Distance",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m0hwfp/camera_for_license_platesstalker/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-15T13:33:24Z",
    "flair": null,
    "post_text": "Hi!\nI have an issue with a person surveilling my house. She never enters the property but does drive by and stop on the street to \"look\". Lawyers advised to see if I can record her and we can show a pattern of obsession. (Not looking far advise on how to deal with her)\nAnyhow, I do have a home security system (eufy) but the house is further back from the street and the cams wouldn't capture anything. I also live on a street with frequent traffic. \nSo what I'm looking for is a solution that only records the stalkers car, even at night, and doesn't need wifi as the signal might not always reach to the street. I'm also not a super technical person, easy out of the box setup would be great!"
  },
  {
    "post_id": 50,
    "title": "I need help my car was burned in my back yard can somone identify this camera",
    "author": "pl3ase_help",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m06t47/i_need_help_my_car_was_burned_in_my_back_yard_can/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-15T03:06:02Z",
    "flair": null,
    "post_text": " Someone burned my car in my backyard i have no insurance  im screwed... this trailer has a camera   point at my back yard   he said it dont work i think hes lying and is covering for his brother  who i think did it i have some evidence but not enough.  does this have onboard storage ? Or anything? I need help im completely  doomed\n"
  }
]