[
  {
    "post_id": 1,
    "title": "Hospitalisation leave for majority of NS",
    "author": "Guilty-Effective657",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mpnd6h/hospitalisation_leave_for_majority_of_ns/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-14T01:47:00Z",
    "flair": "Question",
    "post_text": "I’m wondering if anyone has had friends that basically was on HL majority of their NS. I have a few injuries that i was thinking i might as well do surgery for them while in NS since it’s almost fully covered by the Govt but i’m afraid that they’ll Pes F me or something what will they do to me ? btw i’ve basically only served like 6 months of NS so far and another like 4 months of HL"
  },
  {
    "post_id": 2,
    "title": "potong jalan but opposite",
    "author": "Free_Assistance7827",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mpka4f/potong_jalan_but_opposite/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-13T23:29:33Z",
    "flair": "Question",
    "post_text": "we all heard of the girlfriends who get potong jalan by uni guys while their bf is in ns, but curious to know if there are any stories of nsfs who potong jalan uni guy’s gfs? general consensus will probably be no/got their bunkmates to be gay with but hey u never know theres gotta be at least one."
  },
  {
    "post_id": 3,
    "title": "Avg WOSPEC (REG) pay from 1SG to 3WO",
    "author": "FlatwormGuilty",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mp4rjo/avg_wospec_reg_pay_from_1sg_to_3wo/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-13T13:40:10Z",
    "flair": "Question",
    "post_text": null
  },
  {
    "post_id": 4,
    "title": "SPF NSF Medical Board Review",
    "author": "Comfortable_Mud_1080",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mp1acl/spf_nsf_medical_board_review/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-13T10:59:57Z",
    "flair": "Question",
    "post_text": "Hi, I recently went for medical review at the MO for Up-PES and my medical reviewed was completed. I was informed that my PES has been scheduled for Medical Board in absence. Does anyone knows what does this means? And do the MO issued you LD when you submitted your review?"
  },
  {
    "post_id": 5,
    "title": "Can i open a sealed memo from public psychiatrist",
    "author": "MembershipPopular160",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mp03ib/can_i_open_a_sealed_memo_from_public_psychiatrist/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-13T09:50:30Z",
    "flair": "Question",
    "post_text": "I received a sealed memo from the psychiatrist at a public hospital and was told to pass it to my unit MO. I'm very tempted to know what the memo says, can i open it? Will the MO still accept the memo if i open it?"
  },
  {
    "post_id": 6,
    "title": "I want to go to guards so badly",
    "author": "Strong_Soil5692",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mori80/i_want_to_go_to_guards_so_badly/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-13T01:42:02Z",
    "flair": "Rant",
    "post_text": "Man I’m currently an Air Force Tech and I really don’t want to be one. I wish I could have gone to guards man it looks so much more fun. Fk ns for making me come to Air Force."
  },
  {
    "post_id": 7,
    "title": "What are your best OPFOR stories?",
    "author": "c_zhukov",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mob8ha/what_are_your_best_opfor_stories/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-12T15:06:02Z",
    "flair": "Funny",
    "post_text": "been watching Half As Interesting's latest video on the US creating \"fake countries\" for military exercises, and they mentioned the 409th Infantry Battalion (American OPFOR). I've been reading some amazing stories involving them and their shenanigans.\n\nFellow Singaporeans, what's your best (most hilarious / most ridiculous / most badass) story involving OPFOR?"
  },
  {
    "post_id": 8,
    "title": "Question about vocation during bmt",
    "author": "EnthusiasmSolid4130",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mo70de/question_about_vocation_during_bmt/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-12T12:12:19Z",
    "flair": "Question",
    "post_text": "So our sergeant claims that he knows our vocation already and we don’t know whether he is trolling or what. We completed all 3 highkeys and still have 5 weeks of BMT to go, is it really possible that he already knows our vocation in advance?"
  },
  {
    "post_id": 9,
    "title": "MP SPEC. Please send info",
    "author": "Sensitive_Wedding_66",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mo5nvg/mp_spec_please_send_info/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-12T11:04:28Z",
    "flair": "Question",
    "post_text": "Got posted as a MP spec for my pro term of scs. How lax/strict is the training? Do I have to do SoC? How’s the camp (mowbray) in general?\n\nHoping to just get a general gist of life for the next 3 months"
  },
  {
    "post_id": 10,
    "title": "SCS recce pro term AISCC, what to expect?",
    "author": "Mental-Current-6811",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mo4lzj/scs_recce_pro_term_aiscc_what_to_expect/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-12T10:03:54Z",
    "flair": "Question",
    "post_text": "Going into SCS inf recce pro-term tomorrow. What should I expect as the high-keys and general timeline? \n\nAdditionally:\n\n1. Are there any overseas deployments during recce pro term regardless of subvocation?\n\n2. Do we still get to ride motorbikes? I heard that’s being phased out\n\n3. What’s DAFQC?\n\n4. Is it true that the week we do BVOC is stay out?\n\n5. Are there any high keys in the second week that I die die cannot miss? I have an exam that week and want to ask for an off-pass once I in-pro. "
  },
  {
    "post_id": 11,
    "title": "ORD quizzes not done but ord-ed",
    "author": "Plastic_Beginning128",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mo3a2m/ord_quizzes_not_done_but_orded/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-12T08:39:29Z",
    "flair": "Question",
    "post_text": "\n\nI officially ord-ed yesterday but i forgot to do my quizzes. Anyone knows whats gonna happen? They arent accessible in the oneNS app anymore, as my app has transitioned into the NSman version. When i went to persnode to outpro few days before i ord, i just clicked yes to completing the survey, intending to do it later but i forgot. Thanks"
  },
  {
    "post_id": 12,
    "title": "second class or just pass for shooting got chance to get PROCOM",
    "author": "Own-Pollution-1808",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mo379r/second_class_or_just_pass_for_shooting_got_chance/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-12T08:33:57Z",
    "flair": "Question",
    "post_text": "My shooting test is coming up and I’m afraid I might not get first class or marksman, so I just wanted to ask if getting second class or just pass is there still a chance to get procom?"
  },
  {
    "post_id": 13,
    "title": "artillery scs pro term (himars)",
    "author": "Tasty-Country-1501",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mo1s47/artillery_scs_pro_term_himars/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-12T07:02:00Z",
    "flair": "Question",
    "post_text": "artillery scs pro term (himars)\n\nwhat to expect for arty pro term hirmas \n\nwhat are the day to day like\nwhat to expect for the whole of pro term + after scgp"
  },
  {
    "post_id": 14,
    "title": "Suffering with mental issues",
    "author": "BickDock0665",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mo1j0o/suffering_with_mental_issues/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-12T06:46:10Z",
    "flair": "Serious Discussion",
    "post_text": "Throwaway for obvious reasons.\nEver since NS,  my mental health has been falling apart. I can’t sleep properly, can’t focus, and I wake up every day with this heavy, sinking feeling. The change of environment, the constant pressure, the lack of proper rest — it’s crushing me. I feel like I’m just dragging my body through each day while my mind is shutting down.\n\nI’m not even staying in Singapore, so I don’t have the time or place to properly see an outside doctor or get a memo. On top of that, I feel like I have no life anymore — I only get a few hours of real rest a week, and it’s not enough to recover mentally or physically. Recently, I’ve even been having dark thoughts about whether life is worth going on like this.\n\nI’ve seen the MO, got referred to pcc (still waiting for the appointment date), but honestly I’m scared they’ll just throw me a downgrade and expect me to push through instead of letting me go. I’m not trying to siam NS — I understand everyone has to serve, but I genuinely don’t think I can last two years like this without completely breaking. I just want to get better, and right now I don’t see how that can happen while stuck here.\n\nHas anyone here actually managed to get PES F for mental health reasons? Or do they just keep you in until you collapse?\n"
  },
  {
    "post_id": 15,
    "title": "Anyone in sungei gedong lose their ISAC card?",
    "author": "Standard-Buy794",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mnyf0s/anyone_in_sungei_gedong_lose_their_isac_card/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-12T03:49:58Z",
    "flair": "Question",
    "post_text": "If you lost it pls pm me ur nric and lmk where u are, I found it on the floor in camp. Idw go persnode or anything incase you kena for losing it."
  },
  {
    "post_id": 16,
    "title": "SCS SIGNALS SPEC PRO TERM",
    "author": "Anxious_Block_2957",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mnqjvf/scs_signals_spec_pro_term/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-11T21:58:33Z",
    "flair": "Question",
    "post_text": "hi all, just received my SCS Pro Term posting as SIG SPEC at STAGMONT CAMP. what can i expect as a SCT there and later on as a 3SG?"
  },
  {
    "post_id": 17,
    "title": "ASAs, what are your most memorable stories?",
    "author": "KingInRed-2001",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mnggxi/asas_what_are_your_most_memorable_stories/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-11T15:43:33Z",
    "flair": "📖 Story",
    "post_text": "As per title, let me know what stories you have as a former/current ASA. Feel free to drop your unit/HQ and branch"
  },
  {
    "post_id": 18,
    "title": "What vocations might a Chinese PR get posted to?",
    "author": "Shoddy_Twist_5599",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mne3wj/what_vocations_might_a_chinese_pr_get_posted_to/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-11T14:13:21Z",
    "flair": "Question",
    "post_text": "I'm joining BMT in Tekong by Oct, and I heard that going to Tekong is basically equivalent to SAF. I'm a PES B1 and actually am quite excited yet anxious to go to NS... anxious because I don't want to have a bad time being pressured by mean sergeants or not being able to make friends...\n\nCutting straight to the chase: I don't really want to become infantry guard artillery etc. boring vocations with endless training, despite knowing choice being a mere illusion in the military. I have been working hard as a biochem student and have knowledge regarding wound treating, pharmaceuticals, and human anatomy (also quite a bit of disease diagnosing and dissection using animal models), and I often collaborate well within a team as a leader (with rather positive morale). Thus I was wondering if there is still a chance for me to become a medic or sergeant as a PR... (or military police? I wanna seek some purpose during NS as well)\n\nHas there been cases of Chinese PR been able to join the SCS (even better OCS but I wouldn't even dream of it) or been allocated to special vocations such as medics in SAF? Or is it extremely rare for a PR to get these vocations no matter how hard they try due to preference towards citizens?\n\nI'm quite ignorant regarding NS facts so any piece of opinion or advice will be greatly appreciated!\n\nEdit: Thx yall! I've stopped dreading about whatever vocation I might get posted to and decided to embrace it and make the best of it ;)"
  },
  {
    "post_id": 19,
    "title": "Quitting NS as a PR in BMT?",
    "author": "Additional-Wear-4847",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mndmim/quitting_ns_as_a_pr_in_bmt/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-11T13:54:36Z",
    "flair": "Question",
    "post_text": "Hey guys, I’m a PR who’s about a month into BMT, but I’m thinking of renouncing my PR status due to some health issues and personal reasons. I know it’s a big decision, especially with NS obligations, but I’m wondering if anyone here has gone through this or heard of someone who has? What was the process like? Did you face any issues with MINDEF or ICA? I read that you need to submit forms like Annex A and B, and maybe a clearance letter from MINDEF if you’re serving, but I’m not sure how it works mid-BMT. Also, any long-term consequences (like re-entering SG or future job passes) I should know about? Appreciate any advice or experiences you can share! Thanks!"
  },
  {
    "post_id": 20,
    "title": "Accepted a provisional offer while waiting for an offer from another organisation (MHA)",
    "author": "rafikkis",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mnai83/accepted_a_provisional_offer_while_waiting_for_an/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-11T11:33:57Z",
    "flair": "Question",
    "post_text": "I accepted a provisional offer from a MHA uniform group (UG). I’m also still waiting for an offer from another organisation under MHA (UG also and I’m more likely to be interested in this.)\n\nNow HR is asking if I am going to withdraw my application from the other UG since I already accepted the first one.\n\nCan I not withdraw and just wait out to see the offer? I haven’t sign any contract with the initial UG. I only accepted their initial offer through form.sg. I accepted because they gave me only a few days to accept and I’m scared I’ll be jobless if the other UG rejects me.\n\nAny inputs would be nice. Thanks!"
  },
  {
    "post_id": 21,
    "title": "What is the route to becoming a Commando/NDU officer?",
    "author": "taeng89",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mn7eib/what_is_the_route_to_becoming_a_commandondu/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-11T08:25:30Z",
    "flair": "Question",
    "post_text": "Kinda curious since I know the it differs from the normal tekong route.\n\nFor commandos, I understand they go to OCS after Leaders Course. Do they join a completely new batch? Or do they join their intake batch? i.e. If they enlist Jan then do they join the other tekong Jan folks?\n\nAfter OCS they go for COCC. Then does this mean they don’t wear their red berets during OCS? Or do they get the berets early?\n\nFor context I ORD-ed long ago, just asking out of curiosity."
  },
  {
    "post_id": 22,
    "title": "Have u guys got ur pay yet",
    "author": "CategoryMiddle6777",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mn74vy/have_u_guys_got_ur_pay_yet/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-11T08:07:50Z",
    "flair": "Question",
    "post_text": "Many of my friends have received theirs already but I haven’t yet…I use ocbc and they use POSB OCBC…this is my first pay please advice..really stressed 😭"
  },
  {
    "post_id": 23,
    "title": "POP gift ideas for SAF bf",
    "author": "Sad_Builder8498",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mn4g0y/pop_gift_ideas_for_saf_bf/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-11T05:17:41Z",
    "flair": "Question",
    "post_text": "Hi! nsgf here 😅 my boyfriend’s POP is in about 3 weeks, and I have a few gift ideas in mind - but I would love to hear from those who have been through BMT: what did you really want for your POP? \n\nthanks in advance :)"
  },
  {
    "post_id": 24,
    "title": "Unsure of who to contact at vocation",
    "author": "Humble-Network9002",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mmz4yn/unsure_of_who_to_contact_at_vocation/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-11T00:46:43Z",
    "flair": "Question",
    "post_text": "Hi guys,abit urgent question if yall can help. I have to report to my vocation at procom in awhile but i not feeling well at the moment and the peopl who's number I've been given to contact is not replying... Do u guys know anyone else i could contact for this matter?"
  },
  {
    "post_id": 25,
    "title": "Person with disabilities, 19y/o need answers",
    "author": "Dry-Preference-8132",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mmy43l/person_with_disabilities_19yo_need_answers/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-10T23:58:53Z",
    "flair": "Question",
    "post_text": "I need information about the CMPB medical checkup. I am currently 19 and still studying. I have a medical condition where I am partially disabled as I am fall risk and wheelchair bounded. What other information should I know and will I be called up? I have medical certification of my condition and also a official doctor's letter of the doctor stating that I am not in the condition to serve. Anything I should take note? When will they inform us about medical check ups? Because I am currently still schooling."
  },
  {
    "post_id": 26,
    "title": "any tips/advice for new nsgf",
    "author": "Ecstatic-Engine-1104",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mmu5py/any_tipsadvice_for_new_nsgf/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-10T21:06:58Z",
    "flair": "Question",
    "post_text": "hi! my bf is going for bmt soon, and we’ve been together for nearly 3 years  and i’m afraid of the huge change that’s going to affect the both of us.\n\nwould love to hear any tips/advice! thank u"
  },
  {
    "post_id": 27,
    "title": "Did i get blacklisted from army recruitment centre??",
    "author": "Old-Supermarket9052",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mmneld/did_i_get_blacklisted_from_army_recruitment_centre/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-10T16:45:22Z",
    "flair": "Question",
    "post_text": "I called ARC and the person on the phone told me nobody was in office at that time so i passed him my number. He told be he would pass my number to any of the recruiters once they are back. 2 weeks in i received no calls.\n\n\nNot to be paranoid but could it be that i might have been blacklisted? Or maybe the person just forgot to pass my number?? What are some reasons i might have been blacklisted?? I have no bad records from my nsf days, got good conduct everything. Only thing was i used to be non combat fit, and i called ARC before during my nsf days and thry told me to up pes before signing on, and recently i up pes, but they still seem to have rejected me. Not an official rejection but they seem to not want me. \n\n\nOr maybe im just being too worried, maybe the guy forgot to give my number to the recruiter idk. What do you guys think?"
  },
  {
    "post_id": 28,
    "title": "Signing on interview tips",
    "author": "AQboopy",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mmj7yf/signing_on_interview_tips/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-10T13:55:57Z",
    "flair": "🇸🇬 Regular",
    "post_text": "I’m a female and I am set to have an interview with the Navy soon. Just wanted to ask if there’s any advice on aceing the interview/some questions asked.\n\nAlso, I heard there will be one with HR and another is panel interview. Is both via MS Teams?"
  },
  {
    "post_id": 29,
    "title": "Tips to kilat SCDF uniform",
    "author": "Beginning_Brain8653",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mmj4ks/tips_to_kilat_scdf_uniform/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-10T13:51:59Z",
    "flair": "Question",
    "post_text": "Going as a ptp batch and my main concern is the ironing . What are some life hacks making ironing easier? \n\n(Already using starch spray )"
  },
  {
    "post_id": 30,
    "title": "IPPT DEFAULTERS PLEASE FALL IN",
    "author": "Acceptable-Squash-93",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mmiuwf/ippt_defaulters_please_fall_in/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-10T13:40:22Z",
    "flair": "Question",
    "post_text": "Just curious, how many times did you guys defaulted on ippt ? And what were the penalties?\n\nI heard that the max fine is 2,000. Is that true or some bullshit"
  },
  {
    "post_id": 31,
    "title": "- Excuse heavy load status -",
    "author": "Ok-Addition-6631",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mmin0a/excuse_heavy_load_status/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-10T13:30:38Z",
    "flair": "Question",
    "post_text": "Having issues with field pack, went to see MO and got a certain period of excuse heavy load. Missed my SIT test so need to re-sit test. Does my status affect my ability re-sit test? Because I'm not interested in going command school and the re-sit test is going to be on a Friday while everyone books out on Thurs so....\n\nBut I'm pretty damn sure my OC is the type who will make you go re-sit test whether you like it or not...\n\nor maybe i just suck thumb cuz 4 more weeks to POP"
  },
  {
    "post_id": 32,
    "title": "My OC asked if i would be interested to be his signaller",
    "author": "Most_Edge_8875",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mmh9kl/my_oc_asked_if_i_would_be_interested_to_be_his/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-10T12:27:03Z",
    "flair": "Question",
    "post_text": "in 1guards rn, currently still bmt-ing. \nduring a chill 8km road march i had some 1 on 1 time w my oc, talked to me about becoming his signaller.\n\nfrom what i can take away in the convo, i'll be sent on a 4 months course at support company if i am \"chosen\", and that i'll basically he his kaki for the rest of unit time. Additionally, it'll be a +10kg in my field pack wherever i go. i'll run his errands in and out of unit, and comms for him whenever needed.\n\nAnyone have any advice on whether it's something i should further push myself to go for? isit just being treated like a bitch, or is there any unique gains i get out of it?"
  },
  {
    "post_id": 33,
    "title": "OCS life as a me4t DIS sign on",
    "author": "Imdumb1234567",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mmgb79/ocs_life_as_a_me4t_dis_sign_on/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-10T11:37:32Z",
    "flair": "Question",
    "post_text": "\nLooking for more information on OCS life in dis as a me4t (c4x), particularly about service term. Is the 3 months similar to what you would go through in the other wings? "
  },
  {
    "post_id": 34,
    "title": "Do i get to bookout during ptp and brt?",
    "author": "Dazzling-Ad-8775",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mmdlpi/do_i_get_to_bookout_during_ptp_and_brt/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-10T08:52:11Z",
    "flair": "Question",
    "post_text": "I have events that i want to attend during the three month period and its on Saturday. But I'm not sure how the bookout works. Be going in soon in aug"
  },
  {
    "post_id": 35,
    "title": "Can I bring my Kindle/physical books to Tekong during BMT?",
    "author": "dasspert01",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mmbqq6/can_i_bring_my_kindlephysical_books_to_tekong/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-10T06:51:35Z",
    "flair": "Question",
    "post_text": "I heard there's a decent amount of admin time during the first two months of PTP, and I love reading anyway"
  },
  {
    "post_id": 36,
    "title": "Advice on what to do for my mental state",
    "author": "Specialist_Ad8572",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mmbkzi/advice_on_what_to_do_for_my_mental_state/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-10T06:41:21Z",
    "flair": "Question",
    "post_text": "Hey There! This is a throwaway account I am using and I would like to ask for some advice regarding this ongoing issue of mine that I need help on. More context in the comments because I tried to post the full thing but the bot keeps telling me to post it under the mega thread for some reason."
  },
  {
    "post_id": 37,
    "title": "Regret putting yes for command school",
    "author": "Fickle-Poetry3580",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mm6sph/regret_putting_yes_for_command_school/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-10T02:14:09Z",
    "flair": "Question",
    "post_text": "I put yes for command sch and passed my ffi but i regret it now and rather be a man. I have yet to pass any ippt so if i dont pass the last one they wont give me command school posting anymore right."
  },
  {
    "post_id": 38,
    "title": "First mob period confirm activate?",
    "author": "Queasy_Slip_1386",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mltuwf/first_mob_period_confirm_activate/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-09T16:37:17Z",
    "flair": "Question",
    "post_text": "I have mob manning this October and it’s my first ever standby period. Could I check with those that have gone through this before if the first mob manning is confirm activation or is it actually random?"
  },
  {
    "post_id": 39,
    "title": "I’m just feeling so damn lost as a Soon-To-Be 3SG",
    "author": "OpeningAbalone107",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mltqb8/im_just_feeling_so_damn_lost_as_a_soontobe_3sg/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-09T16:32:02Z",
    "flair": "👤 Personal Experience ",
    "post_text": "I’m unfit, not confident, and I get anxiety attacks often from over thinking everything.\n\nI have no support structure here in Sg, no friends outside NS, no Family, no home, I rent a fucking dirty run down room here for 500 dollars a month and have to put up with 0 personal space 24/7\n\nI feel like ending it all and just cruling up into a ball, I have no idea how tf I can become a seccom like this when I can’t even get my shit together."
  },
  {
    "post_id": 40,
    "title": "ICT (High Key) at Kranji Camp 3. What to expect",
    "author": "blindedredeye",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mloz3e/ict_high_key_at_kranji_camp_3_what_to_expect/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-09T13:05:57Z",
    "flair": "Question",
    "post_text": "Hi, got an SMS yesterday regarding my first reservist call up (High Key) at Kranji Camp 3 for next year. Was a PES C ASA under HQ CSSCOM, ORDed 3 years ago.\n\nDoes anyone know what to expect ? I searched through the subreddit and there wasn't much info. (Please don't tell me about the canteen. I literally ate there everyday during my service).\n\nThanks !"
  },
  {
    "post_id": 41,
    "title": "What to expect from MTI in pro term",
    "author": "Initial-Gas-2925",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mlneec/what_to_expect_from_mti_in_pro_term/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-09T11:42:49Z",
    "flair": "Question",
    "post_text": "jst got posted to MTI. What to expect and is it very shag?"
  },
  {
    "post_id": 42,
    "title": "OCS Arty Pro Term questions",
    "author": "PreparationMedium423",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mlm1dv/ocs_arty_pro_term_questions/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-09T10:19:07Z",
    "flair": "Question",
    "post_text": "My batch only has light inf, moto inf and arty for our pro term vocation. I am interested in going arty. How does life in arty training institute and unit look like, and how can i increase my chances of being selected?"
  },
  {
    "post_id": 43,
    "title": "yo chat, are we live?‎ ‎ ‎ ‎ ‎",
    "author": "savoirex",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mlljq1/yo_chat_are_we_live/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-09T09:46:22Z",
    "flair": "Question",
    "post_text": "Ws in da chat"
  },
  {
    "post_id": 44,
    "title": "Any ideas how to down pes in SCDF ?",
    "author": "mrbrucewaynee21",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mlkc2j/any_ideas_how_to_down_pes_in_scdf/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-09T08:22:14Z",
    "flair": "Question",
    "post_text": "i want to down pes cuz i damn sian already in station life. now want lepak shake leg . any ideas how guys ?\nthinking of want to go to admin or  driver if possible"
  },
  {
    "post_id": 45,
    "title": "Thank you to all the duty personnel 🫡",
    "author": "black_knightfc21",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mlfg2j/thank_you_to_all_the_duty_personnel/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-09T03:31:18Z",
    "flair": "Discussion",
    "post_text": "Understand NDP will have alot of people on duty. Thank you so much for doing your part :) "
  },
  {
    "post_id": 46,
    "title": "Defaulting on Mandatory NS FIT as a NSman",
    "author": "jkkkkz",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mlfbst/defaulting_on_mandatory_ns_fit_as_a_nsman/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-09T03:25:09Z",
    "flair": "Question",
    "post_text": "I’m an NSman and I’m in my mandatory NS FIT window (not the voluntary IPT / post-IPPT fail thing). My window is ending soon and I haven’t cleared the requirement (pass IPPT or do 9 NS FIT + 1 IPPT attempt).\n\nIt’s my first time defaulting, and I don’t think I can clear it as I have a newborn and it’s hard to find time (not an excuse I know), but what are the consequences for a first timer? Do I need to go down to CMPB or I just need to pay a fine? Any consequences during ICT?"
  },
  {
    "post_id": 47,
    "title": "How to wash helmet after IFC",
    "author": "Internal-Hotel876",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mle091/how_to_wash_helmet_after_ifc/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-09T02:18:30Z",
    "flair": "Question",
    "post_text": "Hi i came from IFC and i don't how to wash helmet, camo is still on my helmet and it smells so bad can anyone tell me how to wah properly can i wash the sponge and metal one or only the cover..?"
  },
  {
    "post_id": 48,
    "title": "Going to command sch SCS...",
    "author": "Feisty_Movie_791",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mldzgd/going_to_command_sch_scs/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-09T02:17:24Z",
    "flair": "Question",
    "post_text": "Is going to SCS worth it? After the 6 months do people come out more confident and get public speaking skills and how is life after scs do sergeants get more welfare and is it easier to take leaves/offs."
  },
  {
    "post_id": 49,
    "title": "How much of an advantage do I get if I stand at the front of the track during IPPT?",
    "author": "ResearcherWeekly8506",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mlcb3l/how_much_of_an_advantage_do_i_get_if_i_stand_at/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-09T00:56:00Z",
    "flair": "Question",
    "post_text": "Assuming the timer starts when the last person crosses, I'm wondering how much time would I save being at the front?"
  },
  {
    "post_id": 50,
    "title": "SCS Pro Term CBT Medic Spec",
    "author": "chakn19",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mlan4h/scs_pro_term_cbt_medic_spec/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-08T23:38:45Z",
    "flair": "Question",
    "post_text": "Just received my pro term posting as a combat medic spec at nee soon camp, just wondering how is life there generally and what are the vetoes for the course? Thanks!!"
  },
  {
    "post_id": 51,
    "title": "will having std affect my pes status?",
    "author": "throwawaysbby1807",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1ml17ut/will_having_std_affect_my_pes_status/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-08T17:19:16Z",
    "flair": "Question",
    "post_text": "have quite a few questions, such as if i were to go for discreet check ups, what happen if it turns out to be positive and do i have to declare by going to MO? will it affect my pes status? "
  },
  {
    "post_id": 52,
    "title": "Questions about arty pro term scs",
    "author": "jinnisuniverse",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mkvjb4/questions_about_arty_pro_term_scs/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-08T13:41:22Z",
    "flair": "Question",
    "post_text": "Just got my posting today. Is arty pro term shag? What is arty like and how are the days like in Khatib camp?"
  },
  {
    "post_id": 53,
    "title": "Am I obliged to keep my mobile data on?",
    "author": "GrapefruitOk8621",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mkmse5/am_i_obliged_to_keep_my_mobile_data_on/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-08T05:26:37Z",
    "flair": "Discussion",
    "post_text": "\nContext: I'm in a unit where some of us can be split up to do 1 thing while the rest have to go do another thing. Regulars like to call us to go over and help them, and they usually use WhatsApp. \n\nNow idt there's an official rule on this. But what if I want to save mobile data and there's no WiFi? Why should the job depend on an NSF having a sufficient data plan? What if I wanna keep my phone on silent? If Regulars not happy they can pay for my data plan. Nothing happened irl, just wanna discuss this hypothetical scenario."
  },
  {
    "post_id": 54,
    "title": "Weekly questions and discussions - August 07, 2025",
    "author": "AutoModerator",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mkbxfs/weekly_questions_and_discussions_august_07_2025/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-07T21:00:38Z",
    "flair": "Weekly",
    "post_text": "Use this to ask smaller questions or for discussions.\n\n* Downvotes are strongly discouraged\n* Please be polite\n* Join our [Discord Server](https://discord.gg/jRSWjdtQg7)\n* Read the [Frequently Asked Questions](https://national-service.now.sh/faq) too\n\nIf you have any issues, please [contact the mods](https://www.reddit.com/message/compose?to=%2Fr%2FNationalServiceSG)."
  },
  {
    "post_id": 55,
    "title": "Update on pes f: My encik asked me not to downpes to F",
    "author": "Material-Night-2552",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mk6fxr/update_on_pes_f_my_encik_asked_me_not_to_downpes/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-07T17:32:05Z",
    "flair": "Question",
    "post_text": "My encik saw my post on whether to downpes to F or continue serving as a uniformed personnel and said if I downpes to F,I will be affecting multiple people in my current unit due to lack of manpower.He asked me to go back serve in office to not make others lives not as hard as possible. Am I able to just ignore and block him from now on as I am gonna answer to PCC that I will be taking the pes F from next week or is this still considered disobedience of general orders,I am so tired of NS honestly."
  },
  {
    "post_id": 56,
    "title": "IN CAMP RATION, a travesty? (My take)",
    "author": "majulahsotongs",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mk6bsg/in_camp_ration_a_travesty_my_take/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-07T17:27:45Z",
    "flair": "Discussion",
    "post_text": "\nMY TAKE so if you feel offended or a need to say “back in my day” please, book yourself out. ➡️🚪\n\nI was never a picky eater, i find below average food tasty. But wow, they warned me but i was NOT prepared, i have never had food as remotely bad as in camp food.\n\nShit so bad i find myself missing my downstairs kopitiam food ✋😔\n\nI was scoffing down out-ration dinner with my ma’am a couple days back and jokingly told her “If i could feedback 20 things wrong with the food i will”\n\nshe laughed, but i was serious \n\n1. Breakfast: oily, deep fried, processed \n2. Breakfast: Low in protein \n3. Breakfast: Carb overload \n4. Breakfast: Bread so dry its a safety hazard\n5a) Breakfast: Protein is always processed food\n5b) Breakfast: The sausage they give me always looks like an old mans wrinkled cock bro 😭\n\n6) Breakfast: Hurt my teeth biting into the oily croissant thats still somehow STIFF\n\n7) Breakfast: Fried noodles with NEGATIVE flavour, literally felt the taste sucked from my tongue, thought i had covid again\n\n8)Dinner: Rice grains that looks like they collected the leftover from hawker centre and recycled it for SAF\n\n9)Dinner: Constant microwaved dinner with gravy so heavy with salt my tongue is getting buff lifting all that WEIGHT\n\n10)Dinner: Vegetables so stiffly overcooked my tongue kena stabbed 😔 \n\n11)Dinner: Rice that just FEELs wrong, as an Asian with decades of rice eating, the rice lacks the essence that makes it RICE. \n\n11b) If Skinwalker tries to impersonate rice, it would be outration rice\n\n\nOk thats all, NSF wear helmet too stupid to count to 20."
  },
  {
    "post_id": 57,
    "title": "Am I allowed to bring my OCS commissioning sword out of SG to overseas?",
    "author": "cykaharaqu",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mk04ia/am_i_allowed_to_bring_my_ocs_commissioning_sword/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-07T13:28:53Z",
    "flair": "Question",
    "post_text": "As the family is moving, I would like to bring it along with me overseas. Is it possible?\n\nAre there any restrictions regarding this, or do I need a special license to bring \"weapons\" out of Singapore?\n\nIf so, how do I proceed?"
  },
  {
    "post_id": 58,
    "title": "Life as OPS at Fire stations",
    "author": "Brilliant_Jacket_466",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mjxme5/life_as_ops_at_fire_stations/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-07T11:33:56Z",
    "flair": "Question",
    "post_text": "Wish to know from anyone who experienced this to describe how things go when working 12hrs shift at any fire stations as watchroom operators 🙏🏻"
  },
  {
    "post_id": 59,
    "title": "Offered exemption,pes f from army,should I take it?",
    "author": "Material-Night-2552",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mjvjnn/offered_exemptionpes_f_from_armyshould_i_take_it/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-07T09:33:22Z",
    "flair": "Question",
    "post_text": "Suffering with anxiety and insomnia and got recommended by mo for pes f ,got told by pcc that the decision lies with me whether to take it or not?Do I take the pes f and leave service or continue serving as a downpes personnel?\n\nAnyone who gotten pes f before do share your experience on life after pes f status from ns thanks\n\nSo far that I am aware of the pros and cons are\n\nPros:\n\n\\-2 Years headstart into overseas university,able to work multiple jobs outside without being charged,no longer paid an allowance and able to earn a decent wage,no reservist obligations and no military rules subjected to me anymore.\n\nCons:No more free healthcare services under 11b,possible discrimination from other Singaporean male due to pes f,insurance related to anxiety and insomnia may be affected?\n\n  \nEDIT::thanks for the response guys,I will be taking up the pes F and heading to uni straight.\n\n  \n"
  },
  {
    "post_id": 60,
    "title": "questions about pes d(irregular heartbeat)",
    "author": "Any_Way9345",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mjurxr/questions_about_pes_dirregular_heartbeat/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-07T08:44:24Z",
    "flair": "Question",
    "post_text": "i received a pes d for irregular heartbeat during the initial cmpb check up. I read that for such cases usually they send for echocardiogram and will consult a Dr afterwards at national heart centre, but in my case they just sent me to raffles hospital for the scan with no one telling me the results after, is this normal for this type of case? to add about my personal physical condition i have always been quite active during my school days but sometimes i feel abit faint even when doing light exercise and one of my parents found to have myocardial bridge condition. should i go about seeing a Dr for this?"
  },
  {
    "post_id": 61,
    "title": "NS is gonna make me mentally ill",
    "author": "PuzzleheadedBox9732",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mjts0d/ns_is_gonna_make_me_mentally_ill/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-07T07:40:03Z",
    "flair": "Rant",
    "post_text": "\nIn life when you don’t fuck with someone you can just ignore him/walk away/fuck with people you click with.\n\nBut here, it doesn’t matter if it’s the worst fucking guy you’ve ever met you still have to sleep, eat, or shit together like y’all are best friends\n\nAt the end of the day you can’t go anywhere to let off steam, cause that guy you dislike? He sleeps like 5 metres away from your bed, and it’s like that 24/7 5 days a week\n\nI honestly dk how to deal with this shit for 2 years\n\n"
  },
  {
    "post_id": 62,
    "title": "What’s the nicest (or weirdest) thing someone’s said to you in uniform?",
    "author": "BolehBolehBro",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mjtgw0/whats_the_nicest_or_weirdest_thing_someones_said/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-07T07:20:08Z",
    "flair": "Discussion",
    "post_text": "Something I’ve been wondering lately - when you’re in uniform in public, do you feel acknowledged at all?\n\nIn some countries, military or service personnel get thanked, smiled at, even offered seats or a quick word of appreciation. But here in Singapore? Most of the time people just feel… invisible. No nods, no eye contact, nothing. People just glance past you like you’re any other commuter.\n\nNot saying we expect special treatment - but sometimes, especially after a long week in camp, a small gesture like someone offering a seat or even saying “thanks for serving” would honestly mean a lot.\n\nCurious if others feel the same. Have you ever experienced unexpected courtesy while in uniform - or do you just keep your head down and move on?"
  },
  {
    "post_id": 63,
    "title": "Possible to stayout as a TO?",
    "author": "Successful-Spam278",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mjnwu8/possible_to_stayout_as_a_to/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-07T02:14:47Z",
    "flair": "Question",
    "post_text": "Waiting to be posted to unit as a TO. Was wondering if I can declare insomnia (which has been coming back recently) and possibly get stayout status. I'm a Pes E TO so I only operate class 3. Do you guys think its possible? "
  },
  {
    "post_id": 64,
    "title": "Post exit-permit commando reservist",
    "author": "Bart_Simpson1516",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mjdr4h/post_exitpermit_commando_reservist/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-06T19:12:50Z",
    "flair": "Question",
    "post_text": "I ORDed from 1cdobn few years ago and got assigned my NS cdo battalion, but took exit-permit to study overseas.\n\nWhat happens when I return back, will I join my original NS battalion?\n\nDo I still need to begin and complete the 6-8 reservist cycles  or is there an age cutoff?\n\nIs there a chance that MINDEF forgets me completely upon return?\n\nThank you"
  },
  {
    "post_id": 65,
    "title": "Can I get referral to pluck wisdom tooth outside as SAF dental doesn't perform general anesthesia?",
    "author": "PrawnNoodleSG",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mizgmh/can_i_get_referral_to_pluck_wisdom_tooth_outside/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-06T08:52:15Z",
    "flair": "Question",
    "post_text": "As the title goes, curious if anyone done it before?"
  },
  {
    "post_id": 66,
    "title": "Dont want to down pes during BMT",
    "author": "idkpeoplehere",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1miygrm/dont_want_to_down_pes_during_bmt/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-06T07:46:04Z",
    "flair": "Question",
    "post_text": "I am Pes BP batch 04/25 and currently still in confinement and had went through two MR and was told that my Haemoglobin level is low, and would have to down pes to c9. I searched online regarding the various symptoms of having low haemoglobin level and i do not experience any of it.\n\nPreviously when I did my body check up at CMPB, the result came short by 0.2 from the acceptable haemoglobin range, and at PTMC, the new result drop quite a bit but as mentioned, I do not feel any of the symptoms.\n\nThe other contributing factor that correlates to low haemoglobin could be low iron count. My general diet doesn’t include much of red meat or high iron diet.\n\nThe MO told me to go to a Polyclinic to get some iron supplements and would have to down pes me due to my low blood count.\n\nHonestly, I want to complete my BMT in tekong and not get down pes.\n\nHope that somebody have some idea on how to discuss this with MO."
  },
  {
    "post_id": 67,
    "title": "What Happens if Someone Hides a Vape in Your Belongings During an Inspection?",
    "author": "Substantial_Egg443",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1miuk9j/what_happens_if_someone_hides_a_vape_in_your/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-06T03:55:13Z",
    "flair": "Question",
    "post_text": "what happens if someone place vape in Ur belonging to prevent getting caught during inspection and u get caught for it?\n\nEdit: Just asking cuz a friend said their bunk got searched for it, (The someone hide in ur belongings is just a hypothetical qn, sorry for not indicating so)."
  },
  {
    "post_id": 68,
    "title": "Anyone received letter for October BP batch ?",
    "author": "Substantial_Egg443",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1miuj8w/anyone_received_letter_for_october_bp_batch/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-06T03:53:44Z",
    "flair": "Question",
    "post_text": "\"Has anyone received a letter confirming their selection for the October BP batch to attend or join?\""
  },
  {
    "post_id": 69,
    "title": "Struggling in EMT course, is it possible to transfer to FF? Would really appreciate advice",
    "author": "Darthvader957",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mis5y6/struggling_in_emt_course_is_it_possible_to/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-06T01:57:03Z",
    "flair": "Question",
    "post_text": "Hey guys,\n\nI’m currently in EMT in SCDF training and I’ve been feeling really overwhelmed. It’s only been a couple of days but I’m already starting to feel like it’s not the right fit for me mentally and physically.\n\nI’ve been thinking about whether it’s possible to request a transfer to Firefighter instead — I know it’s not necessarily “easier”, but I think I might be able to cope better with that role.\n\nI’m not trying to slack or escape NS. I just want to be able to serve properly in a role that I won’t mentally burn out from over the next 2 years.\n\nHas anyone here successfully transferred vocations after BRT or early into EMT course? Who should I speak to, and what should I expect? Any advice would really help.\n\nThanks in advance 🙏\n"
  },
  {
    "post_id": 70,
    "title": "Transport Operator (CSS) OOC?",
    "author": "[deleted]",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mirasv/transport_operator_css_ooc/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-06T01:16:25Z",
    "flair": "Question",
    "post_text": "should i OOC from TO? still waiting for driver course to start and dont really want to become a driver…\n\nwhat should i do? should i ask encik to post be out to be ASA/SA?\n\nplease advise me… dreading driving 😰😰"
  },
  {
    "post_id": 71,
    "title": "How do I chiong for last IPPT in a couple weeks?",
    "author": "vrooooooooommm",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1miqz8r/how_do_i_chiong_for_last_ippt_in_a_couple_weeks/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-06T01:01:32Z",
    "flair": "Question",
    "post_text": "Just completed my 2nd last IPPT, and while I improved from my prev attempts (3→28→39 pushups, 10→35→38 situps), my run time is still terrible (18:30). I've about 4 weeks to POP, so 2-3 weeks to last IPPT attempt? and I wanna minimally pass. In hindsight, kinda stupid of me to take the whole BP BMT focusing on my statics rather than my running but I can't change that now.\n\nMy running sucks, mainly because about 600m in my legs start to feel really heavy.\n\nWhat's the best way to structure and min-max my training/SRT to be able to minimally pass by my last IPPT, especially my running?"
  },
  {
    "post_id": 72,
    "title": "DO PES C2/9 ASA NEED TO COME BACK FOR RESERVIST?",
    "author": "ContributionRare8226",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1miqxnx/do_pes_c29_asa_need_to_come_back_for_reservist/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-06T00:59:36Z",
    "flair": "Question",
    "post_text": "Hi guys,\n\nWanted to ask if im pes c2/9, and in ASA rn, will i have to come back for reservist? And if i do, is it a  normal 9-5pm job for a week? I dont see why asa shud come back as reservist 🤣 \n\nASA personnels, please enlighten me more about ASA. Im doing voc training rn and im hoping i get posted to a stay out unit. And i know asa 95% will get stay out but idw to be the unlucky one. Also currently on 3 months temp exc stay in, will that affect my chances of getting a stay out unit?"
  },
  {
    "post_id": 73,
    "title": "What are the items that became lifesavers during OCS?",
    "author": "Ill-Lynx662",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mid3gv/what_are_the_items_that_became_lifesavers_during/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-05T15:59:47Z",
    "flair": "Question",
    "post_text": "This is to help out new officer cadets that just enlisted. Items could be stuff to bring from day 1 of OCS to items you never would've thought of but became lifesavers and made your life way easier."
  },
  {
    "post_id": 74,
    "title": "What are some severely underrated items to bring into SCS?",
    "author": "Ill-Lynx662",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mid2ud/what_are_some_severely_underrated_items_to_bring/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-05T15:59:03Z",
    "flair": "Question",
    "post_text": "This is to help out new spec cadets that just enlisted. Items could be stuff to bring from day 1 of SCS to items you never would've thought of but became lifesavers and made your life way easier."
  },
  {
    "post_id": 75,
    "title": "What are some severely underrated items to bring to BMT?",
    "author": "Ill-Lynx662",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1micz8j/what_are_some_severely_underrated_items_to_bring/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-05T15:55:07Z",
    "flair": "Question",
    "post_text": "This is to help out new recruits that just enlisted. Items could be stuff to bring from day 1 of BMT to items you never would've thought of but became lifesavers and made your life way easier."
  },
  {
    "post_id": 76,
    "title": "Adjustment issues in NS (Mono Guards",
    "author": "Apprehensive_Bat1662",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mibw6i/adjustment_issues_in_ns_mono_guards/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-05T15:12:46Z",
    "flair": "Question",
    "post_text": "So i got posted to mono guards bmt about 1 month ago and since the first day i just cannot handle the shouting and timings we have to meet everytime where we have to rush everytime. It justs make me overwhelmed and frustrated as we are rushing just to wait 30min to a few hours sometimes for further instructions. \n\nTheres more details regarding my background but i dont wanna disclose here so pm me if you can help me thanks!\n\nBasically i just have a few questions regarding how to get out of mono guards and get into a not so xiong vocation.\n\nQuestions:\n1) Is guards one of the toughest vocation in saf that you can get posted too? If not what other vocation is tougher that everyone can get posted too?\n2) Do everyone that is in mono guards bmt get sent back to unit? If not how many do get posted out and to where?\n3) What methods are there to get out of mono guards?\n4) What are the conditions you need to pass bmt so you do not need to rebmt?\n5) What is recovery coy all about?\n6) What the difference between temp downpes and perma downpes and how do they differentiate them?\n7) Is private psychiatrist memo and pcc memo the same as i cant wait to see the pcc as it in about 5 weeks later"
  },
  {
    "post_id": 77,
    "title": "Want medic vocation badly",
    "author": "Remarkable_Regular15",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mi7wuh/want_medic_vocation_badly/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-05T12:32:29Z",
    "flair": "Question",
    "post_text": "Currently B1 in BMT, POP-ing early next month. I really want the medic vocation. Already indicated interest through the vocation interest form, and also told my OC, but he said he and the CO can’t help, must email CMPB.\n\nEmailed CMPB, but they just told me to approach my unit commander… so I’m kinda stuck now.\n\nI have a diploma in pharmaceutical science and declared 3 hospital work stints in my G50 form, total around 1 year in hospital pharmacies. My section commander said got high chance I’ll get medic. True or not?"
  },
  {
    "post_id": 78,
    "title": "What are the most underrated vocation perks no one talks about?",
    "author": "BolehBolehBro",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mi7ewc/what_are_the_most_underrated_vocation_perks_no/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-05T12:09:05Z",
    "flair": "Discussion",
    "post_text": "Everyone loves to roast certain vocations or glorify others, but I think we don’t talk enough about the unexpected perks some NSFs get depending on where they’re posted.\nFor example:\n\n- Some logistics units have access to really chill workspaces with aircon and regular 9–5 hours.\n- Certain SAFPU or SPF units offer early exposure to real-world enforcement work (looks decent on a resume).\n- Cybersecurity vocations now actually give you access to real training certifications like CompTIA.\n\nWhat other “hidden gems” have you guys come across? Not just about slacking - but actual useful or meaningful experiences you didn’t expect when you first got your posting.\nWould be nice to hear from different batches and vocations."
  },
  {
    "post_id": 79,
    "title": "Mid career switch to DIS MDES (C4X/MIE)",
    "author": "bingdablings",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mi56lk/mid_career_switch_to_dis_mdes_c4xmie/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-05T10:08:27Z",
    "flair": "Question",
    "post_text": "Hi, 28 M currently working corporate job in a completely different industry. I applied to DIS and indicated strong interest in C4X. Reason was because my current job is mundane but pay is relatively ok - 4+on my 3rd year. Thus me exploring my options and finding jobs that seem more meaningful and stimulating. I am also on my final year in local Uni taking part time degree in Business.\n\nI was keen to explore more on cyber defence and security thus applying for the role. I have my MAPAS test and interview scheduled next week. However, upon speaking with the recruiter, he mentioned that I should apply for MIE instead due to my lack of experience.\n\nI looked at the role and realised that the trainee and actual pay was very low, and progression doesnt seem that good especially going in as ME1. Should I still attempt to go for the interview for C4X or should I just cancel the interview to not waste my time and their time? I am aware of the pros and cons of signing on and I am ok with them apart from the low pay."
  },
  {
    "post_id": 80,
    "title": "LPT: USE SAF insect repellant for bed bugs",
    "author": "FauxPseudoFacts",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mi51mi/lpt_use_saf_insect_repellant_for_bed_bugs/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-05T10:00:32Z",
    "flair": "Discussion",
    "post_text": "if u go bunk has bedbugs inside the bed u spray the insect repellant on to it and all the bed bugs will leave the bed and then u just have to squish them to death and you won’t be bitten "
  },
  {
    "post_id": 81,
    "title": "How do I go about with trying to downpes",
    "author": "EstablishmentHairy37",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mi4vs6/how_do_i_go_about_with_trying_to_downpes/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-05T09:50:29Z",
    "flair": "Question",
    "post_text": "\n\nContext: I'm currently pes b1 doing bmt, I have diagnosed gout and am xurrently on medication for it however sometimes due to circumstances, be it a tight schedule or some other issues I do not take the medication resulting in a gout flare which pretty much cripples me for a few days till I can walk properly again, secondly I also have a kidney issues where one side is slightly smaller than the other causing it to overwork and leak protein into my urine which would result in that kidney \"dying\" quicker than an average one, therefore I started telmisartan for that issue, however that medication has started causing me headaches and lightheadedness that I did not feel before taking that medication. Lastly I had an old Achilles injury from basketball on my right leg that I did not declare before entering as I wanted to try and go throught the whole bmt experience, however after doing outfield, my Achilles injury started acting up quite a bit after being in boots for so long which made me limp from place to place. Can I get some advice as on what to do and if I even have a chance to down pes? As I've gone for medical review and the doctors seem ABIT hesitant as to whether or not I can. As much as Ive been enjoying my experience in bmt so far I'm not to sure how far my body can go until it breaks down, to add on I'm part of mono guards which means I'll be doing gvt or GCC depending on my posting and truthfully I'm not planning to sign on so I do not want to risk my health just for two years of ns. Please help thank you 🙂"
  },
  {
    "post_id": 82,
    "title": "Wear no4 to Johore, declaring war?",
    "author": "FauxPseudoFacts",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mi4k3o/wear_no4_to_johore_declaring_war/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-05T09:30:02Z",
    "flair": "Question",
    "post_text": "Assume you are a Malaysian PR. Then you need to serve ns in Singapore but your family house is in Johore. Then you book out and you go home.\n\nOr assume you are a Singaporean then you going Johore right after booking out.\n\nOr assume you are a Malaysian student in sg and you join ncc.\n\nThen if you cross the border in no4, is that a declaration of war?"
  },
  {
    "post_id": 83,
    "title": "Can PES E sign on during NS?",
    "author": "No_Age_9041",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mi3ep9/can_pes_e_sign_on_during_ns/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-05T08:15:34Z",
    "flair": "Question",
    "post_text": "Posting on behalf of a friend who’s PES E and about to enlist.\n\nHe’s wondering:\n\t1.\tCan PES E servicemen express interest or sign on during BMT?\n\t2.\tIf they sign on, does it count toward the 2-year NS obligation?\n\t3.\tHas anyone actually done this while PES E? What was the process like?\n\n4. what roles are available for pes E to sign on? eg. DIS,admin,logistics \n\n\nHe just wants to understand what’s realistically possible despite being PES E. Any insights or experiences would be appreciated "
  },
  {
    "post_id": 84,
    "title": "Going from sub 10 to sub 9 2.4 in 2 months?",
    "author": "Big-Guarantee-5509",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mhys4q/going_from_sub_10_to_sub_9_24_in_2_months/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-05T03:41:36Z",
    "flair": "Discussion",
    "post_text": "Hi guys I recently made a bet with someone to go from a sub-10 to a sub-9 2.4 by October\n\nFor those who run sub 9, how long did the improvement take and what were your other PBs as you neared sub 9? (Eg 5K, 10K)\n\nAnd how important is dropping weight? I’ve gained almost 8kg since BMT, but most of it is upper body muscle. It kinda sucks but I’m considering dropping weight"
  },
  {
    "post_id": 85,
    "title": "Anyone is currently in Transport operator while excuse Stay in",
    "author": "Carzdude556",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mhxhvv/anyone_is_currently_in_transport_operator_while/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-05T02:39:10Z",
    "flair": "Question",
    "post_text": "Planning to up pes (Up pes to Pes E1) to Reapply as transport operator but is unsure of doing so as I have excuse stay in.\n\nI heard that E1 Transport operator does not need stay in?\n"
  },
  {
    "post_id": 86,
    "title": "Service injury card reservist",
    "author": "NewUserG",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mhp516/service_injury_card_reservist/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-04T20:42:04Z",
    "flair": "Question",
    "post_text": "\nIs it possible to apply for service injury card during reservist even though I failed to apply before I ord.\n\nI have been suffering from Achilles tendon issues and knees issues for almost 2 years and yet, they couldn't find evidence for my injuries (saf physio, hospital, etc).\n\nI'm already gonna ord soon, so I have given up hope on getting it at this point. My friends with long term injuries couldn't even get it too."
  },
  {
    "post_id": 87,
    "title": "Polyclinic zero fees? How to",
    "author": "MrNotSmartEinstein",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mhcz6q/polyclinic_zero_fees_how_to/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-04T13:08:24Z",
    "flair": "Question",
    "post_text": "I know we can waive the fees completely but don't know what to do to waive it. Last time I went the bill still showed up. Havent paid for 3 months lol. Anyone know?"
  },
  {
    "post_id": 88,
    "title": "Spf vocations for excused boots",
    "author": "Jolly_Background3004",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mh5knr/spf_vocations_for_excused_boots/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-04T05:59:55Z",
    "flair": "Question",
    "post_text": "So I'll pop 10th Oct but I'm excused boots and sports shoes. Is staff assistant my only available choice? I stay in Northshore so traveling to hta everyday would be damn shag. Is hta the only sa place? "
  },
  {
    "post_id": 89,
    "title": "Can I admit that I started a business in ns after I ord",
    "author": "Empty-Manager-3782",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mh3w1b/can_i_admit_that_i_started_a_business_in_ns_after/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-04T04:22:14Z",
    "flair": "Question",
    "post_text": "And what evidence will officer try to get if caught doing business"
  },
  {
    "post_id": 90,
    "title": "Missed my IPPT, What Now?",
    "author": "godchurch3",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mh1n9z/missed_my_ippt_what_now/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-04T02:26:42Z",
    "flair": "Question",
    "post_text": "Hello everyone,\n\nLong story short, I have missed any and all opportunity to pass into the enhanced batch of BMT and enjoy my 8 weeks of reduced service as I missed the two week cutoff point for P-E IPPT due to personal reasons.\n\nI am physically fit, having obtained PES B1 and I currently lead a healthy and active lifestyle, which makes me feel like I’ve missed out on a big opportunity to reduce my service by a significant margin.\n\nI understand that I will have to serve my PTP phase during BMT, but must I serve it in its entirety and do you guys have any tips regarding this process?\n\nThanks a lot for reading :)"
  },
  {
    "post_id": 91,
    "title": "Possible to go overseas during bmt?",
    "author": "Novel_Lawyer_9264",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mgxxox/possible_to_go_overseas_during_bmt/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-03T23:30:12Z",
    "flair": "Question",
    "post_text": "I am currently oot in bmt. Was wondering if its possible to go overseas for a 2-3 day trip during bookouts. Will the saf know if i have left the country? Do i need to ask my encik for permission or apply for off-pass?"
  },
  {
    "post_id": 92,
    "title": "help me please , i am rso restricted",
    "author": "Mediocre-Interest327",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mgxfwd/help_me_please_i_am_rso_restricted/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-03T23:07:55Z",
    "flair": "Question",
    "post_text": "rso banned , can i take mc from GP by booking MA ?"
  },
  {
    "post_id": 93,
    "title": "ICT high key deferment need payback?",
    "author": "eulercauchy1",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mgkayz/ict_high_key_deferment_need_payback/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-03T14:13:54Z",
    "flair": "Question",
    "post_text": "Is it true that we need to clear 7 high keys to be considered MR and if defer 1 high key, need to payback that 1 high key after the unit I’m attached with has MR-ed?"
  },
  {
    "post_id": 94,
    "title": "Does mono support coy mean a higher chance of SCS pro term combat support?",
    "author": "Mental-Current-6811",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mgk4np/does_mono_support_coy_mean_a_higher_chance_of_scs/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-03T14:06:36Z",
    "flair": "Question",
    "post_text": "My BMT was with mono 1SIR viper (support) coy and we were told we had a higher chance of going to a combat support vocation in 1SIR (CE, Arty, Recce, Signals) as a man. Does this also apply to SCS pro term?\n\nI assume it would since we were told the reason we were mono support coy was because we had higher security clearance"
  },
  {
    "post_id": 95,
    "title": "Question about Extending National Service",
    "author": "RottingRacoon",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mghxey/question_about_extending_national_service/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-03T12:23:33Z",
    "flair": "Question",
    "post_text": "If I extend NS for let's say 3 months, will I get increased pay? I'm a pnsf. I heard from my friend that his saf friend got 3k a month when he extended but I don't think there's any pay increase "
  },
  {
    "post_id": 96,
    "title": "Signing on vocation choice",
    "author": "shaojixiongfan",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mggyfs/signing_on_vocation_choice/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-03T11:30:07Z",
    "flair": "Question",
    "post_text": "Hi, for context I'm a female still studying. I'm very close to submitting my app but I need some insights/help determining which vocation I really want. Since I'm looking at this as a long term job, I decided to sign as officer. Currently looking into being a Armour officer but I have my doubts if I will really enjoy it since I keep hearing both positive and negative things about Armour. (I'm aware it's not all sunshine and rainbows though) I'm ok with a bit shiong stuff, just not shiong like guards or infantry. I don't think I'll be very interested if I have to go outfield very frequently too. (Outfield to me is staying overnight in the jungle) Is armour the right choice or is there another vocation I should consider? Thanks."
  },
  {
    "post_id": 97,
    "title": "Does this mean I am going to stay out?",
    "author": "Fast-Ingenuity-9242",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mgetk4/does_this_mean_i_am_going_to_stay_out/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-03T09:15:26Z",
    "flair": "Question",
    "post_text": "I just down pes-ed after i got the enlist date to e9 because of a physical condition + i got a temp excuse non air con environment . No mention of excuse stay in, but does it mean i will stay out?\n\n"
  },
  {
    "post_id": 98,
    "title": "SCDF PES B4 Experience for the next intake",
    "author": "Haunting_Ad_3109",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mge42i/scdf_pes_b4_experience_for_the_next_intake/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-03T08:27:32Z",
    "flair": "📄 Guide",
    "post_text": "So recently I just POP'ed from BRT and would like to share what it's like to be a PES B4 doing BRT. Gonna get my posting soon hopefully EMT if not Community Engagement HAHAHAHA.\n\nNgl it's pretty slack, BRT wasn't even a month for me it was like 3 and half weeks and you'll have quite abit of admin time. You won't do IPPT but you'll still do Foot drills and prepare for POP Parade and Rescue Training. As for punishment s you'll write lines that's about it. Some days will be chill and some days will be shag but you gotta remember to count yourself lucky that you're not in Tekong training.\n\nTry to not isolate yourself and dread over the month ah cause trust me you won't enjoy BRT if you do that instead socialise and get to know your bunkmates, your platoonmates and your Sgts, Enciks and Sirs ah. BRT was fun for me and I made alot of memories with them.\n\nLastly, since BRT is only gonna be a month, try not to MC or RSO cause really it's only a month and the time passes really fast and you'll miss out ah. Also please please don't give your Sergeants, Enciks and Sirs any trouble cause they will kenna and not us, try not to make their lives difficult since your BRT gonna be slack."
  },
  {
    "post_id": 99,
    "title": "How do I get excused stay in after being posted to unit?",
    "author": "OriginalPlastic5478",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mgd7am/how_do_i_get_excused_stay_in_after_being_posted/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-03T07:27:42Z",
    "flair": "Question",
    "post_text": "Can anyone help me to give me suggestions/tips/recommendations?"
  },
  {
    "post_id": 100,
    "title": "after field camp. queries from gf",
    "author": "rivertiberwest",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mgcuft/after_field_camp_queries_from_gf/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-03T07:04:43Z",
    "flair": "Discussion",
    "post_text": "hi guys... sorry, i know u guys are SICK of gf posts but my bf is finishing his 5 day field camp this week and is confined all the way til next weekend. \n\ncould u guys just briefly share if anything helped during the bookout the week of. or if there was anything u wanted, anything that helped. im planning to buy some linglinglonglongs for him.\n\nhe's been sending me gifts every single day during field camp and i just really wanted to return the sweet gesture.\n\nany help appreciated, thanks!"
  },
  {
    "post_id": 80,
    "title": "Preventing deferment of ICT?",
    "author": "lowrankbryan",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mgao1u/preventing_deferment_of_ict/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-03T04:51:38Z",
    "flair": "Question",
    "post_text": "It will be my first ICT since i got a job. Ive already defered once whilst schooling. This upcoming ICT im having is a High Key, and im trying not to defer it. However, I've  told my management about the ICT and they tols me to send them my call up, and they will send it to HR to get them to write to MINDEF to defer me (?).\n\nI just have no idea how deferment works while employed tbh. Management says during the ICT period its a very busy period for us (which is true) but im just trying not to defer so i can have a break and catch up with my old friends lol. Also scared so that i will be doing ICT with random people incase i defer too many times (AI trooper incase it matters). "
  },
  {
    "post_id": 81,
    "title": "Possible to RSI for injury obtained during weekend?",
    "author": "ContributionRare8226",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mgagg7/possible_to_rsi_for_injury_obtained_during_weekend/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-03T04:39:40Z",
    "flair": "Question",
    "post_text": "Hey guys..\n\nSo i fucked up my knee quite badly during my sunday league football game. I mean i still can walk but im struggling to climb stairs or sit on the floor. Cant bend my knee much as it feels like the tendon in my knee is super tight all of a sudden.\n\nFirstly, Can i go still go and RSI for this, maybe get an xray or whatsoever? since it wasnt caused during my weekday in camp so idk if still can? Will the doc be okay with it or not allow since injury during bookout?\n\nSscondly, does any one know what is the issue with me knee? I already had a past injury but it got worse after landing wrongly single legged. Something related to meniscus? Acl? Mcl? I have no idea..."
  },
  {
    "post_id": 82,
    "title": "Shortest time you seen someone hold a rank?",
    "author": "JiPaiHongGanLiao",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mg9i3x/shortest_time_you_seen_someone_hold_a_rank/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-03T03:47:06Z",
    "flair": "Discussion",
    "post_text": "I promoted PTE&gt;CPL 19 days before ORD, then my 19th day I only went in civi to another office collect IC so tech 18 days haha"
  },
  {
    "post_id": 83,
    "title": "Questions about Pes B2 Bmt",
    "author": "FireFox279",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mg8swj/questions_about_pes_b2_bmt/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-03T03:09:29Z",
    "flair": "Question",
    "post_text": "1. Is it true that i just have to pass btp and outfield to graduate and that once i have passed these 2, will they still make me take ippt until i pass?\n\n2. What is the outfield schedule like for pes b2? is the 4th day a full day or is it just a wake up and pack up type of day?\n\n3. If i am excused heavy load, what happens during outfield?\n\n4. How are vocations chosen for u? Is it completely random?\n\n  \nThank you!!"
  },
  {
    "post_id": 84,
    "title": "OCS CLM: What's the programme?",
    "author": "Own-Bag-6265",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mg88lo/ocs_clm_whats_the_programme/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-03T02:39:53Z",
    "flair": "Question",
    "post_text": "As above. What do cadets go through during the first few weeks of OCS?"
  },
  {
    "post_id": 85,
    "title": "SCS attendance requirements",
    "author": "fluvialweapon",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mfyskd/scs_attendance_requirements/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-02T19:17:53Z",
    "flair": "Question",
    "post_text": "guys how much attendance is required to pass found term and pro term in scs respectively"
  },
  {
    "post_id": 86,
    "title": "Life of a supply officer?",
    "author": "Peter241018",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mfwmgy/life_of_a_supply_officer/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-02T17:46:10Z",
    "flair": "Question",
    "post_text": "Hi guys, I’m thinking of signing on as an officer in supply, but I’m not exactly sure what supply vocation is about as it’s so big. Would deeply appreciate if anyone can provide some insights!"
  },
  {
    "post_id": 87,
    "title": "Going back Gedong for medical review as NSMAN, can drive in?",
    "author": "Dull-Vanilla-2976",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mfvejk/going_back_gedong_for_medical_review_as_nsman_can/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-02T16:55:05Z",
    "flair": "Question",
    "post_text": null
  },
  {
    "post_id": 88,
    "title": "BMI drop and PES update for NS",
    "author": "VegetableReport4339",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mfu1v7/bmi_drop_and_pes_update_for_ns/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-02T15:58:36Z",
    "flair": "Question",
    "post_text": "hi all, im seeking some clarification. during my first medical screening about 4 months ago, my BMI was 31.8, and i was graded PES BP. i returned to CMPB ystd and was re-measured at a BMI of 26.7 with a PES D. had no known medical issues from my initial screening, and feeling much fitter now.\n\nj wondering, how long does it usually take for the system to reflect any PES updates? and should i be prepared to be called back to CMPB again after such a change, or would it be updated automatically?\n\nappreciate any insights from those who’ve been through something similar. thanks in advance!"
  },
  {
    "post_id": 89,
    "title": "Any way to study/test during NS?",
    "author": "Shoddy_Twist_5599",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mfta0s/any_way_to_studytest_during_ns/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-02T15:26:16Z",
    "flair": "Question",
    "post_text": "Hey I'm gonna do NS soon but I'm still rather ignorant on how it all works. I graduated highschool with mid grades and a mid profile as a PR, but I really really want to make it into prestigious unis such as NTU and NUS. I'm currently like borderline (have chance but can't say how likely), so I want to continue building up my profile a bit to improve my chances, but I've heard that NS doesn't really offer a lot of freedom? I'm PES B1 and my Singaporean friend told me that it is almost certain that I will be joining an active combat position after my BMT, which will heavily restrict my freedom. I'm worried as if thats the case and I stay busy the whole time throughout NS, I might not be able to add things I want to my current profile...\n\nAny advice on anything I could do or anything to expect please? Thank yall!"
  },
  {
    "post_id": 90,
    "title": "How's Unit Life after BMT? -PES B2",
    "author": "mochishit",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mfslgy/hows_unit_life_after_bmt_pes_b2/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-02T14:58:30Z",
    "flair": "Question",
    "post_text": "I'm PES B2 currently in BMT. I feel shag but I'm just telling myself it will be better in unit and I'll have more freedom instead of only having &lt;48 hours of free time per week. Does it get better?\n\nAlso I'm a bit conscious about my appearance so I'm wondering if I can grow my hair back out to my near my eyebrows length after I'm posted to unit and does your skin untan after BMT? \n\nThank you for reading my post. "
  },
  {
    "post_id": 91,
    "title": "what was your best 2.4km timing and how long did it take for you to achieve it?",
    "author": "FrostyStranger123",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mfqugi/what_was_your_best_24km_timing_and_how_long_did/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-02T13:41:54Z",
    "flair": "Question",
    "post_text": "the faster your timing, the harder it is to see improvement 😦😦"
  },
  {
    "post_id": 92,
    "title": "national day; is it a public holiday that saf can't interfere with?",
    "author": "Conscious-Group5820",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mfpqrv/national_day_is_it_a_public_holiday_that_saf_cant/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-02T12:48:54Z",
    "flair": "Question",
    "post_text": "bopian I got remedial training (in unit now)but I was told it was on this coming say, 9 august, meaning we couldn't book out on Friday and had to finish rt on Sat before booking out\n\nis it allowed for rt to be placed on PUBLIC holidays? ain't sure and it don't feel fair too."
  },
  {
    "post_id": 93,
    "title": "The Most Important Core Value",
    "author": "SupermarketHungry751",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mfnywv/the_most_important_core_value/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-02T11:12:39Z",
    "flair": "📖 Story",
    "post_text": "As the recruit enters PTMC, he had one goal in mind: to obtain an MC. MINDEF observes this, and asks the recruit, “Who would win? You or the MO?”\n\nThe recruit replies, “Well, if the MO sees through my keng, it might cause me a little trouble.”\n\n“But would you lose?”\n\n“Nah I’d win.”\n\nFinally, the recruit arrives at the MO’s office, and the MO knew it was time to take action. He uses domain expansion, “1 day LD”, to try and stop him. However, the recruit confidently smiled and launches the accursed techniques, “chao keng” and “SAF 9th core value”, and nullified the sure-hit attack.\n\nThe MO was shocked and asks the recruit, “Are you a kengster because you practice the 9th core value, or do you practice the 9th core value because you are a kengster?”\n\nThe recruit simply laughed and replied, “stand proud, you’re strong, but you missed three key things. Firstly, when it comes to reporting sick, always bet on the recruits. Second, I am the one who will OOC with my overwhelming kengsterism. And third, with this treasure, I summon PES F.”"
  },
  {
    "post_id": 94,
    "title": "How to get a heart checkup in NS?",
    "author": "NarwhalInitial6433",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mfl1zv/how_to_get_a_heart_checkup_in_ns/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-02T08:00:15Z",
    "flair": "Question",
    "post_text": "I had irregular heart pains since secondary school but have no idea why it suddenly just happened. I brushed it off as I thought it was just stress but it's been continuing up till now. \nCMPB health checkup said my ECG was irregular but when I went to National Heart Centre to do my tests and see doctor, doctor said ECG irregular was normal and I just needed to exercise more. \nIt's been a few months since then and I have been exercising regularly these few months but the heart pains still happen. \nI am planning to get it checked in NS. How do I go about doing that? \n\nPS: I want to get it checked in NS cause I heard got medical subsidies. \nI have not entered NS yet. Going in in a few months. "
  },
  {
    "post_id": 95,
    "title": "Transport Operator as a PES E",
    "author": "Friendly_Oil_1970",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mfkwdg/transport_operator_as_a_pes_e/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-02T07:50:01Z",
    "flair": "Question",
    "post_text": "Just got vocated as a TO, and will be doing vocational training at Sembawang camp. Reading the posts on here about TOs, it was mostly about driving the tonners and trucks and what not, so I was wondering how life is for a pes E recruit who'll only drive class 3.   \n  \nAnother thing I was wondering about is unit life. How chill is it? Chances for stayout? And are there shifts like 4 days in 3 days out (one of my other TO friends said this but idk how common it is) ? Would really appreciate the input guys!"
  },
  {
    "post_id": 96,
    "title": "License Conversion for TOs after ORD",
    "author": "bigbotbolro",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mfkn8k/license_conversion_for_tos_after_ord/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-02T07:34:01Z",
    "flair": "Question",
    "post_text": "01/23 Batch here recently ord after a 6 months STC, wanted to garner insight on the licensing process and how long it takes for the license to reflect on Singpass "
  },
  {
    "post_id": 97,
    "title": "Is it true that there will be a confinement right before field camp?",
    "author": "Sad-Pattern-3073",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mfiiq4/is_it_true_that_there_will_be_a_confinement_right/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-02T05:23:23Z",
    "flair": "Question",
    "post_text": "Hi i heard many people say there is confinement right before field camp is it true? There no instructions on it "
  },
  {
    "post_id": 98,
    "title": "How to practice Servant Leadership in NS as a 3SG.",
    "author": "Working_Turnover_427",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mfh29i/how_to_practice_servant_leadership_in_ns_as_a_3sg/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-02T04:02:33Z",
    "flair": "Question",
    "post_text": "I am going to be a 3SG soon, and I want to make the most of my time in NS by growing as a leader. I often volunteer for appointments and make it a point to listen to and support my guys. That said, there have been times when a few individuals take advantage of that approach, which feels unfair to the rest who consistently pull their weight without causing issues.\n\nI am trying to find the right balance between being approachable and supportive, while also maintaining the authority needed to meet the expectations set by my superiors. I would really appreciate any advice on how to manage that balance effectively."
  },
  {
    "post_id": 99,
    "title": "Mental health appointment during confinement? Or should I get a diagnosis before I enlist?",
    "author": "GetsuI-DLE",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mffg6a/mental_health_appointment_during_confinement_or/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-02T02:38:56Z",
    "flair": "Question",
    "post_text": "I'll enlist in 2 weeks. I've been feeling troubled mentally so I decided to visit the nearest polyclinic. After a short consultation with the doctor, they said that my symptoms point towards a panic attack disorder. They gave me a referral to a psychiatrist to confirm the diagnosis but the earliest date they could book for me coincides with the day that I'll be in Tekong (confinement period, which is late this month).\n\nWill I even be able to show up? I don't think I can change the date that easily because this kind of thing is scheduled months ahead. The doctor suggested that if I really want a diagnosis ASAP and declare before I enlist, I'll have to go private. I'm thinking of following that advice but I don't know if it's any better. AFAIK the only downside to it is that my enlist date will be pushed back right? I don't really mind.\n\nI heard if people declare during confinement they'll have to be excused from showing up or sit out some activities, all that stuff. It sounds troublesome—makes me think I should just follow the doctor's advice so that I won't have to worry about any complications while I serve. Because if they delay my enlist date, everything will be sorted out by then right? Again, I don't know what's best so I'm really hoping to get some answers/opinions\n\nTL;DR Facing mental health issues, not sure whether to get + declare my diagnosis after I enlist to avoid complicating things while in camp"
  },
  {
    "post_id": 100,
    "title": "How David Neo's Son Case played out actually makes me Happy",
    "author": "JiPaiHongGanLiao",
    "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mfcw9n/how_david_neos_son_case_played_out_actually_makes/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-02T00:30:47Z",
    "flair": "Discussion",
    "post_text": "[Previous context and history. -- Reddit Tread posted on July 14th '25](https://www.reddit.com/r/NationalServiceSG/comments/1lzjju4/what_happened_to_the_case_of_david_neos_son/)\n\nFirstly, I want to be clear that I bear no hate, resentment or any feelings towards David Neo. This is not about him specifically, it is a reflection into the system.\n\n**I am a farmer.**  I grew up believing that hard work will get you somewhere, And of course, you must play your cards right. Like many of you, I did not have a father who was somebody. \\[In fact if you didn't know your father, that does make your father as a nobody\\]. I believe in meritocracy. Unfortunately, with how small Singapore is, and how everyone is related to one another, it can be hard to hold this value. You do feel a big sense of nepotism looming in the country. Whether that is true or not, I cannot comment on that. I am a farmer. \n\n [There is a comment ](https://www.reddit.com/r/NationalServiceSG/comments/1lzjju4/comment/n36tpzd/)in the tread that asks if the son made it to command school. That specific comment was answered with saying that the son did not make it into command school. Further replies speculated that the son did not pass IPPT as the definite reason. \n\nWhether was it because of the incident, or because of IPPT, I am happy. I am happy not because of the former chief of army's son did not make it to a command school, but because the system is working as it should be. \n\nA couple of years ago, Winston Choo, who was the first CDF, attended his grandson's officer commissioning ceremony.  [This was reported by mothership](https://www.youtube.com/watch?v=n02B1AYrV8w). There were a few comments that hinted at nepotism and it was \"given to him\". As quoted from one:\n\n&gt;Everyone knew he'd be an officer way before he even entered NS. Imagine the chief of defence's grandson not being a decorated soldier. His commanders were all probably too scared of doing anything to him.\n\nIt is easy to draw lines. And maybe more so that CDF is higher ranking then CoA. But CoA isn't some small time position either. So I show happiness, not because of the underachievement of someone, but because it is testament to my belief. The belief of meritocracy.\n\nOn the sideline I also wonder: what kind of pressure do the descendants of these high flyers face to perform, being involuntarily linked to that legacy. \n\nOh, and &gt;!because I said I am a farmer,  I[ do enjoy farming videos. ](https://vt.tiktok.com/ZSSUEmdGL/)As the saying goes:  老师有穿衣服，我差一点认不出老师了！！!&lt;"
  },
    {
      "post_id": 1,
      "title": "Extra monthly allowance ?",
      "author": "C0ffeeNSteak",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mb5s8y/extra_monthly_allowance/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-28T03:32:15Z",
      "flair": "Question",
      "post_text": "Hello everyone. I have ORD-ed sometime earlier this month. I have received my pro rated allowance on the 10th. However, I just received an SMS stating that I would be receiving my monthly allowance tomorrow. \n\nI am genuinely confused, does Anywan have any possible solution "
    },
    {
      "post_id": 2,
      "title": "How to get into SAFSA tennis?",
      "author": "Willing-Web-6078",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mb5g2n/how_to_get_into_safsa_tennis/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-28T03:14:37Z",
      "flair": "Question",
      "post_text": "Is there like an application process, or any way for me to bring it up? I would like to play tennis for SAFSA if possible, to make my time worthwhile. I can play tennis decently, but I am PES E1. "
    },
    {
      "post_id": 3,
      "title": "Questions on NSFIT amendments",
      "author": "Quick_Sailor",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mb4tfa/questions_on_nsfit_amendments/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-28T02:42:42Z",
      "flair": "Question",
      "post_text": "I have booked a session on Wednesday evening but at the last minute, I have a work commitment which requires me to go overseas on that day. \n\nIt states that I would need at least 48 hours to amend/cancel my session but when I went to the website, I can't click on the box.\n\nAny other ways to change or will I get charged if I miss the session?"
    },
    {
      "post_id": 4,
      "title": "Pes BP 23/10/2025 letter --",
      "author": "Substantial_Egg443",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mb4ngs/pes_bp_23102025_letter/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-28T02:34:03Z",
      "flair": "Question",
      "post_text": "Any one received letter already?"
    },
    {
      "post_id": 5,
      "title": "Which attire is SLUTTIER?",
      "author": "majulahsotongs",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1masdsu/which_attire_is_sluttier/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-27T17:36:22Z",
      "flair": "Question",
      "post_text": "Guys (and girls?) of this sub, which unofficial SAF attire is SLUTTIER?\n\nTopless number 4 + ID tag\n\nVS\n\nPT kit with alatama/WP (bonus if black socks reach your knees)\n\n"
    },
    {
      "post_id": 6,
      "title": "GPMG course as a 3SG @ ITI",
      "author": "Enough_Bumblebee_296",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1maq37j/gpmg_course_as_a_3sg_iti/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-27T16:06:17Z",
      "flair": "Question",
      "post_text": "Going for gpmg course at ITI\n\nWhats the day to day programme like, is gpmg hard to learn and work with, is there overnight outfield and is the schedule strict like got 1st last parade?"
    },
    {
      "post_id": 7,
      "title": "Applying for Leave in pobc",
      "author": "Own-Hyena8973",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1map1mb/applying_for_leave_in_pobc/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-27T15:24:57Z",
      "flair": "Question",
      "post_text": "Going to pobc this mid aug, is it possible to apply for leave during pobc somewhere around Nov for upcoming exams/events? 🤔 (didnt pass ippt :[\n\n"
    },
    {
      "post_id": 8,
      "title": "Drinking 5 hour energy/Pocari sweat/100 Plus before IPPT?",
      "author": "No_Pilot_7948",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1malkyb/drinking_5_hour_energypocari_sweat100_plus_before/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-27T12:55:03Z",
      "flair": "Question",
      "post_text": "Have a IPPT coming up, does drinking 5 hour energy before IPPT help?"
    },
    {
      "post_id": 9,
      "title": "Will I be ineligble for me1?",
      "author": "Radiant_Attorney828",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1maljkc/will_i_be_ineligble_for_me1/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-27T12:53:07Z",
      "flair": "Question",
      "post_text": "i heard if i go to uni before signing on I would only be limited to me4 or officer positions so just wanna clarify on this? coz if it is then ill sign on with my diploma first then try to take a part time degree while serving\n\nik this sounds dumb but i rlly wish to serve as a me1 on the ground. in addition, i have never had a proper leadership position like exco due to my poor social skills. At most, ive been a group leader for school projects which shld be similar to leading a team of 6 ppl as a me1 rite? thus i dont feel it's right to take on a leadership role when Im most likely going to be poor at it (i prob wouldn't make it past the assesment in the first place)."
    },
    {
      "post_id": 10,
      "title": "How is your life as a sch HQ ASA?",
      "author": "DentistAmbitious8072",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1majs8e/how_is_your_life_as_a_sch_hq_asa/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-27T11:17:35Z",
      "flair": "Question",
      "post_text": "1. What % of your time was spent on doing your own stuff?\n\n2. Bunk condition if i want to stay in? Heard that it was air-conditioned and is a 2-4 man bunk\n\n3. Is there washing machines? Can recruits use it?\n\n4. Generally, how well are you being treated as a recruit there? Heard that I will be working with a lot of high-ranking personnel, so a bit nervous about this as I will get anxiety and shut down when ppl scream at me.\n\n5. Do we get to eat better food, or is it the same food as what we ate previously?\n\n6. Is there unlimited mineral water/other drinks available in the office for us? Or must we drink tekong water? Been getting sore throat since I started drinking the water there.\n\nAny other information, please add on."
    },
    {
      "post_id": 11,
      "title": "Seeking advice: Struggling physically and emotionally",
      "author": "Ok-Story3983",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mag7uw/seeking_advice_struggling_physically_and/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-27T07:26:50Z",
      "flair": "Question",
      "post_text": "Could anyone help or advise on what i should do since im struggling physically and emotionally.\ncontext in comments*"
    },
    {
      "post_id": 12,
      "title": "Questions about HQ 9 DIV/INF",
      "author": "KRXLover",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1maftdq/questions_about_hq_9_divinf/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-27T07:01:26Z",
      "flair": "Question",
      "post_text": "So I got my posting order on friday and it said HQ 9 DIV/INF and I called the POC Number and the Sir said that it was a temp posting for now and its a Stay out for now.\n\nNow I want to know\n1- Food, how is the food because I am tired of bentos (I was SCH V, our cookhouse was under reno and we ate too much bentos)\n\n2- Environment, how is the work environment there at Selarang Camp overall\n\nThats really all I want to know actually"
    },
    {
      "post_id": 13,
      "title": "signing on RSAF halfway through NSF?",
      "author": "pikaclyy",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1maesaf/signing_on_rsaf_halfway_through_nsf/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-27T05:57:38Z",
      "flair": "Question",
      "post_text": "context: i was enlisted into Commando (CDO), but want to sign on RSAF at the end of this year (first year NS). \n\nis it possible? is there any procedure for transfering units? when should i start applying to RSAF?"
    },
    {
      "post_id": 14,
      "title": "Questions about time in NS (niche and weird)",
      "author": "Any-Journalist4025",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1maenhu/questions_about_time_in_ns_niche_and_weird/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-27T05:49:21Z",
      "flair": "Question",
      "post_text": "I am pretty sure I am a transgender ah gua. Think what you want abt that but I’m 99% confident I wish to transition and live as a woman. However, I don’t entirely hate the concept of NS and will just get it over and done with. But I’ve got several questions:\n\n1) Is it possible to skip meals or give my buddies some extra food from my plate? I’d eat the bare minimum so I don’t get any large bone or muscle growth that would make me look like a man when older but enough to survive. I’d probably just give them my protein-rich stuff meats and beans whatnot, would they mind?\n\n2) What’s to say, hypothetically, for the funny, I get hormones and medication from Indonesia and Thailand (if your curious you convert money into crypto and give them, it’s a very weird system but as long as I get my meds) and just go on them DIY. Then after a year I go MO and show them. What’s gonna happen? "
    },
    {
      "post_id": 15,
      "title": "What to expect for Outfield next week? I'm scared. Deathly scared.",
      "author": "BryantTYZ",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1mad0zb/what_to_expect_for_outfield_next_week_im_scared/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-27T04:13:27Z",
      "flair": "Question",
      "post_text": "For context, I'm from the Enhanced BMT batch, serving my NS in mono guards (Oneguards).\n\nI've enlisted since early July and...truth be told, I wasn't doing so well. Even now, I still haven't adjusted. I've broken down and cried 5 times (Yes, I counted) when training gets too tough, timing is so rushed, or the use of weapons. There was the problem my personality and freedom stripped away from me, forcing me to become someone I never wanted to become; a soldier.\n\nAccording to my section mates, outfield will start early August. Living in the jungle for days without clean water, dirt all over you and the worst of all of me...away from my family. I've always contacted them every night before light's out, and outfield won't give me that privilege.\n\nCould anyone share with me what will I be going through at Outfield? At the very least, I could prepare myself mentally. I've received help from MO, OO and even the councillor from CareHub, so I'm should be hanging on...for now."
    },
    {
      "post_id": 16,
      "title": "What are some funny stories you have encountered in NS?",
      "author": "popcorn_aura",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m9xbxi/what_are_some_funny_stories_you_have_encountered/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-26T16:15:53Z",
      "flair": "Funny",
      "post_text": null
    },
    {
      "post_id": 17,
      "title": "What will I do once excused uniform?",
      "author": "Round-Tutor-8199",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m9uuei/what_will_i_do_once_excused_uniform/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-26T14:34:41Z",
      "flair": "Question",
      "post_text": "When I wear uniform I get lots of red itchy bumps all over my legs that cause me to constantly scratch and it stays for a long time even after taking it off so I’m planning to get excuse uniform. \n\nAnyone knows what you’ll do after getting it? What activities can you not do now? And how long will it take for me to get a permanent excuse uniform after seeing the MO?"
    },
    {
      "post_id": 18,
      "title": "Has anyone ever successfully changed vocation/unit in SPF? If so, how did you do it?",
      "author": "Minute_Ad_9126",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m9sba4/has_anyone_ever_successfully_changed_vocationunit/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-26T12:38:51Z",
      "flair": "Question",
      "post_text": "I'm just curious if anyone has ever done it before and how they did it. "
    },
    {
      "post_id": 19,
      "title": "In desperate need of mental help.",
      "author": "Nigrfgot",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m9s3f3/in_desperate_need_of_mental_help/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-26T12:28:00Z",
      "flair": "Discussion",
      "post_text": "I have been really struggling with my mental health and to stay afloat from spiralling but its been really difficult. I recently had a really messy breakup and my parents filed for divorce a month after. I have been caught in the legal battle between them and I feel abandoned by my parents in the midst of this as well.\nI have a counselling session scheduled with scc and a referral for PCC, but I dont know how long they will take to process my case and help in any way.\n\nSince I am PES A, they posted me to a combat voc and I genuinely dont think I can cope with all that is on my plate. I have been really anxious even waking up in the middle of the night, nightmares or even trouble sleeping as well. I have been given an excuse stay in for 30 days along with excuse weapons for 84 days by the MO but this environment is only deteriorating my mental health further. Its getting more urgent and im not sure what I can or should do. I really need help. Anyone with advice on this would be greatly appreciated :\")"
    },
    {
      "post_id": 20,
      "title": "What is staff parade? HELP",
      "author": "Cute_Chard6397",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m9rvaz/what_is_staff_parade_help/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-26T12:16:09Z",
      "flair": "Question",
      "post_text": "My friend got SOL and is required to attend staff parade. But we both have no idea what is that."
    },
    {
      "post_id": 21,
      "title": "About the Medical screening",
      "author": "Bing6909",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m9quw9/about_the_medical_screening/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-26T11:20:22Z",
      "flair": "Question",
      "post_text": "Hello guys ! I have a question about make an appointment for Medical screening. However, I can’t find button to make appointment. Even i use the phone one, it keep kicking me out. \n"
    },
    {
      "post_id": 22,
      "title": "OOC Sch V rebmt due to attendance",
      "author": "Standard-Buy794",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m9pdaq/ooc_sch_v_rebmt_due_to_attendance/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-26T09:47:01Z",
      "flair": "Question",
      "post_text": "I have a question regarding being sent for rebmt, Is it possible to OOC due to attendance  because I have quite alot of MA's (1-3 a week) for my many health conditions. Should I bring this up in my FFI as well."
    },
    {
      "post_id": 23,
      "title": "how to claim transport fees?",
      "author": "extamemesalot",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m9omve/how_to_claim_transport_fees/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-26T08:57:58Z",
      "flair": "Question",
      "post_text": "tried to create a claim for the grab trip i took a few days ago, but ns portal gives a prompt saying \"Trip cannot be added as personnel profile (transport) is not maintained\" or something like that.\n\nany way to fix this? "
    },
    {
      "post_id": 24,
      "title": "Military expert vs conventional rank system qn",
      "author": "EmploymentPale457",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m9o1jp/military_expert_vs_conventional_rank_system_qn/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-26T08:17:40Z",
      "flair": "Question",
      "post_text": "I hv seen some enciks who rose from me3 (that is warrant officers) to me4 (basically cpt rank or smth based on wikipedia and hearsay), based off career progression and maybe aftr joining some upskill course, so are me4s who took years to get that rank rly considered commissioned officers? Its quite confusing cuz these me4s have not been through ocs unlike their younger me4 counterparts. Also has anyone seen arrowncrab rank enciks rise to 1 bar above before? just curious abt it\n\nJust another side qn, if signing on military expert stuff gives u more room for career progression, why do some people still choose the conventional system over it?"
    },
    {
      "post_id": 25,
      "title": "Is it possible to sign on?",
      "author": "Old-Supermarket9052",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m9mldj/is_it_possible_to_sign_on/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-26T06:44:55Z",
      "flair": "Question",
      "post_text": "I didnt complete bmt and i never got sent to recourse. Nowadays im considering sining a contract with the army. Im looking at the MDES or EWOS scheme since i cannot go to EOS due to my rank. Im currently in uni and going to finish in 3 to 4 years, afterwards going to sign on.\n\nGot some questions:\n\nWhats the shortest contract i can sign on? I seen on the website that it is 2 years, but alot of people tell me its 6 years, im confused. I want to sign only 2 years if possible, on the website it says its contract service 2 years.\n\nWill MDES scheme require OCS or SCS?\n\nWhat is MDES and what do they do? Will it require me to have some engineering degree?? I have a medical related degree if that helps.\n\nThanks in advance uwu"
    },
    {
      "post_id": 26,
      "title": "Compassionate Leave enquiry",
      "author": "NoIdeaForUsernamel0l",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m9mhkl/compassionate_leave_enquiry/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-26T06:38:09Z",
      "flair": "Question",
      "post_text": "My uncle has passed away am I granted a compassionate leave? Anyone had a similar experience to this? "
    },
    {
      "post_id": 27,
      "title": "My Son Has ORD-ed This Week",
      "author": "weischin",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m9koft/my_son_has_orded_this_week/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-26T04:51:18Z",
      "flair": "Other",
      "post_text": "Just wanted to put a post out there that I am SO proud of my son for completing his NS. It has been a really tough 2 years, going through all the grueling training, some bad commanders, some over demanding enciks, toxic environment at times and lousy cookhouse food. Seeing him endure and mature and able to discern good and bad characters is heartening. \n\nIt is time now for him to put NS behind him and embark on his next journey. \n\nCongrats to those who ORD this month too. To those who are going to enlist or going through the tough times, take good care of yourself and know that it will pass. Your family is proud of you too!"
    },
    {
      "post_id": 28,
      "title": "Am vegetarian, how is it like in bmt",
      "author": "Suspicious-Quail5298",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m9jifr/am_vegetarian_how_is_it_like_in_bmt/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-26T03:47:53Z",
      "flair": "Question",
      "post_text": "I'm serving soon, but I heard a lot of people say vegetarian in ns is bland, they serve more carbs instead of protein, is this true?\n\nHow screwed am i?\n\nAny suggestions?"
    },
    {
      "post_id": 29,
      "title": "Mental Health Problem regarding NS",
      "author": "AlternativeKind4492",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m9ixo3/mental_health_problem_regarding_ns/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-26T03:16:53Z",
      "flair": "Question",
      "post_text": "Hi, I am still waiting on going to BMT but these few days, I have been experiencing anxiety and depression. While training at home, out of nowhere, I will have a mental breakdown out of nowhere and start crying for no reason. Even when I am consulting my parents, they told me it was alright and it's part of the process and told me not to worry about it. \n\nI tried to ignore all these negative thoughts but it just kept getting stronger and stronger. I can't even sleep at night with all these negative thoughts. I don't really know what to do. I had a slight depression once during secondary school due to bullying but it was fixed after multiple sessions of counselling and getting it over by myself. But this time, I felt really hopeless and it's been draining me to the point I just feel moody and depressed all the time. \n\nJust by thinking of the commanders, training and my platoon mates, I will start getting all these negative thoughts. Due to my previous experience with bullying, I am really nervous when interacting with new people and I am afraid of just being a burden to others if I am unable to do something etc. \n\nI really need help and I would like to ask if there is anything I can do about it. It is affecting me a lot these past few days. Really appreciate if anyone can give me any tips and suggestions. Thanks so much."
    },
    {
      "post_id": 30,
      "title": "Whats is one unit in SAF you cant transfer out of as a medic?",
      "author": "Trex_Ejacualate",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m99tc3/whats_is_one_unit_in_saf_you_cant_transfer_out_of/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-25T20:21:54Z",
      "flair": "Question",
      "post_text": null
    },
    {
      "post_id": 31,
      "title": "Do ME3s get a sword or only ME4 above?",
      "author": "Co0chie_Man69",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m98ahr/do_me3s_get_a_sword_or_only_me4_above/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-25T19:20:47Z",
      "flair": "Question",
      "post_text": "Just saw a tiktok clip of quite a few ME3s from the colour party with a sword and pace stick during this years ndp rehearsals? Aren’t swords only handled out to commissioned ME4s and above? "
    },
    {
      "post_id": 32,
      "title": "Why am I dreading ICT even without attending?",
      "author": "Intelligent-Unit6598",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m8trr8/why_am_i_dreading_ict_even_without_attending/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-25T08:30:10Z",
      "flair": "Discussion",
      "post_text": "During my time in unit, I have had people makes jokes about me that became borderline or all out bullying to me. \n\nI felt like I could not talk to any of the commanders because they have good relationships with those who picked on me. If I were to voice out, they would have shown favouritism to them. I felt like I would have been told to just suck it up.\n\nEven my own sect comm, who is supposed to be someone I can turn to for help, joined them.\n\nThankfully I was able to defer my first cycle because of a summer school programme."
    },
    {
      "post_id": 33,
      "title": "My friend rly rly wants to go to re bmt at tekong",
      "author": "Empty-Coyote-1457",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m8t6hh/my_friend_rly_rly_wants_to_go_to_re_bmt_at_tekong/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-25T07:50:32Z",
      "flair": "Question",
      "post_text": "So my friend has recently uppessed liao to b1, but the unit does not allow him to go to combat fit tekong bmt and is unwilling to help him to write letters to re bmt, on the basis that its damn hard, troublesome + shortage of manpower. They even told him that even if they write the letter, the higher ups may not approve. He really really wants to get out of the mundane clerk life too much saikang, to go chiongsua. What can he do now? Hes thinking of indicating interest to sign on so they will let him off, what do yall think"
    },
    {
      "post_id": 34,
      "title": "Are airbase medics trained differently from army medics?",
      "author": "JiPaiHongGanLiao",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m8rl3c/are_airbase_medics_trained_differently_from_army/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-25T06:09:08Z",
      "flair": "Question",
      "post_text": "Legit curious, I mean the common injuries faced are gonna be the same, but what I am more curious about is if there is additional training due to pressure  sickness or whiplash due to the nature of a plane’s High Gs."
    },
    {
      "post_id": 35,
      "title": "BMT HELP ME OUT PLEASE !!!",
      "author": "Other_Engineering217",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m8p40l/bmt_help_me_out_please/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-25T03:50:22Z",
      "flair": "Question",
      "post_text": "Hi im in tekong rn im really damn sick and tired and i have very bad insomnia cant sleep and very bad body pain. I cant do this anymore what to do? How do i get long term mc and downpes anything to just fuck off im desperate "
    },
    {
      "post_id": 36,
      "title": "Retaking a levels in army as Nsf guards/ocs",
      "author": "ThatRandomDude001",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m8p1r0/retaking_a_levels_in_army_as_nsf_guardsocs/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-25T03:47:06Z",
      "flair": "Question",
      "post_text": "Considering signing on but also want to retake cause my results were bad don't think I can opt for scholarships. Any advice or people who have done so before? "
    },
    {
      "post_id": 37,
      "title": "Uni bridging course issues",
      "author": "Panjin21",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m8omm2/uni_bridging_course_issues/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-25T03:25:02Z",
      "flair": "Question",
      "post_text": "So just asking but does anyone have bridging course not covered for disruption? What do you guys go?\n\nRight now I have a bit of an issue. Last week before NS cannot take leave, need attend the online course in camp. Not mandatory to attend but damn do I need it."
    },
    {
      "post_id": 38,
      "title": "Struggling mentally and told to tough it out while I wait for pcc",
      "author": "IntelligentHat2846",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m8kt40/struggling_mentally_and_told_to_tough_it_out/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-25T00:19:04Z",
      "flair": "Question",
      "post_text": "Struggling mentally in BMT right now and MO referred me to pcc but said it could take months and I’m supposed to just tough it out with the help of statuses. \n\nWhat are my options? Being in camp is very detrimental to mental health and I’m seeing a private psychiatrist next book out. \n\nMy parents also want to write in to SAF but are unsure of where to send to. Would appreciate advice on this as well as things I can do to make life bearable in NS"
    },
    {
      "post_id": 39,
      "title": "Weekly questions and discussions - July 24, 2025",
      "author": "AutoModerator",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m8g6ka/weekly_questions_and_discussions_july_24_2025/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-24T21:00:39Z",
      "flair": "Weekly",
      "post_text": "Use this to ask smaller questions or for discussions.\n\n* Downvotes are strongly discouraged\n* Please be polite\n* Join our [Discord Server](https://discord.gg/jRSWjdtQg7)\n* Read the [Frequently Asked Questions](https://national-service.now.sh/faq) too\n\nIf you have any issues, please [contact the mods](https://www.reddit.com/message/compose?to=%2Fr%2FNationalServiceSG)."
    },
    {
      "post_id": 40,
      "title": "Taking teleconsult mc for reservist",
      "author": "Odd-Bookkeeper-5747",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m868zw/taking_teleconsult_mc_for_reservist/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-24T14:42:21Z",
      "flair": "Question",
      "post_text": "Hi, i ord'd ard 4 months ago from SPF and to my knowledge i am aware that i have till next year before my birthday to complete my ippt. My unit scheduled me for ippt on 26th july and when i asked why i was booked so early they said they want to promote me to be a TL (team leader) during my reservist deployments. Problem is I have come down with a fever and am unable to take the ippt. Is it possible to take teleconsult MC from seedr or manadr or do i have to go to a polyclinic. To be fair I also don't really want to take on the role of a TL... but my unit is low on manpower..."
    },
    {
      "post_id": 41,
      "title": "[Advice] Thinking of signing on as ME4 (Army) – want to hear real pros and cons",
      "author": "PalpitationNovel8711",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m82kgn/advice_thinking_of_signing_on_as_me4_army_want_to/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-24T12:05:08Z",
      "flair": "Question",
      "post_text": "Hi all, I’m currently an NSF (not a spec), and I’m thinking about signing on as an ME4 (Army). \n\nA big reason I’m considering it is because of the SAF study sponsorship. So far, most of the opinions I’ve heard has been quite positive — but I’m still a bit skeptical and want to make sure I go into this with eyes open.\n\nWould appreciate it if anyone could share their **honest opinions or experiences**, especially on:\n\n* How is **OCS like** for ME4s? Do I need to go through JCC as well?\n* What’s the **ME4 role** like day-to-day, especially in **Maintenance and Engineering, or Ammunition**?\n* What are the **real pros and cons** of signing on as ME4?\n* Is the **study sponsorship worth it**, or are there downsides I should be aware of?\n\nJust trying to make a well-informed decision before committing. Appreciate any insights – good or bad. Thanks in advance!"
    },
    {
      "post_id": 42,
      "title": "ORD on 18 Aug 2026 How many leaves do i get next year?",
      "author": "Winter_Control1417",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m81fwt/ord_on_18_aug_2026_how_many_leaves_do_i_get_next/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-24T11:06:18Z",
      "flair": "Question",
      "post_text": "Planning my overseas travel next year. How many leaves do I get if I ORD on 18 August 2026? Thanks in advance"
    },
    {
      "post_id": 43,
      "title": "Mindef Reserve (MR) Requirements",
      "author": "RoyNLoy",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m7z87u/mindef_reserve_mr_requirements/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-24T08:52:18Z",
      "flair": "Question",
      "post_text": "To MR, need to clock 10 ORNS years and at least 7 high keys\n\nHave some questions:\n1) Clear annual IPPT considered ORNS year? \n2) If I am on mob manning standby and activated, does it count as ORNS year? How about if on standby but not activated? \n\nThanks! "
    },
    {
      "post_id": 44,
      "title": "Anyone here genuinely enjoyed their time in NS?",
      "author": "Conscious_Anybody371",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m7yeq5/anyone_here_genuinely_enjoyed_their_time_in_ns/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-24T07:59:30Z",
      "flair": "Question",
      "post_text": "Going to be going botak soon wanna hear from you guys. I hear a lot of people hating having to serve NS but I wanna hear YOUR honest experience there. \n\nPersonally , I feel like this 2 years will be a break from home and improving my fitness , hence, I don’t really mind apart from having to book in and the 👻 stories"
    },
    {
      "post_id": 45,
      "title": "Why were there ACJC students at Gedong Camp today?",
      "author": "tootfacemcgee",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m7x848/why_were_there_acjc_students_at_gedong_camp_today/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-24T06:45:07Z",
      "flair": "Question",
      "post_text": "Saw a truckload of ACJC students prowling about the camp today, any reason why?"
    },
    {
      "post_id": 46,
      "title": "3SG ASA guy went to Tekong to re-BMT to sign on but is that really needed?",
      "author": "Due_Complaint_352",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m7vduo/3sg_asa_guy_went_to_tekong_to_rebmt_to_sign_on/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-24T04:57:15Z",
      "flair": "Question",
      "post_text": "So I overheard the story of 3SG ASA guy get sent to Tekong to redo BMT because he wanted to sign on. But I thought whether you can sign on is mainly based on your PES status?\n\nLet’s say he wants to sign on as a DIS  voc, does he even still need to do pes fit tekong re-BMT? Cuz i got heard of story before of B1 guy sign on dis to become officer, but didnt go thru tekong, only went for some ocs conversion course.\n\nedit: dis sign on guy was once temp pes e"
    },
    {
      "post_id": 47,
      "title": "If I want to sign on after ORD and getting a degree, in what way would being PES B2 affect that?",
      "author": "awaythrow960",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m7ueky/if_i_want_to_sign_on_after_ord_and_getting_a/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-24T04:03:22Z",
      "flair": "Question",
      "post_text": "Currently I am PES B2, serving as a transport operator. I want to go to uni first to get degree then if I have no job opportunity just sign on.\n\nBut if currently my PES is B2, how would that effect me signing on in SPF or SAF in the future? \n\nWould my degree still be recognized? How does the upPES process after ORD differ from trying to upPES now?\n\nThe reason I’m B2 is because I dislocated my shoulder before and had surgery, is it possible to appeal to upPES to B1 having had surgery before?\n\nThanks in advance\n\n"
    },
    {
      "post_id": 48,
      "title": "hows life as a tekong spec",
      "author": "Beneficial-Dance8091",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m7ue1q/hows_life_as_a_tekong_spec/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-24T04:02:37Z",
      "flair": "Question",
      "post_text": null
    },
    {
      "post_id": 49,
      "title": "This Is the Truth Behind Your ‘Future Leaders’",
      "author": "Comfortable-Look-714",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m7rz9v/this_is_the_truth_behind_your_future_leaders/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-24T02:01:02Z",
      "flair": "Rant",
      "post_text": "I’m a female. And I’m done staying silent.\n\nThere’s a certain leadership training institution that constantly preaches pride, discipline, and honour and all those polished slogans you hear at parades and see printed on banners. But behind that shiny image is a system full of hypocrisy, silence, and cowardice.\n\nI’ve witnessed guys joke openly about raping TikTok girls. Loud. Casual. As if it’s normal. And no one stopped them. No one called them out. That’s the kind of culture that’s being protected just because it’s easier to ignore it than to admit your future “leaders” are morally bankrupt.\n\nI once took a simple photo of someone I was interested in and somehow that made me the threat. Someone even threatened to find me over it. And what did the people in charge do? Nothing. Instead, they turned their attention on me.\n\nI got accused of trying to hook up with commanders. Even one who was attached. Completely false, made-up bullshit, thrown around just to ruin my name. Just because I didn’t fit into their clique. Just because I didn’t play the game. They didn’t care about truth. They cared about image, and I was bad PR.\n\nThis place claims to “lead with pride,” but all I see is boys playing soldier. Spreading lies. Protecting each other while tearing down anyone who dares to be different. Anyone who dares to speak up.\n\nYou don’t lead with pride. You lead with gossip, cowardice, and fear.\nYou punish the inconvenient. You reward the disgusting.\nYou tear people like me down and not because we did anything wrong, but because we refuse to stay silent.\n\nMy heart doesn’t just burn but it fking bleeds. From betrayal. From watching people I once respected protect filth while stabbing me in the back. From knowing that the uniform means nothing if the people inside it have no soul.\n\nYou warned others to avoid me.\nBut I wasn’t the danger.\nI was just a woman who saw the truth and refused to shut up.\n\nSo here’s my voice. Loud. Unapologetic.\nFk your fake pride. Fk your hollow leadership.\nAnd fk the cowardice you hide behind the ranks that you never deserve.\n\nFrom,\nA civilian who once respected people who went through the leadership training institute"
    },
    {
      "post_id": 50,
      "title": "Process For Pcc post out HELP",
      "author": "Sweaty-Wrongdoer-588",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m7qklb/process_for_pcc_post_out_help/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-24T00:54:26Z",
      "flair": "Question",
      "post_text": "I recently went for pcc appointment and pending post out anyone know how long it’ll take pls help "
    },
    {
      "post_id": 51,
      "title": "For ex regulars, why did yall leave the force?",
      "author": "Nocturnh",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m7cx34/for_ex_regulars_why_did_yall_leave_the_force/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-23T15:51:28Z",
      "flair": "Question",
      "post_text": "This question is for ex regulars who previously served and decided to leave the force. What were your reasons for signing on and your reasons for leaving?"
    },
    {
      "post_id": 52,
      "title": "Can I don’t eat the food provided?",
      "author": "dinerohungry",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m7cuyg/can_i_dont_eat_the_food_provided/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-23T15:49:17Z",
      "flair": "Question",
      "post_text": "I have not enlisted yet but was wondering, if I do not like the food that they serve in the cookhouse/ canteen, can I just choose not to eat it? I’ve starved for a few days before so I wouldn’t mind just not eating it if I don’t like it. Will they force me to eat? Or can I at least just eat some rice and nothing else? I don’t like eating a lot of food and from what I can tell, it seems that the food I do not like eating, are the type of food they serve there so I would rather just not eat at all if im being honest. "
    },
    {
      "post_id": 53,
      "title": "is it possible to sign EOS with private diploma or degree?",
      "author": "Fluffy-Flamingo-667",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m7cqyb/is_it_possible_to_sign_eos_with_private_diploma/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-23T15:45:04Z",
      "flair": "Question",
      "post_text": "idm if the career progression is slow or the pay increment is slow, since young its my dream to be a officer.\n\n"
    },
    {
      "post_id": 54,
      "title": "NSF PAssion concession card",
      "author": "NoIdeaForUsernamel0l",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m79lao/nsf_passion_concession_card/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-23T13:41:58Z",
      "flair": "Question",
      "post_text": "Will the fare be the same as an adult or no? "
    },
    {
      "post_id": 55,
      "title": "SPF SOC training wing, what is NSF life like there",
      "author": "JeanSucksAtLife",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m76dby/spf_soc_training_wing_what_is_nsf_life_like_there/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-23T11:10:22Z",
      "flair": "Question",
      "post_text": "Hey guys, Im a PNSF who got posted to SOC recently and heard that a lot of NSFs get posted to training wing after completing PTC. Don’t really know what life is like there other than it’s office hours with the same risk pay? I may be wrong which is why I’m asking lol. Thanks guys"
    },
    {
      "post_id": 56,
      "title": "About Downpes process in unit",
      "author": "Upper_Disaster_6378",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m720mx/about_downpes_process_in_unit/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-23T06:35:33Z",
      "flair": "Serious Discussion",
      "post_text": "Currently a PTP recruit in Tekong (mono sch4 intake)\nSince the start of PTP, I’ve had trouble adjusting and as BMT started, my mental health has been deteriorating and honestly I feel like I’m already half dead inside.\nHowever I’m really unwilling to seek help right now, as I really don’t want to Re-BMT. Thus I’m only considering seeking professional help after my POP.\n\nI have a few questions:\n\n1. Is it true that it’s harder to downpes in unit? I’ve heard that it’s harder to get PCC appointments, OC is less willing to help u etc.\n2. Once I do submit my memo, will I be posted out or revocated to a support role?\n3. Is it possible to post out of my unit even if I’m mono intake?\n4. Will I have to rebmt or recourse even if I seek help after POP?\n5. For those who got diagnosed with adjustment disorder, did you get excuse stay in?\nIf there’s anything else I should know or if anyone has a similar experience, I’d appreciate some insight on how the whole process is like 🙏\n"
    },
    {
      "post_id": 57,
      "title": "Argument with superior. Need advice.",
      "author": "kerthern",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m71vq7/argument_with_superior_need_advice/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-23T06:27:05Z",
      "flair": "Rant",
      "post_text": "So today I was arguing with my superior regarding an issue (which I think we were both at fault, and I hope to get some advice on how I can resolve it from here on).\n\nContext: I'm an ASA, and in my office, the NSFs usually sleep during lunch time. I used to sleep at my office seat, but becos there's a ceiling light right above it, I can never sleep well so yesterday, I tried to find a new room to sleep in. I found this room which was supposed to be a lecture room (it just has stacked chairs and tables and nth else), and to my knowledge, it is rarely used, and there are also no signs that say \"no entry\", so I just went in to sleep during lunch. \n\nThen after I fell asleep, my superior came to that room and started knocking on the door to tell me to get the fuck out of there, and then I woke up and got out. The moment I got out, he scolded me for being in that room.. but there were no senstive materials nor any \"no entry\" signs that say I couldnt enter that room. That is not the worst part. The worst is he accused me of stealing the key to unlock the room, even though it was already unlocked when I entered! \n\nApparently last week, the key to that room was stolen (which I didn't even know about.. I only know a key was stolen from my office, but not to that room), so he pushed the blame of the stealing the key on me and said I took it, even tho I didn't even do it.\n\nNow back to the argument today, I admit that I was at fault for supposedly trespassing into that room without legal permission (but at that point I didn't think so as there weren't any no entry signs, which most army rooms wld have if they are not meant to be entered), but my superior doesn't want to admit his mistake and apologise for wrongly accusing me of stealing/taking the key. His explanation? He said that yesterday when he accused me, once I said no I didn't do it, he didn't push on the accusation. Well from my memory, yesterday he kept asking me why the fuck i didnt admit stealing the key, and tbh jus becos u accused someone one time and stop after that doesnt mean it makes u correct right? It's like saying I murdered someone and I realised my mistake so I stop killing people, without admitting nor apologising, and that doesn't make me a murderer.\n\nSorry for the long rant, but to anyone who was patient and kind enough to read thru this whole passage, are u able to give me any suggestions on how to settle things nicely with my superior? I'm also scared that he may charge me for trespassing so I am hesitant to escalate it to higher ups. Please advice me on what to do, thanks!\n\nEdit: Thank you to everyone who have read through and provided me with your own personal advice on the situation. All of your advice and feedback, regardless of which side you are taking, have helped me comprehend the situation in a much more mature manner. My decision from here on now is to just let it go and let the past be the past. Thank you again for all your advice!! 🙏🏻🙏🏻"
    },
    {
      "post_id": 58,
      "title": "Does NS actually do this?",
      "author": "GladPerspective6586",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m6yma7/does_ns_actually_do_this/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-23T03:23:37Z",
      "flair": "Discussion",
      "post_text": "Good guys go in come out bad  \nBad guys go in come out good"
    },
    {
      "post_id": 59,
      "title": "I’m a foreigner but I want to find nsf friends!",
      "author": "SouthHoneydew1469",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m6up7v/im_a_foreigner_but_i_want_to_find_nsf_friends/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-23T00:15:57Z",
      "flair": "Discussion",
      "post_text": "Disclaimers: I know this can be a weird offtopic but I hope you guys can help out.\n\nHi everyone! For context, I’m a uni student (21F), I’m non-Singaporean (living in ASEAN). Since I was an introvert and my sense of humor doesn’t really match with my peers (I’m more comfortable in expressing myself in English), resulting in me not really having much friends irl. Luckily, I found some treasure friends online through videogames and one of them is an NSman, who used to be an Infantryman long ago.\n\nSince then, he was sharing to me a lot of things happening in his NS journey, from his first-ever BMT outfield where he had to practically dig shellscrapes to his funny moments where him and his friends were trolling on their sgt, literally everything. He said he developed best friendships in NS who were his ex-bunkmates where they ate, slept, did everything tgt, and definitely enjoyed the NS chapter of his life. He even showed me a few clips of both his and his friends’ parade, whole time I was just amazed.\n\nI started forming a big passion in learning about NS systems (yet I’m not sg-based so my ns knowledge is very limited), but I do love reading ns stories so much, which is kinda weird coming from a foreigner; however this stems from the fact I don’t really enjoy how lonely uni is and how my life pattern just about same boring routine, slowly I found comfort in reading different experiences of nsf from all postings; from the bottommost stories (tiredness of combat load, unnecessary guard duty/night mission, screwed up meals, weird people etc.), to excitement in ord countdown. I don’t sugarcoat it and I know a lot people think 2-year length is a waste, yet I view it as a meaningful short pause from actual competitive real-life settings that you can only experience once in early 20s. And I admired yall so much for completing such an immense journey.\n\nI don’t have nsf friends and I’m super welcoming to know more about real-time experiences!! I hope I can find some people to discuss/talk (or you can rant) about ns. I’m so down to hear that rather than just watching Ah Boy to Men lol.\n\nEdit: I’m sorry if it seemed like I was trolling, but I do have all proven socials if yall actually want to make friends (DMs open), I just want to hear about the cool stories and stuff yall have since I was interested in ns system which my country doesn’t have it as compulsory. "
    },
    {
      "post_id": 60,
      "title": "What to expect if ur PES C2?",
      "author": "wahtyoutalkinabout",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m6j5ia/what_to_expect_if_ur_pes_c2/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-22T16:43:59Z",
      "flair": "Question",
      "post_text": "No excuses or wtv just pure C2. i read online that the common sentiment about it is that it's very relaxed and even more so if you have excuses. (very fit physically tho, like can run 2.4km arnd 10mins and more than capable to do 40+ pushups in 1 min)"
    },
    {
      "post_id": 61,
      "title": "What da hell is MTI pro term in scs?",
      "author": "BurnerAccount_677",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m6dkh1/what_da_hell_is_mti_pro_term_in_scs/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-22T13:05:21Z",
      "flair": "Question",
      "post_text": "I had no idea there are other forms of infantry pro terms, is it a mono only thing? Can recoursers get that since its infantry?"
    },
    {
      "post_id": 62,
      "title": "How to become GOH for SCDF during NDP?",
      "author": "loudhailer69",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m6c022/how_to_become_goh_for_scdf_during_ndp/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-22T11:51:33Z",
      "flair": "Question",
      "post_text": "Is there any possibility for you to get the no.1 uniform and keep it. \nI heard from a senior that apparently even if you just go through SCC, if you are selected to be GOH during NDP you will get a tailored version and you will be able to keep it. \nCan someone tell me if this is bs or actually true cause from what I know , only those who commissioned from RCC get to keep their no.1 uniform "
    },
    {
      "post_id": 63,
      "title": "disposable underwear still allowed?",
      "author": "Nitrotivityyt",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m68h9l/disposable_underwear_still_allowed/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-22T08:20:03Z",
      "flair": "Question",
      "post_text": "as the title states, are disposable ones allowed or no"
    },
    {
      "post_id": 64,
      "title": "Being a muslim in the army",
      "author": "Dan4241",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m68bli/being_a_muslim_in_the_army/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-22T08:09:58Z",
      "flair": "Question",
      "post_text": "Hello all, I will be going in BMTC soon and I'm worried if I can do my 5 daily prayers as a muslim. I understand that because of the schedule I may not be able to pray all five or at all, that's fine but am I able to pray during admin time or make up my prayers after lights out? Are there prayer rooms at BMTC or will I have to pray in bunk? Also is there any possibility to pray during outfield? Any muslims can share their experience or if anyone have had practicing muslims in the same bunk as you? Thank you. "
    },
    {
      "post_id": 65,
      "title": "Just received my PES grading and am confused that I got an E1",
      "author": "BadigolBoy",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m67c5u/just_received_my_pes_grading_and_am_confused_that/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-22T07:06:29Z",
      "flair": "Question",
      "post_text": "Just got my PES today and I am very shocked that I got E1. Im a somewhat fit person, slightly overweight, no mental issues and the only major thing that i could think of was my eye surgery for a cross eye i did 3 years ago that solved the issue. Did they use my NAPFA results from secondary school as a basis but it cant be that because my results were decent, not enough to warrant an E1. Is my eye surgery that drastic that I get an E1? What do i need to prove and submit to up PES because i have no interest in doing menial shit for NS. "
    },
    {
      "post_id": 66,
      "title": "is there a gym/weight room in kranji sch V for E9",
      "author": "eatbobsneck",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m66hjq/is_there_a_gymweight_room_in_kranji_sch_v_for_e9/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-22T06:12:13Z",
      "flair": "Question",
      "post_text": "Hello, I am about to go into kranji sch v in the new few months. i’ve heard about having quite a bit of admin time for E9s. i was wondering if there is a gym we can use during that time or must wait until book out?"
    },
    {
      "post_id": 67,
      "title": "Suffering from mental health issues",
      "author": "SeatOver6288",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m66b0e/suffering_from_mental_health_issues/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-22T06:00:52Z",
      "flair": "🏥 Medical",
      "post_text": "Hey there, im technically not in the army yet (abt 3 weeks till I do). However my mental health has been deteriorating drastically for the past few weeks. The thought of army life is the definitely the main attributing factor to my recent bouts of panic attacks. My mental health prior to this has never been that good too honestly caused by other factors not relating to NS (toxic/abusive relationships and other personal issues). Just want to ask whether anyone got any advice or experience for situations like these. Thanks"
    },
    {
      "post_id": 68,
      "title": "For those in pes BP Results after BMT",
      "author": "Substantial_Egg443",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m6504o/for_those_in_pes_bp_results_after_bmt/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-22T04:44:51Z",
      "flair": "Question",
      "post_text": "Just out of curiosity for those who were in Pes BP, like those who were overweight since secondary school, did getting back to normal weight after bmt , cause you to grow taller?\n\n(asking this as i don't feel secure about height and want to see if its something possible,  tried looking it up online but it doesn't say the chances of this happening) "
    },
    {
      "post_id": 69,
      "title": "How do you actually make the most of your weekend book-outs?",
      "author": "HereOnlyLah",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m64a7d/how_do_you_actually_make_the_most_of_your_weekend/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-22T04:05:35Z",
      "flair": "Discussion",
      "post_text": "Book‑out landings always look promising - rest, treat yourself, maybe hang out with mates. But somehow it’s already Sunday night before you know it. One long nap, some food, a quick scroll through TikTok, and you’re back in camp with barely enough time to pack and prep.\nAnyone successfully turned weekend book‑outs into something more than a blur?\n\n- Got a go‑to routine that makes the days feel productive and recharging?\n- Plan a “day mission” or simple reset ritual to avoid going full zombie mode?\n- Even tiny wins - like watching a film start to finish without conking out - count.\n\nSome tips from those in full BMT or high‑tempo units? How do you squeeze real rest out of those short weekends?"
    },
    {
      "post_id": 70,
      "title": "Unclear enlist notice (PTP)",
      "author": "lllllIiiIIIlllI",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m647lo/unclear_enlist_notice_ptp/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-22T04:01:43Z",
      "flair": "Question",
      "post_text": "I'm entering in ptp for pes bp but I'm not sure what to bring and where exactly to go. My letter only states the date and that I have to go to BMTC HQ at 8am. So does that mean I have to show up at Pasir Ris Int before 8? As for the things to bring do I just follow past redditors as well? Got a little confused since my friends did get a letter with things to bring but I did not(some blue colour paper) "
    },
    {
      "post_id": 71,
      "title": "Boyfriend going for ranger course this year",
      "author": "Prestigious-Title-66",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m62gzz/boyfriend_going_for_ranger_course_this_year/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-22T02:34:09Z",
      "flair": "Question",
      "post_text": "My boyfriend is going for the ranger course this year, what can I do to support him during this period and is there anything special I need to take note of?\n\nAlso, if ranger is split into three parts, is he allowed out between each phase?\n\nIt seems like phase three is overseas so will he have more rest time before that? Can I send him off or isit like some private flight\n\nEdit: Thank you all for your comments! I'm planning to buy for him some snacks, mosquito repellent, gatsby wipes etc (what else should i buy for him? I'm assuming he can bring these in haha)"
    },
    {
      "post_id": 72,
      "title": "will svc medics be called up for reservist?",
      "author": "ryan_tjr",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m61u2t/will_svc_medics_be_called_up_for_reservist/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-22T02:03:39Z",
      "flair": "Question",
      "post_text": "will svc medics be called up for reservist? if so wat kind of reservist"
    },
    {
      "post_id": 73,
      "title": "Anyone know what's FFI for regular absorption",
      "author": "Ok_Librarian_5173",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m5yjb6/anyone_know_whats_ffi_for_regular_absorption/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-21T23:29:33Z",
      "flair": "Question",
      "post_text": "I plan on signing a diff service currently in unit and the recruitment centre has ask that I get a FFI for regular absorption how am I suppose to get this cuz when I ask the staff at the MO they mention that it can't be book like the normal FFI appointment "
    },
    {
      "post_id": 74,
      "title": "Reservist pay if taking off/mc",
      "author": "MrKabowski",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m5mzqg/reservist_pay_if_taking_offmc/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-21T16:06:55Z",
      "flair": "Question",
      "post_text": "Currently doing high key. Took 1 day off for personal matter. Will i still receive pay for the day i took off? Company is registered so they pay me directly instead of service pay + make up pay. Will i be expecting the same salary next month or will they prorate 1 day off?"
    },
    {
      "post_id": 75,
      "title": "Tell me everything I should know if I were to sign on as a female",
      "author": "lazyleopard21",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m5kh7y/tell_me_everything_i_should_know_if_i_were_to/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-21T14:31:36Z",
      "flair": "Question",
      "post_text": "Hi I am 17F and I have been recently interested in the idea of signing on! For context, I am set to complete my International Baccalaureate Diploma in November 2026 so I have been thinking about what I’d like to pursue thereafter. I have been volunteering for National Day and though I’m aware that its a display of the more glamorous aspect of our nation’s defence, it has piqued my curiosity regarding a career in the army/airforce. If I choose to not sign on, I will likely pursue a PLE degree or law at the tertiary level. I have no brothers and my father attended NS awhile ago, so it would be great if I could get some answers to my questions 😊\n\n1.\t⁠If I were to sign on, should I apply for university first, then sign on via the Mindef website, if no, what is the proper pathway I should take while approaching this?\n2.\t⁠In the 2 years of NS, what will I experience other than BMT?\n3.\t⁠As a girl, will I still be routed to NS vocations like NDU and Commandos/Guards?\n4.\t⁠Why should I not sign on? Do I have a better shot at a career in a private sector after uni?\n5.\t⁠Is it true that all girls in NS will be on track to SCS or OCS?\n6.\t⁠How worth it is the SAF scholarship?\n\n\nIf there is anything you think I should know or take as a precaution before signing on please let me know! It would be greatly appreciated as I’m still abit clueless 😂😓"
    },
    {
      "post_id": 76,
      "title": "waiting for PES status change",
      "author": "Sensitive-Lunch-8494",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m5i52o/waiting_for_pes_status_change/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-21T12:54:55Z",
      "flair": "Question",
      "post_text": "hi, i recently submitted my memo to the MO and the MO told me i would downpes to C9 due to my leg injury. any idea when the medical board review for this month(july) would take place and how long then would it take before my PES changes?"
    },
    {
      "post_id": 77,
      "title": "NSRO refuses to follow MO recommendation",
      "author": "Sally744",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m5htlq/nsro_refuses_to_follow_mo_recommendation/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-21T12:40:11Z",
      "flair": "Question",
      "post_text": "Recently downpes due to mental health and MO recommended a transfer to our of my unit but my unit’s NSRO refuses to do so and is giving a invalid and weak reason like being still eligible for the unit by its PES status which isn’t the point since that’s not the reason for MO’s recommendation for a transfer out which has to do with the unit’s super toxic culture. What else can I do other than the MINDEF safety hotline? "
    },
    {
      "post_id": 78,
      "title": "Is it possible to report NDP food?",
      "author": "pratathambi",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m5gv4e/is_it_possible_to_report_ndp_food/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-21T11:54:01Z",
      "flair": "Question",
      "post_text": "In NDP and being provided food from Old Chang Kee, the food is so bad that most of us rather just not eat at all and do work empty stomach. Is there even a possibility of the food being reported because we do not even have cookhouse food indented as an alternative?"
    },
    {
      "post_id": 79,
      "title": "Tore my acl in 2023. What will my PES be?",
      "author": "No_Baker_4946",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m5fd1j/tore_my_acl_in_2023_what_will_my_pes_be/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-21T10:30:29Z",
      "flair": "Question",
      "post_text": "Tore my acl in 2023 and had a successful surgery in 2023 december. I have not been to physio in a long time and i have not “cleared” my physiotherapy. As of now, i am currently fully fit and i play football very often. I have my ns check up at the end of the year. What will my PES be?\nAlso, is my acl tear recorded in my history, and will they take into consideration about it at the ns check up?"
    },
    {
      "post_id": 80,
      "title": "Random question about berets",
      "author": "Vivid-Associate-5868",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m5ezqz/random_question_about_berets/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-21T10:08:51Z",
      "flair": "Question",
      "post_text": "Hi I recently ooced from my scs pro term( won't say which) due to injury and have recently received my beret. Am I still allowed to wear the beret since technically I earned it up to that point even though im ooced and probably will post to a non combat unit?\n\n\n"
    },
    {
      "post_id": 81,
      "title": "Army Safety Inspectorate ASI",
      "author": "tutukuehlover",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m5e7vl/army_safety_inspectorate_asi/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-21T09:21:02Z",
      "flair": "Question",
      "post_text": "Not NS related but does anyone knows where officers from this unit/dept will be located at? \n\ni.e. which camp can we find ASI? \n\nOr are they based at CMPB? "
    },
    {
      "post_id": 82,
      "title": "Regarding Make up Pay for reservist",
      "author": "XenonKirito",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m5cvyr/regarding_make_up_pay_for_reservist/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-21T07:55:48Z",
      "flair": "Question",
      "post_text": "I understand that normally for nondirect scheme, employer or HR is supposed to give a form to sign or they sign it but..\n\nDo they download it from the NS portal?\nDo they have to add the employee under something in Corp pass?\n\nSeems like my current employer/manager never done MUP for the other older NSmen colleagues before and only ask them to submit their own claims after they finished their cycle.\n\nThis is my 2nd reservist and seems like for non direct I still need to get my employer to help us submit another form again. Since the MUP never auto calculated.\nIs that correct??\n\n(Forgot to mentioned that I'm from SCDF/MHA)"
    },
    {
      "post_id": 83,
      "title": "Pes E reservist outfield?",
      "author": "Faglawd",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m4yhkm/pes_e_reservist_outfield/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-20T19:59:38Z",
      "flair": "Question",
      "post_text": "Recently got downgraded to pes E1 as NSman, am I still required to go outfield? CO and OC for reservist unit very garang because both extended past their required 10 cycles "
    },
    {
      "post_id": 84,
      "title": "Scared of having to retake BMT due to MCs",
      "author": "ViperTheKillerCobra",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m4ov1c/scared_of_having_to_retake_bmt_due_to_mcs/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-20T13:25:28Z",
      "flair": "Question",
      "post_text": "Kranji II E9 Stayout here. Out of the 21 available days for Phase 1, I’m headed into my 5th MC day bc I’m developing flu symptoms + high fever. \n\nI’ve heard somewhere you need 75% attendance to clear BMT and so far I would only have 76% if I book in for the remaining days. From experience, this is a genuine worry I should have? Or is it just paranoid?"
    },
    {
      "post_id": 85,
      "title": "Will I Get Posted to a Combat Vocation Before Seeing PCC?",
      "author": "Background_Sir8414",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m4nu40/will_i_get_posted_to_a_combat_vocation_before/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-20T12:34:54Z",
      "flair": "Question",
      "post_text": "\nHi everyone,\nI’m currently quite stressed and confused about my NS situation and hoping someone here might have gone through something similar or can offer advice.\n\nHere’s my situation:\n\t•\tEnlisted into Enhanced BMT as a PES B1 recruit (combat-fit)\n\t•\tAfter 5 days, I sought help from CareHub, then saw my MO, and received 3 days of Respite MC\n\t•\tWas later sent to IMH A&amp;E, received a memo, and submitted it to my unit\n\t•\tI was told I’ll be referred to PCC (Psychiatric Case Conference), but I’ve yet to get any confirmation on my appointment\n\t•\tCurrently, I’m:\n\t•\tAwaiting OOC\n\t•\tStill PES B1 (MO has not down-PESed me)\n\t•\tOn Light Duties (84 days)\n\t•\tExcused Stay-In (temporary)\n\t•\tExcused FLEGS\n\t•\tStill allowed to take Respite MCs when needed\n\nMy main concern is this:\nWill I be posted into a combat vocation unit before I get to see PCC or before they down-PES me? Since I’m still technically PES B1 and not officially downpassed yet, I’m really scared I might end up getting posted before proper psychiatric evaluation happens."
    },
    {
      "post_id": 86,
      "title": "sending outfield letter to my nsbf",
      "author": "matchahoney444",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m4n2t7/sending_outfield_letter_to_my_nsbf/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-20T11:54:21Z",
      "flair": "Question",
      "post_text": "hi guys does anyone knows how many days before the outfield must i send my letter to ensure he receives it when everyone else does too :”) im planning to send it via singpost smartpac myself "
    },
    {
      "post_id": 87,
      "title": "NSFIT settled, still need IPPT during ICT?",
      "author": "piping_hot_potato",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m4mqb3/nsfit_settled_still_need_ippt_during_ict/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-20T11:34:24Z",
      "flair": "Question",
      "post_text": "If let's say I completed all NSFIT sessions (plus one IPPT attempt) before my ICT, am I still required to attempt the IPPT in camp?"
    },
    {
      "post_id": 88,
      "title": "How are experiences with public psychiatrists?",
      "author": "Specialist_Safe4404",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m4ltru/how_are_experiences_with_public_psychiatrists/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-20T10:39:33Z",
      "flair": "Question",
      "post_text": "Hi there, has anyone saw psychiatrists from public hospital other than IMH for specialist memos or just consultations before? Gotta visit KTPH psychiatrists sometimes soon cuz private too expensive wondering if psychiatrists in government hospitals are generally nice and caring..... \n\nAny helps would be appreciated. Thank you! "
    },
    {
      "post_id": 89,
      "title": "Helping out fellow NSF in unit",
      "author": "Any_Constant2965",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m4lsu0/helping_out_fellow_nsf_in_unit/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-20T10:37:54Z",
      "flair": "Question",
      "post_text": "Throwaway account due to personal reasons\n\nRecently, I had a new 3SG that got posted into my unit, over the short time that I had with him, he has been consistently late, quarelling with superiors and not taking initiative to help around the unit(ie, taking rations,area cleaning)\n\nIm ok if he wants to keng and stuff, but he is making it everyone's problem, the unit is tired of him\n\nHe is going to take over me, and I feel that it is my responsibility to help him better adjust to his unit.I need your advice with this matter 🙏🙏🙏"
    },
    {
      "post_id": 90,
      "title": "Vocations for Recovery Company",
      "author": "DeepLord2472",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m4lb1p/vocations_for_recovery_company/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-20T10:05:52Z",
      "flair": "Question",
      "post_text": "I was informed that I'm posted to recovery coy. Anyone here has been posted to RCOY before and what vocation were you posted to after BMT?"
    },
    {
      "post_id": 91,
      "title": "What Commando Vocation should I pick",
      "author": "ConfusedWalrus69",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m4jzrc/what_commando_vocation_should_i_pick/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-20T08:39:35Z",
      "flair": "Question",
      "post_text": "Just got through my 2 weeks confinement and still feeling indifferent to CDO life, definitely not all sunshine and rainbows but at least the food was pretty good. \n\nAnyways, I've heard very little about the 5 vocations, (leaders/weapons/demo/medic/signals) so here I am.\n\nAlready decided against leaders cuz I know I ain't got that dawg in me. Matter of fact, I'm looking for the slackest most chaokeng job a commando can get, ironic I know. \n\nI live in the west, so stagmont camp (signals) is at the top of my list, appreciate if anyone could share their experience. Thanks 🙏 \n\n\n\n "
    },
    {
      "post_id": 92,
      "title": "Holding Area/Room (in SCDF) Queries",
      "author": "Remarkable-Bit-671",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m4jb0g/holding_arearoom_in_scdf_queries/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-20T07:54:04Z",
      "flair": "Question",
      "post_text": "Hello, does anyone know what are the odds/chances for someone that is currently in the midst of being downpes’d from B1 to C9 to be put in holding area after POP (which is like in 2 weeks time) or do they usually just straight away assign a frontline support vocation even when my down pes is processing? (Waiting for medical board to review)\n\nAlso, would like some intake on what’s the attire like to book in/out if I was to be placed in the holding area/room after POP while waiting for my down pes to be fully processed and given a support vocation? Is it smart 4 or? And do we get to wear admin attire when in camp after that like when walking around/going for lunch and etc\n\nWould appreciate if anyone here knows! 🥲"
    },
    {
      "post_id": 93,
      "title": "How to listen and not impose your opinions on someone",
      "author": "InformalTop5121",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m4d4n2/how_to_listen_and_not_impose_your_opinions_on/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-20T01:54:28Z",
      "flair": "Question",
      "post_text": "Maybe it’s just the way my unit functions but over my time in unit I’ve gotten really close to one of my specs cause we’ve had a lot of H2H talks in and outside of army, and he recently confided that his worried about life after army cause of his past education path but due to different beliefs every time we talk about this topic I always tell him don’t worry about it too much cause there’s not much he can do until Uni starts but to him worrying motivated him but I can tell it’s burning him out, he just doesn’t wanna admit it and so we always argue about it when the topic arises but other than that we get along fine (sometimes too well) \n\nAlso, he looks out for me in camp the most so I find it heartbreaking that I can help him and can only listen to him. So how do yall just listen and not do anything without feeling useless :/ btw im a Cpl and he’s not my buddy spec he just looks out for me on his own accord so technically its not really his job ? Cause there’s a spec to operator ratio and its 1:1 in my plt cause of how small it is"
    },
    {
      "post_id": 94,
      "title": "Going for a surgery for my ACL, possible to Up pes to join a combat unit",
      "author": "ACIDGOD47",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m41m65/going_for_a_surgery_for_my_acl_possible_to_up_pes/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-19T17:17:17Z",
      "flair": "Question",
      "post_text": "So my current pes is B4 and I've got permanent RMJ, excuse heavy load, excuse kneeling and squatting, as I have tore my ACL before national service, I have completed my BMT, and now I'm currently in a unit at Supply Base Central as a Supply Assistant (GE), Was wondering if after I done my surgery, and my knee is healed, is it possible for me to Up Pes and join a frontline combat unit like Guards. "
    },
    {
      "post_id": 95,
      "title": "How do emart credits work for nsmen?",
      "author": "NoAbility1842",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m41aws/how_do_emart_credits_work_for_nsmen/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-19T17:04:23Z",
      "flair": "Question",
      "post_text": "ORDed early this year, but really want to get more admin shorts. I was in the last batch that got issued the thick ones and really want to get more of the new ones after wearing like 2 pairs over the past couple of months. Is there a cap on how many I can buy? And will the credits still top up every year on my birthday? I may not have reservist due to my PES, vocation and unit"
    },
    {
      "post_id": 96,
      "title": "losing mass and feeling depressed",
      "author": "Present-Pack-6139",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m3z7ui/losing_mass_and_feeling_depressed/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-19T15:38:02Z",
      "flair": "Discussion",
      "post_text": "so to give context i gym and all blah blah so i do take note of how my physique looks\n\nanyways recently I took a pic of my physique and lo and behold i lost so much mass!\n\nit feels like my progress just reversed and went back to the good old days where i was a skinny stick ts pmo 💔🥀\n\ni dont really feel good about this\nit feels like a lot of my effort is wasted haha \n\nwith the lack of protein and lack of sleep i feel like my body is deteriorating every damn day \n\nanyone knows how to cope because i have a long way to go before i ord 😂😂😂"
    },
    {
      "post_id": 97,
      "title": "any ways to get saf laundry (or similar looking ones) outside?",
      "author": "Open_Childhood5395",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m3z7gx/any_ways_to_get_saf_laundry_or_similar_looking/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-19T15:37:34Z",
      "flair": "Question",
      "post_text": "camp laundry system kinda screwed up so uh trying to get my own laundry (especially blankets)"
    },
    {
      "post_id": 98,
      "title": "Signing on to C4X? Worth it or not",
      "author": "Fred-ss",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m3y4n1/signing_on_to_c4x_worth_it_or_not/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-19T14:52:05Z",
      "flair": "Question",
      "post_text": "Hi guys, I have yet to enter the force (waiting to be enlisted), but I am considering signing on to C4X since signing is best done during BMT, from what I have heard. I have read posts regarding signing on but they are about 3 years ago, so I'd like to gain a newer/fresher insight on the current state.  \n  \nLet me list out some of my concerns regarding signing on to C4X, hopefully any ex-regulars, current regulars of C4X, or even other vocation regulars could share their experience, stories or advice regarding this decision.\n\nPros:  \n  \n1. Sign-on bonus  \n  \n2. University tuition is paid for fully (this to me is somewhat of a concern, because my GPA will definitely not land me in NUS (yes I tried, my GPA (Dip in CyberSec) + Certs + Personal Projects + Extra-Curricular activities + Work Experience), SIT is my only hope. So if SIT rejects me, I would have no choice but to study private/overseas uni if I want to attain a Degree. My parents specifically told me that if I were to study overseas or private, I would be paying for the fees myself.  \n  \n3. Decent starting pay post uni (from what I heard about $5K base/starting pay for uni graduates), and will only increase with promotions. Not sure if there is risk pay for C4X.\n\n4. Career and Financial stability, in terms of, I won't just get fired out of nowhere. (Unless I make a serious mistake, and the fact that I can continue my position even after my bond ends)\n\n5. C4X aligns with my career path and studies, so I would assume that with the work that I would be doing in C4X, it would minimally provide me with beneficial knowledge/experiences/skillsets that are transferrable into the private sector, be it soft-skills or hard-skills.\n\n6. Regular pay during my 2 year mandatory service\n\nCons:\n\n1. 6 year bond, so when im out of SAF, im already 32. Meaning im tied to SAF for about the next 10-12 years or so, no room for regrets\n\n2. Heard about the toxic work culture regarding superiors and regulars, but im not sure if it is as rampant in C4X\n\n3. Potentially thrown into some sai kang BS role, which will provide me with absolutely nothing in value\n\n  \nFor some context, I don't really mind going through OCS to become occifer, if it is part of the requirement as a sign-onee then so be it.   \n  \nI have also worked at a private sector company before, doing cyber related work. It is just 9 hours a day x5 every week (office / WFH), I would be lying if I said that it wasn't a mixture of boring/super-stressful, I would say that (in my opinion), most of the full timers there are overworked, juggling 7 concurrent projects at once with super tight deadlines.\n\nEdit: Also how are leaves and holidays like? Am I tied to Singapore in the long run or can I take leave for travels etc. as well?"
    },
    {
      "post_id": 99,
      "title": "Worried I'm losing my bf while he's in NS",
      "author": "Fluid_Zombie_6197",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m3xi25/worried_im_losing_my_bf_while_hes_in_ns/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-19T14:24:59Z",
      "flair": "Discussion",
      "post_text": "Hi everyone! For context, my bf and I started our LDR since before he started NS (I'm from a different country), and we've visited each other IRL a few times. Our relationship has been stable and healthy for the most part.\n\nDuring BMT, he made a lot of effort to call and text me whenever possible and give a lot of assurance, even though his schedule was packed. During weekend book outs we could spend almost the entire time together, and I would listen to try to understand the NS workings since I myself am not from Singapore haha.\n\nFast forward to after BMT, he's in infantry and now spends almost 0 time with me. From my understanding he's around the same levels of busy as before, yet he spends much less time with me now. When confronted, he just told me that he has more friends and is getting along well with the sergeants, so he enjoys his time much more now with friends like ordering out and spending bookouts with them.\n\nThing is, he can go a full 24 hours without texting me, sometimes won't call, always saying it's past lights out by the time he's free. During weekends he spends more time going out with friends and family and doing tasks like getting a haircut or buying things he needs for NS. And whatever free time he has in between all of that goes to watching youtube or playing games. \n\nUsually, I wouldn't mind these things, but the change is so abrupt and sudden that it raises room for suspicion. He literally made an entire personality change within 1 week of entering infantry. Sometimes we're only spending 5 minutes per day talking to each other (text/call). And sometimes on weekends we may only spend 8 hours together (for sleep call - so we're not even talking).\n\nI considered he may be cheating. He told me once that he was envious of his other friends who got to go out on actual dates with their gfs during bookout on night/weekend (since we can't, I'm not in SG). But he's told me he has me as his lockscreen and all his platoon and sergeants know about us dating. He's also told his parents and siblings. I also don't think he has the balls to cheat to be honest. I have access to contact his closest friends and family to ask, but haven't in case I'm just overreacting.\n\nI'm overall just afraid that the lack of quality time may completely dwindle the relationship, especially as it is LDR where consistent communication is key. I think I myself may also start losing passion in the relationship as I spend so much more time on myself and my friends/colleagues compared to him. To me it almost feels like I have no boyfriend except for an hour a day, especially when my love language is quality time.\n\nAny advice/opinions would be great, especially from girlies who are also dating recruits!\n\nEdit: there are so many sickos in my DMs asking me if I wanna cheat on him. Get a grip bruhh 😭\n\nEdit 2: For clarification, I'm not in SG Uni and I'm working corporate from a different country. yes I'm older than him haha"
    },
    {
      "post_id": 100,
      "title": "Want To Attend A Concert in Nov",
      "author": "KiranCommander",
      "url": "https://www.reddit.com/r/NationalServiceSG/comments/1m3teza/want_to_attend_a_concert_in_nov/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-19T10:58:30Z",
      "flair": "Question",
      "post_text": "Pes E9 here, entering to God blessed BMTC SCH V this 19th Aug. I would love to get tickets for an upcoming concert in Novemember, it's at 8pm.\n\nSo uhm, any advice? Is it easy to get leave approve or no? Or if I'm a stay-out vocation do I need not to worry and it's just me overthinking everything? Thanks."
    }

]