[
  {
    "post_id": 1,
    "title": "Detecting my cat using my security cameras",
    "author": "Turbulent-Guest-4278",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mmyerj/detecting_my_cat_using_my_security_cameras/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-11T00:12:36Z",
    "flair": null,
    "post_text": "Is trying to detect my cat using my existing security cameras possible? \n\nI'm thinking of getting the camera feed training my own ai model that detects only my cat, or all cats so that I can find out before it escapes, I have an yard + open garage with a gate and a camera that covers the whole garage and yard"
  },
  {
    "post_id": 2,
    "title": "Security Camera Recommendations For Property",
    "author": "KingofNerdom",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mmwy1w/security_camera_recommendations_for_property/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-10T23:05:13Z",
    "flair": null,
    "post_text": "Looking for recommendations for a budget friendly security camera for a piece of property we are building on that currently lacks power/wifi. We have equipment on the property so we are looking for something that can locally record with battery power and would be preferable if it either has solar power built in or the option to add to it would be nice as well. Should also note we'd rather not have to use cellular either, we aren't really concerned with being able to access it remotely, Just that it can capture decent video with motion detection and a decently wide view. "
  },
  {
    "post_id": 3,
    "title": "I'm tired of Reolink.",
    "author": "ThomasBP81",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mmoiye/im_tired_of_reolink/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-10T17:28:50Z",
    "flair": null,
    "post_text": "We have some Reolink RLC-822A cameras, and 3 out of 4 produce blurry images (Out of focus), with none of them having autofocus enabled.  \nThey are set to manual focus, and I have to go in and adjust the focus on those 3 every 4–5 weeks. It’s so frustrating that they can’t just stick to the settings I give them.  \nThey are running the latest firmware… so now I’m actually considering switching to something else.\n\nCan anyone recommend a 2/4K camera that doesn’t have to be more expensive, and preferably an IP camera (wired)?"
  },
  {
    "post_id": 4,
    "title": "Best way to install camera on soffit",
    "author": "ExternalUpper8542",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mmgd5b/best_way_to_install_camera_on_soffit/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-10T11:40:21Z",
    "flair": null,
    "post_text": "Looking at getting some cameras and would like to install in a few areas near hardwired spotlights. Most non battery cameras that sync up easily via a app utilize a brick power adapter. What is the best way to conceal this if I will be mounting near the spotlights and pulling power from the junction boxes they are on? Attached a pic of the junction box and of soffit area similar to mine. Any input is helpful"
  },
  {
    "post_id": 5,
    "title": "Need camera for house",
    "author": "Soft-Juggernaut7699",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mm9amp/need_camera_for_house/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-10T04:25:34Z",
    "flair": null,
    "post_text": "Someone stole the internet cables from the side of my house. Then yesterday I got a internet box from fed x. Someone had used my address to set up internet .  I need to get cameras. Are there any from temu that I could buy that doesn't have computer or wifi needed. I only have a smartphone. "
  },
  {
    "post_id": 6,
    "title": "Apartment battery powered",
    "author": "Old_Tie628",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mm4gwg/apartment_battery_powered/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-10T00:17:31Z",
    "flair": null,
    "post_text": "New to the community and was wondering what would be the best and easiest to work with. I don’t know if all need subscriptions for certain things, but preferably a decent bang for buck subscription if it’s needed. Nothing to specific needed just want to know what the best options are in certain price ranges!"
  },
  {
    "post_id": 7,
    "title": "Recommendations for security camera/nvr",
    "author": "Hackingmango",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mluxhb/recommendations_for_security_cameranvr/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-09T17:21:41Z",
    "flair": null,
    "post_text": "Hello\n\nIm trying to help my father find a security camera system but im having trouble finding good ones/unsure what is good.\n\nHe needs to have some sort of app or ability to view on his smartphone. Iphone/androird capability\n\nHe will need outdoor cameras that have good night vision as it is very dark where he is at night.\n\nAs well as 2 way audio and live video for deliveries and such as he has trouble walking fast.\n\nAnd to make it better i need it to be nvr compatible so i can have it locally in his home.\n\nPreferabbly on wifi for easier setup but not necessary\n\nNo subscription as well.\n\nAny suggestions would be great thank you all."
  },
  {
    "post_id": 8,
    "title": "Does ambient light help at all in IR night mode?",
    "author": "david_ph",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mlngqo/does_ambient_light_help_at_all_in_ir_night_mode/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-09T11:46:39Z",
    "flair": null,
    "post_text": "I have an outdoor camera paired with a separate 30 watt LED flood light.  I'm able to get color imagery all night, but it's not as clear as it is during the day.\n\nIf I switch to IR mode on the camera at night (built in IR), it is crisper and clearer vs. the color image with the flood light.\n\nI'm wondering, does the ambient light from the flood light have any effect in IR night mode?  Or it's completely filtered out?\n\nAlso, what do you think is preferred at night?  Well lit color, even if it isn't as sharp, or black &amp; white IR?"
  },
  {
    "post_id": 9,
    "title": "Trying to reset Hikvision DVR password - don't have the GUID file or key. Help!",
    "author": "BreakfastAntelope",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mljlew/trying_to_reset_hikvision_dvr_password_dont_have/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-09T07:33:12Z",
    "flair": null,
    "post_text": "I recently bought a house, and the previous owners left behind a Hikvision DVR system. I'm trying to access it to change parameters and update the clock, but I don't have the password.\n\nWhen I tried to use the iVMS software on my Mac to reset the password, it was asking for a GUID file or a key. Since I'm not the original owner, I have neither.\n\nHas anyone dealt with this situation before? What are my options for a password reset without the GUID file? Is there a physical reset button on the DVR itself?\n\nAny advice would be greatly appreciated! I'm hoping to avoid a full factory reset if possible, but I'm willing to do it if that's the only way.\n\nThanks!"
  },
  {
    "post_id": 10,
    "title": "Reliable home security/monitoring system...does one exist?",
    "author": "Friendly-Mammoth494",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mlfq2s/reliable_home_securitymonitoring_systemdoes_one/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-09T03:46:01Z",
    "flair": null,
    "post_text": null
  },
  {
    "post_id": 11,
    "title": "Home security cameras",
    "author": "Mexhai",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mlccg3/home_security_cameras/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-09T00:57:46Z",
    "flair": null,
    "post_text": "What are some good quality cameras we can put around our house ?"
  },
  {
    "post_id": 12,
    "title": "ZOSI IP info",
    "author": "Longjumping-Ball8942",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mktcbt/zosi_ip_info/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-08T12:04:00Z",
    "flair": null,
    "post_text": "Hi I have the model ZR08JP network video recorder with 4 C199/c199 pro cameras. (not sure wish any more) The recorder has died after 3 years, and I would like to try to set the cameras up to be viewed on my Has anyone the IP address, subnet mask, and port number that the recorder came with right from the factory? I would like to set up a work station just for the cameras. Any help here would be great."
  },
  {
    "post_id": 13,
    "title": "Many Cheap Cameras vs. Few Expensive Ones",
    "author": "HappyPoodle2",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mkqejw/many_cheap_cameras_vs_few_expensive_ones/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-08T09:14:08Z",
    "flair": null,
    "post_text": "For residential use, I find that in most cases, the cameras will either be very close to a choke point or I just want a camera to get an overview of what is going on. \n\nI have a 4K Hikvision one, which is great, but it looks dystopian. I then found much smaller no-name cameras for around 20-30$ that are 2K, but I can get 6 of them for the price of the 4K one. \n\nAm I missing something or does it make more sense to place several smaller, cheaper cameras than a few very high quality ones?"
  },
  {
    "post_id": 14,
    "title": "Reliability",
    "author": "meogma",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mkncxn/reliability/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-08T06:00:34Z",
    "flair": null,
    "post_text": "I had Nest cameras a few years ago but due to a billing issue they refused to resolve I gave that brand up in favor of Ring. Horrible mistake. I hate Ring. I don't know if I should go back to Nest or go with something else. I asked chatgpt what were the top 3 most reliable battery operated security cameras. It said Eufy 3 (S330), Reolink Argus 3 Pro and the Arlo Pro 5S 2k. I'm not particularly impressed by the reviews for any of them. Is there a decently reliable battery operated camera out there? \nMy Ring missed 4 events today. I can't deal with this anymore. "
  },
  {
    "post_id": 15,
    "title": "Yi Camera",
    "author": "Chance_Education6512",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mkm8mi/yi_camera/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-08T04:55:21Z",
    "flair": null,
    "post_text": "I am pet sitting and the house is covered in YI brand cameras, including the room I am sleeping in (camera is mounted on the wall so I can’t just unplug it.) Is there a way to tell if it is being viewed in their app, such as a light coming on or a noise? Or any kind of indicator? Didn’t find anything about that on the website. Thank you! \n"
  },
  {
    "post_id": 16,
    "title": "Need Recommendations!",
    "author": "Wooden_Physics7150",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mkl6xq/need_recommendations/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-08T04:00:04Z",
    "flair": null,
    "post_text": "Hello, Im in canada and live in a what I thought was a safe area, but lastnight my truck got rifled through and out garage was open 6 inches.\n\nThere is a tree in our yard id love mount a security camera onto but it needs to be wireless! And preferably under $150 CAD, does anyone have any recommendations?"
  },
  {
    "post_id": 17,
    "title": "Aosu 5MP Ultra HD",
    "author": "Big_Bare11",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mkl5wu/aosu_5mp_ultra_hd/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-08T03:58:36Z",
    "flair": null,
    "post_text": "I’m looking to get my very first Doorbell camera but I’m notsure which to get.\nI see online amazing reviews on this camera as the camera quality seems to be excellent and what is a positive (for me) is that there is not a monthly subscription.\n\nWhat I am looking for as well is 24/7 recording as If I need to rewind a few minutes/hours to see what is going on near my house, does this doorbell camera allow that?\n\nIf not, which doorbell camera would?\nI’m in Canada.\n\nThanks!"
  },
  {
    "post_id": 18,
    "title": "Help with cam recommendation!",
    "author": "brox121",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mkb18x/help_with_cam_recommendation/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-07T20:25:57Z",
    "flair": null,
    "post_text": "I recently installed the AOSU Solar Max wi-Fi camera system on my house. I really liked it and had success with the motion activation settings. I ended up returning it because I really wanted a camera system that sends announcements via Alexa and I did not realize that those cameras would not do that.\n\nNext, I purchased the Reolink, Argus Eco ultra solar camera kit. The physical build quality of this kit is impressive, however, the connectivity is lacking. I have also had problems with motion detection many times several of the cameras failed to notify of motion. I also have one camera in particular that sends notifications when cars pass, even after I have disabled vehicle detection and set Where I want motion detected. I had really high hopes for this kit, but was let down.\n\nSo, my question is, what are your recommendations for a Wi-Fi camera system that offers the following features:\n\nSet of at least 4\nSolar charging \nAI detection  (people, vehicle, animal)\nAlexa announcements\nNo subscription \n4k (does not necessarily have to be, but I would prefer it)\nExpandability for more cameras in the future \nPrice right around $500\n\n**(Considering the Eufy S330 (Amazon has $200 off coupon))"
  },
  {
    "post_id": 19,
    "title": "Bosch Camera Login Issue?",
    "author": "OneCroissant",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mkammz/bosch_camera_login_issue/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-07T20:10:30Z",
    "flair": null,
    "post_text": "I have a set of Bosch cameras that are letting my laptop login to them. But only my laptop, which set the password. I am remotely logged into the server I am trying to attach them to, but I keep getting a \"Login failed: Wrong user name or password.\" notification when I try to login. Even when I set the password, then copy and paste it across the two computers, trying to remove the human element of error from my typing. Is there anyone familiar with this issue that could help me log into these cameras, and hopefully attach them to my Genetec system? "
  },
  {
    "post_id": 20,
    "title": "Nextiva S1808e Encoder - Accessing Cameras?",
    "author": "bbestvin",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mk8ux4/nextiva_s1808e_encoder_accessing_cameras/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-07T19:02:44Z",
    "flair": null,
    "post_text": "Hello, I'm trying to support a very old camera encoder, the Nextiva s1808e.  It currently has two cameras connected to it, but I'm unsure how I can configure those cameras directly.  I can get to the encoders \"web configuration\" page using the IP address, but from there I cannot change much about the connected cameras.  I would even just like to see the Camera model information if possible!  The one camera connected is constantly panning and zooming in a pattern, so I'm thinking that was setup years and years ago.  I have no idea how to modify that if I wanted to!  Any suggestions?"
  },
  {
    "post_id": 21,
    "title": "Cover for Light Bulb Camera?",
    "author": "Financial-Isopod-703",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mk27q3/cover_for_light_bulb_camera/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-07T14:53:14Z",
    "flair": null,
    "post_text": "Hi everyone! \n\nJust finished setting up a bulb camera. I’ll attach a picture of the specs. \n\nI live in an apartment and I had to unscrew the cover to the lightbulb to access the socket to put the camera in it. Everything’s working smoothly, but now it’s pretty obvious (in my opinion) that a camera is there. To me, that kinda defeats the purpose. I got this camera from the YWCA to help protect myself from an abuser. I would hate for him to see it up there and damage it. \n\n\nAnywho, do yall have any recommendations for a cover of some sort? Do they have something like that? Of course whatever it is needs to be the kind of material that the camera can still see out of. My brain is thinking along the lines of a 2- way mirror/window of some sort, but I don’t know how to find that on Amazon 🤣\n\nAny advice would be appreciated! Thanks!!"
  },
  {
    "post_id": 22,
    "title": "Compromised Sibel NVR",
    "author": "Sintek",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mk1xys/compromised_sibel_nvr/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-07T14:42:45Z",
    "flair": null,
    "post_text": "My network kept getting flooded and take offline.\n\nI discovered that my Sibel NVR NVR-SB8ME-8P has some malware or something on it that is sending data out to unknown wierd IP addresses that come back as malicious. I set the network setting to a different DNS [9.9.9.9](http://9.9.9.9) to see if that help but, the packet captures still show the malware is using [8.8.8.8](http://8.8.8.8) to reach out to bad URL and IP's\n\n  \nI have tried to factory reset the NVR to see if that would wipe the hack, but that didn't work.\n\nDoes anyone know how this would have been accessed where I can get onto the system and remove it?\n\nI think it was exposed directly to the internet for a few weeks and that's how it got compromised"
  },
  {
    "post_id": 23,
    "title": "Can anyone help me find a security camera that uses 5G cellular? They all seem to be 4G. I don't want a Wi-Fi camera, must be cellular.",
    "author": "Saildirt",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mk0kr9/can_anyone_help_me_find_a_security_camera_that/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-07T13:47:50Z",
    "flair": null,
    "post_text": "Need a 5G cellular camera, not Wi-Fi.\nBeen searching and having a hard time finding any. Thanks in advance for any suggestions.\n\nTo further clarify, my business partner bought an additional line for his family plan and received a SIM card from AT&amp;T. \nThe SIM card works in my telephone, no problem. \nDoes not work at all in the camera. Camera works just fine with my T-Mobile SIM card.\n\n\nEDIT:\nGuys, thanks for all the help.  Changing the APN did it.\nFinally had time to work on this today, and figured it out.  \nYou have to force the APN to be NEXTGENPHONE to make it work with 4g only,\nThe default on the new AT&amp;T sim card is ENHANCEDPHONE which works with 5g.\nthis is the camera by the way:\nhttps://www.amazon.com/dp/B0BD7JQXBB?psc=1&amp;ref_=cm_sw_r_cp_ud_ct_AW892582FF1V6ST6NHF3\nAll is working now, thanks again!!"
  },
  {
    "post_id": 24,
    "title": "I need a cheep but reliable security camera with motion detection and ability to save videos, any recommendations? (That ships to Italy)",
    "author": "MinaCiclamina",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mjt13m/i_need_a_cheep_but_reliable_security_camera_with/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-07T06:52:30Z",
    "flair": null,
    "post_text": "Hello, next month I will be moving in with some people I don’t really trust so I wanted to put up a camera in my bedroom for security. It doesn’t really need great quality for the image, but I wanted to be able to see if someone enters when I’m not there and to save any evidence if it happens.\nAny advice is welcome"
  },
  {
    "post_id": 25,
    "title": "Need help to monitor elderly father",
    "author": "Internal_Rooster_242",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mjmqa1/need_help_to_monitor_elderly_father/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-07T01:19:51Z",
    "flair": null,
    "post_text": "My dad lives in a community living setting. Ive come to not trust some of his \"roomates\" and until i get him into a different place i want a camera in his room. This will serve as security,  as well as a way for me to check in on him as he is a fall risk. I bought blink cameras (not knowing they don't record 24/7) so I'm looking for a reliable company,  and an affordable camera that records 24/7 as well as motion notifications, live viewing theough an app and 2 way auto. I will 100% pay for a subscription.  Just want it to work. It will have access to power, so no power bank needed. But wifi internet perfered. Thank you so much for giving your input.\n"
  },
  {
    "post_id": 26,
    "title": "looking for reliable security camera system",
    "author": "WoWGirlRPer",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mjffk1/looking_for_reliable_security_camera_system/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-06T20:17:01Z",
    "flair": null,
    "post_text": "hello community!\n\nanyone have any suggestion on a reliable security camera system that'll record audio uninterrupted, (maybe lower down ambience of the outside sounds city, etc, not sure if that sort of thing exist?), great night vision, records 24/7, and one that i can add more cams for different angles if needed. I think most, of not a lot, are standardized security cams comes with apps for you to download the videos or see your cams live. \n\n  \nI'm not sure if wired or wireless/wi-fi would be the best route (not sure of any of this, hoping some of you can shed light on which would be best to have) in case we lose internet, I'd like to have the security cams still recording. Please help &lt;3 thank you in advance.\n\n  \nnote: I'm not sure if i need to mention this; but looking for a home in the states (USA)"
  },
  {
    "post_id": 27,
    "title": "Suggestions for a SC that can withstand extreme outdoor heat?",
    "author": "Key_Drawer_3581",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mjc9d0/suggestions_for_a_sc_that_can_withstand_extreme/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-06T18:17:17Z",
    "flair": null,
    "post_text": "I'm new to the Security Camera market, please bear with me if I forget any other requirements: \n\nI'm looking for a wired (POE?) system with no subscription obligations. I plan on having at least 2 exterior cameras **and** a doorbell camera, along with about 2 indoor cameras. \n\nI live in a very hot place with extremely long summers (over 44C on average for over 4 months). I'm open to all suggestions in most price ranges (nothing commercial) as long as it's good quality."
  },
  {
    "post_id": 28,
    "title": "Where should I put PTZ cam",
    "author": "Bettering-Myself1",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mj8wnw/where_should_i_put_ptz_cam/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-06T16:11:33Z",
    "flair": null,
    "post_text": "Will be replacing a Hikvision PTZ  (in pic) with a Ubiquiti PTZ. The Ubiquiti does not have ceiling/soffit mount option, only wall or pole option. It will cover a large open backyard. \n\nI have access to anywhere behind the brick wall above the second floor window. \n\nShould I install high up at the flashing or lower onto the brick wall? Should I keep it high up or as low as possible (above the window)? I do want it to surveil the second floor patio to the left in the picture. "
  },
  {
    "post_id": 29,
    "title": "AOSU Playback help",
    "author": "Lolitayaya1",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mj63is/aosu_playback_help/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-06T14:25:38Z",
    "flair": null,
    "post_text": "does anyone have an AOSU security cam? I just bought one and can’t seem to playback events past an hour. I upgraded to the Basic Plan and still cannot see past events. I’ve put an SD card in it as well, I believe it’s a 32GB.\n\nthanks! "
  },
  {
    "post_id": 30,
    "title": "Which security cameras do u guys recommend?",
    "author": "ThrowRAtemporaryday",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mj56d8/which_security_cameras_do_u_guys_recommend/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-06T13:48:50Z",
    "flair": null,
    "post_text": "Or which ones do u have? What prices? I've been looking but I'm not sure which are better. I saw some window ones on tiktok and I kind of like those but idk if I'm able to keep the recordings in a cloud or something. I just need about 2 with night vision and audio and that I can watch from my phone. "
  },
  {
    "post_id": 31,
    "title": "Power cables for dome?",
    "author": "Otomotu",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mj2fr0/power_cables_for_dome/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-06T11:46:59Z",
    "flair": null,
    "post_text": "Hello, sorry I am a bit new to the electronics, especially  when it comes to the wiring and powering.\nCan someone explain me how to power up this hikvision mini dome? As I understand I need add power cable I just don't know wich cable I need to and where to connect.\nThanks"
  },
  {
    "post_id": 32,
    "title": "Home security camera recommendations",
    "author": "eliitedisowned",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mj02hu/home_security_camera_recommendations/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-06T09:31:28Z",
    "flair": null,
    "post_text": "So I brought a house that had 2 eufy floodlight cam E which I liked as it saved me having to buy a whole setup. \n\nI went ahead and brought the homebase 3 in order to continuously record, turns out the cameras don't support that (that's on me should've checked but what a broken system)\n\nSo now I'm looking for alternatives. Should I keep going down the eufy security camera route with either cameras that take mains power or swap to an entirely different system.\n\nIdeally I'd like cameras to be mains powered and capable of 24/7 recording back to something (either through Ethernet or wireless) and has a good app. \n\nSo if anyone has any recommendations or thoughts on whether I should start over or simply stick with eufy, that would be greatly appreciated. Thanks. "
  },
  {
    "post_id": 33,
    "title": "YI cameras and their ads.Here is how to report them for pushing ads and making this security camera terrible for your peace of mind please read.",
    "author": "AltruisticTruck6884",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mix2le/yi_cameras_and_their_adshere_is_how_to_report/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-06T06:17:34Z",
    "flair": null,
    "post_text": "To report a potentially \"fraudulent app, you can file a complaint with the Federal Trade Commission (FTC). You can also report it to the Internet Crime Complaint Center (IC3), which is run by the FBI, if the scam involves online fraud. Additionally, the Better Business Bureau!!!!!!!!"
  },
  {
    "post_id": 34,
    "title": "Question about PoE switches",
    "author": "JustALittleBetter",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mij68j/question_about_poe_switches/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-05T19:42:26Z",
    "flair": null,
    "post_text": "Hello,\n\nI'm planning on installing an external home CCTV system using PoE cameras and a NVR.\n\nMy question is can I connect the cameras via ethernet to a PoE switch and then run a single ethernet cable to the NVR? Is it possible to run the switch powered by PoE without using an external power supply? I want to mount the switch in a waterproof junction box on the wall but getting external power to it will be really difficult.\n\n\nThanks"
  },
  {
    "post_id": 35,
    "title": "Outdoor LTE/Solar Solution - Recs?",
    "author": "locura79",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1miher2/outdoor_ltesolar_solution_recs/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-05T18:37:07Z",
    "flair": null,
    "post_text": "I need to install security cameras on a vacant tract of land with no power or internet access. Obviously, this means solar power and mobile internet. I have looked at the Tactacam Defend and the Reolink Trackmix but am open to other suggestions. I want something that will record video to the cloud at a high enough resolution to identify trespassers and that I can view as a live stream. I don't have a problem with paying for the LTE connection, but I would prefer to not have to pay a separate fee for each camera since I would like to install 2-3 cameras on the property. I'm completely out of my depth here and looking for complete recommendations (i.e., camera + power + internet solutions). Help?"
  },
  {
    "post_id": 36,
    "title": "How does everyone feel about Ring actively declaring that they will violate their client's privacy without a warrant?",
    "author": "PartnersInCrimePhoto",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1miaq4s/how_does_everyone_feel_about_ring_actively/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-05T14:28:29Z",
    "flair": null,
    "post_text": null
  },
  {
    "post_id": 37,
    "title": "Wireless security camera that records over itself on SD 24/7",
    "author": "Lunchbox6624",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mi8nze/wireless_security_camera_that_records_over_itself/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-05T13:05:19Z",
    "flair": null,
    "post_text": "I can't find anything! We manage an apartment complex and would like to install a camera in the parking lot. The only power options we currently have is to use a solar panel. We are looking for something basic that we can install high on a pole, powered by the solar panel, and records 24/7 locally to an SD card. Do these exist? I've looked at several different brands and can't find anything that makes sense. TIA!"
  },
  {
    "post_id": 38,
    "title": "Camera recommendations for wildlife recording and creating a large network",
    "author": "iheartinfinity",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mi1ahl/camera_recommendations_for_wildlife_recording_and/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-05T06:01:09Z",
    "flair": null,
    "post_text": "OK, so I have about 10 acres of ground at my house, I want to start adding cameras around the grounds to capture the wildlife, including cameras in the nests (birds, badgers, foxes e.t.c.) as well as other cameras posted around the forest/lake.\n\nI won't be able to budget for all the cameras straight away, so its important that I can add on in the future, as you would expect the cameras need to be battery powered/solar powered and some how a direct feed going into a PC in my home, which won't work over wifi as it won't reach, so not sure if there is a solution there.\n\nQuality wise, ideally 4K, ideally some camera options for thermal/night vision...\n\nIt sounds like I am asking for too much or the price is going to be insane, but any help would be appreciated. I noticed a person doing something similar uses Axis, but I am not sure how many boxes they tick and of course, they do seem expensive, but expected I guess."
  },
  {
    "post_id": 39,
    "title": "Looking for some advice",
    "author": "muffinnmannn",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mhyeht/looking_for_some_advice/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-05T03:22:46Z",
    "flair": null,
    "post_text": "likely asked a million times before, but this is just the easiest way. Ive found people are often receptive to offering their opinion on products. \n\nI don't know alot about cameras except there are millions of them with prices all over. we can start from a wyze. Cheap, works. But you can't get a plate from any distance. I need to get plates, a minimum of 40 yards? Night vision, no need for flood lights or sirens. ANd, this is the big and, NO subscirption, no paywall bullshit. I by a camera, I own it. Cloud storage and some extras is fine and maybe I will, but I will not be forced to. I want native control of footage. My dashcam BlackVue has a proprietary storage format and apps, but thats fine. I can download, control, cut, send anything I want. I recently found out none of that is possible with a wyze camera. \n\nI cant spend 600 dollars either. I can go around 200, and will even go used if the deal is right for a more expensive one. best referral gets Award!"
  },
  {
    "post_id": 40,
    "title": "Wireless camera with its own WiFi",
    "author": "Toddvg",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mhpoci/wireless_camera_with_its_own_wifi/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-04T21:02:16Z",
    "flair": null,
    "post_text": "I am looking for a Camera with a Wide angle lens that has its own WiFi.\n\nI want to be able to attach a battery pack to it, mount it anywhere. Use my IPhone to view proper angle/start &amp; stop recording to its SD card. I am not hiding it, but smaller would be better.\n\nSome places I mount it will not have internet and might not even have cellular service. Best case would be a camera that has it’s own WiFi (stronger the better) so it I am 100’ away or so I can view the camera and have complete control of it’s settings."
  },
  {
    "post_id": 41,
    "title": "Wyze banned me again, permanently; for suggesting a brand that doesn't paywall built-in features.",
    "author": "TekWarren",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mhms6i/wyze_banned_me_again_permanently_for_suggesting_a/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-04T19:14:05Z",
    "flair": null,
    "post_text": "Title. I guess they are fully invested in this tactic now. Silence anyone suggesting other brands that don't make you pay subscription fees to get the full use out of products purchased. Screenshot of comment didn't even even say anything bad about Wyze, they just know they are scamming people and this is how they keep trying to \"hide\" it."
  },
  {
    "post_id": 42,
    "title": "Help with camera positions",
    "author": "Proper-Flounder-3786",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mhh2rl/help_with_camera_positions/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-04T15:47:37Z",
    "flair": null,
    "post_text": "I'm going to upgrade my spotty wifi cameras with PoEs and an NVR. \n\nI'm just not sure how many cameras I need or where to place them to ensure 360 degree coverage. [Here's my house](https://ibb.co/cS18L021) \\- I'd really appreciate it if anyone could help with suggested camera mounting locations."
  },
  {
    "post_id": 43,
    "title": "What's the least I should expect to pay for a decent, not necessarily great, 4K outdoor WiFi home camera, both fixed and PTZ, that doesn't only work with their proprietary software or app?",
    "author": "RaplhKramden",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mhh0f3/whats_the_least_i_should_expect_to_pay_for_a/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-04T15:45:14Z",
    "flair": null,
    "post_text": "I'm mostly ok with our 1K &amp; 2K WiFi cameras, but better resolution would be nice, to make out license plates and peoples' faces such. Perhaps even more important is that it work with 3rd party camera software, using RTSP and such.\n\nWhat's the least that I can expect to pay for a new one that's worth buying? I've seen ones as low as $50, but I assume that they're crap and only work with their proprietary app, which based on my experience is really limiting, like you can't review recorded footage on your PC at faster than 2x speed."
  },
  {
    "post_id": 44,
    "title": "needing 24 cams for a warehouse",
    "author": "Curious_Party_4683",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mhapd5/needing_24_cams_for_a_warehouse/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-04T11:20:46Z",
    "flair": null,
    "post_text": "does not have to be the best money can buy. \n\nthis should be good enough from Reolink right?  [https://www.amazon.com/REOLINK-Security-Surveillance-Detection-Recorder/dp/B0B5XGXCNP](https://www.amazon.com/REOLINK-Security-Surveillance-Detection-Recorder/dp/B0B5XGXCNP)  \n\nkit comes with 32 cams so i will keep the 8extras as spares...."
  },
  {
    "post_id": 45,
    "title": "Security camera that doesn't get washed out at night by street light etc.",
    "author": "JMVNYC",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mh7lpx/security_camera_that_doesnt_get_washed_out_at/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-04T08:09:49Z",
    "flair": null,
    "post_text": "\n\nI'm trying to figure out what's going on with a property of mine in Manhattan. There's a small outdoor area that keeps getting opened or possibly broken into—I’m not sure if it’s people or animals. It’s nothing valuable, just a basement window, but it’s happening repeatedly, and it's driving me crazy.\n\nI have a camera on it, but at night, the image gets completely washed out. The alley light and the basement interior light blow out the picture, so I can’t make out any details. I’ve turned off the camera’s IR and status lights, and it’s pressed against the glass. During the day, the image is fine. At night, it’s useless. I don’t want to stay up all night watching it—I just need to capture what’s happening.\n\nIs there a Wi-Fi camera that won’t get blown out at night through a window? Zoom would be great (optical preferred), but not critical. I just want a clear image so I can finally get to the bottom of this. \n\nFor reference, I've tried several Wyze and Reolink cameras with limited success. The quality just isn't good. I'm ready to spend some serious money. I use the Ring ecosystem for my smart home devices—are there any good indoor cameras?\n\nOh, and mounting a camera outside isn't an option - it's about 100 feet from my window, and between my window and the garage basement, there's a public alley."
  },
  {
    "post_id": 46,
    "title": "Moving to Platinum Shavano Oaks Apartments And just found out there is a peeping Tom terrorizing women. FML",
    "author": "momsvaginaresearcher",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mh5wb7/moving_to_platinum_shavano_oaks_apartments_and/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-04T06:19:41Z",
    "flair": null,
    "post_text": null
  },
  {
    "post_id": 47,
    "title": "Anyone know what this security camera brand and model is?",
    "author": "OkContext2161",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mh596e/anyone_know_what_this_security_camera_brand_and/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-04T05:40:27Z",
    "flair": null,
    "post_text": "Just moved into a home and found these existing security cameras installed. The seller was a real estate company and didn’t have any info about them.\n\nI’m planning to replace them with Ring PoE cameras, but identifying the current camera model would help me figure out how (or if) I can reuse the existing wiring. Any help would be appreciated\n\nhttps://preview.redd.it/3i0ubn6rwxgf1.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=acdb4092009d6231056bcd68ca1d1040feab058d\n\nhttps://preview.redd.it/wbtw2j1vwxgf1.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=9cf454a19c75af43acc370d41dbb78286807fc2c\n\nhttps://preview.redd.it/hsstza1ywxgf1.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=facfe19f119abe1d36074c6bbe290c5f6dbd6cb9\n\nhttps://preview.redd.it/in0guuaywxgf1.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=215e9ae90f3cc4fcdbb2ff36c0b1e8fed72742e9\n\nhttps://preview.redd.it/pygm83lywxgf1.jpg?width=2316&amp;format=pjpg&amp;auto=webp&amp;s=2ee5d7e73c1f31388d5b3b808930183057358d3a\n\n  \n"
  },
  {
    "post_id": 48,
    "title": "Ad and subscription free cameras",
    "author": "Putrid-Fig4166",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mgz4kf/ad_and_subscription_free_cameras/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-04T00:25:20Z",
    "flair": null,
    "post_text": "I've been using Yi/Kami cameras for years. Recently they added all these non-stop advertisements. It takes forever to open up the cameras now. They're offering a subscription but I don't feel comfortable with private video out in the cloud like that.  \n\nAny suggestions for ad/subscription free cameras to keep tabs on my elderly parents?"
  },
  {
    "post_id": 49,
    "title": "What is the best way to search videos ?",
    "author": "Pale-Tie-3691",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mgyo9r/what_is_the_best_way_to_search_videos/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-04T00:03:59Z",
    "flair": null,
    "post_text": "Got some videos to analyse and I m too lazy to watch it, what is your workflow to analyse videos? Are you using any software (cloud base or installed app) to do it ?"
  },
  {
    "post_id": 50,
    "title": "Wireless Security Cameras",
    "author": "PushPsychological967",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mgwh3x/wireless_security_cameras/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-03T22:24:57Z",
    "flair": null,
    "post_text": "I am looking for solar paneled cameras that I can mount high enough in the trees that my brother cannot find them or steal them! As unfortunately he has done many times in the past! I also do not have internet where I live, but I do have Internet on my phone! I'm wondering if there are any cameras out there I can access through my phone Hotspot or Bluetooth without a subscription! HELP PLEASE 🙏"
  },
  {
    "post_id": 51,
    "title": "Y Home Camera unusable now, best alternative?",
    "author": "montgolfier",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mgfhe3/y_home_camera_unusable_now_best_alternative/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-03T09:59:09Z",
    "flair": null,
    "post_text": "Hi all, had two Y home cameras for last few years which worked ok. Small clips for free is all we needed, now you can’t watch any recordings without a subscription so I’m looking for something similar \n\nAre there any budget cameras that record short clips without the need for a ‘cloud’ \n\nInterested in a budget camera doorbell also but not essential \n\nTIA"
  },
  {
    "post_id": 52,
    "title": "recommendations for a wireless camera?",
    "author": "Top_Blueberry9241",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mgbalt/recommendations_for_a_wireless_camera/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-03T05:28:51Z",
    "flair": null,
    "post_text": "I need a wireless indoor camera that we can mount or stick to our wall. Unfortunately it cannot have wires because we have two kittens who will chew on it. I’m having trouble finding something on amazon that doesn’t have crappy reviews. Any recommendations?"
  },
  {
    "post_id": 53,
    "title": "Sd card for security camera 2 3 hrs backup",
    "author": "Turbulent_Light_2538",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mg18u0/sd_card_for_security_camera_2_3_hrs_backup/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-02T21:03:53Z",
    "flair": null,
    "post_text": null
  },
  {
    "post_id": 54,
    "title": "Camera options?",
    "author": "JustTrying2Survive22",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mfga2w/camera_options/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-02T03:22:03Z",
    "flair": null,
    "post_text": "I want to get a doorbell, a camera for my driveway, backyard, a pet cam, and a camera to watch my Gecko (bonus if they do time lapse but not necessary) \nThis is obviously a lot of cameras. I want them to be under the same subscription and I don’t want to pay a crazy amount a month. Or a crazy start up fee. I don’t need the best of the best. Just decent any suggestions? "
  },
  {
    "post_id": 55,
    "title": "Outdoor Security cameras for my business",
    "author": "AdmirableAd2440",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mfdk3q/outdoor_security_cameras_for_my_business/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-02T01:03:34Z",
    "flair": null,
    "post_text": "I was previously using the Cobra surveillance with 4 cameras and they have worked very well even during hurricanes however recently the dvr won’t turn on anymore so I’m looking for something similar or even better if possible at a affordable price, the ones I had were around $300 and something so something around that price range would work. \n"
  },
  {
    "post_id": 56,
    "title": "Front-door Camera Recommendations",
    "author": "PianoMelodic3297",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mf8z0l/frontdoor_camera_recommendations/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-01T21:34:39Z",
    "flair": null,
    "post_text": "Hi, looking for some recommendations that best fit this situation. My grandma's security camera at her front door broke so I need a replacement for it.\n\n**Details:**\n\nI need a budget security camera (below $50) that wire will extend to her monitor (about 15-20 feet from the door) and show live feed on it. her original one was in black and white so no preference on that. I don't mind buying a extention cord, just don't want someone able to unplug it from outside. thank you."
  },
  {
    "post_id": 57,
    "title": "Is it possible to view cameras remotely using a LAN?",
    "author": "WishboneTemporary232",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mf752u/is_it_possible_to_view_cameras_remotely_using_a/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-01T20:20:23Z",
    "flair": null,
    "post_text": "I like the idea of setting up my NVR on my local network with no internet connection.\n\nMy concern is not being able to use the NVR app to view the feed wirelessly on a smartphone. \n\nDo I have any options here?"
  },
  {
    "post_id": 58,
    "title": "Looking for dual-lens camera and NVR to start a new setup with, moving away from Yi cameras",
    "author": "gislands",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mf3djv/looking_for_duallens_camera_and_nvr_to_start_a/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-01T17:54:51Z",
    "flair": null,
    "post_text": "Hi all, I have been lurking and reading for about the last week and am interested in getting a dual lens camera and an NVR to start with to begin a hardwired POE setup. I most likely will add more cameras down the road. Right now I have eight Yi cameras, I know about all the issues and the ads on the app, part of the reason I am moving on. That being said, I guess I'd lean towards an eight-port NVR. I have been looking at Hikvision and Amcrest products primarily, so to give you a sense, I am looking to spend $600-$800 or so on both the NVR and a dual-lens camera. I am looking to monitor about 50 feet of area on the front of my house by a garage and have it shoot out about 100 feet past the driveway into the street.\n\nThe question I have right now is about the Amcrest dual lens cameras on Amazon. One comes in at $400 and is 8MP per lens, and the cheaper $180 one appears to be 4MP per lens. Oh, and the $400 one has 131 feet of night color while the $180 one has 65 feet of night color. I am not sure if that is worth the extra $220, including twice the megapixels, or if that is a gimmick. Below are the links to the two cameras.\n\nAlso, I am pretty open to other brands, and to be honest, I have no real idea about NVRs and whether more expensive ones offer features worth the extra cost. All I know is some require you to buy an HDD, and some have them installed.\n\nMy main focus in this system would be ease of monitoring from an iPhone. I have had enough of watching goofy ads on the Yi app. I even tried to toggle off the personal ads, but I still seem to get them. Oh, and something from a brand that has a good reputation and products, as I can see myself replacing the rest of the Yi cameras in the future. The camera in my front is the one I look at probably 95% of the time, so that is the top priority now.\n\nI am open to everyone's opinion and expertise. This is a really interesting subreddit, and I have enjoyed all the information that is posted. Thanks in advance. G  \n  \n[$400 Amcrest Dual-Lens](https://www.amazon.com/gp/product/B0C9F5XK7D/ref=ewc_pr_img_3?smid=AM1AKWRN957PC&amp;psc=1)\n\n[$180 Amcrest Dual-Lens](https://www.amazon.com/gp/product/B0D2SB4CCS/ref=ewc_pr_img_4?smid=AM1AKWRN957PC&amp;psc=1)"
  },
  {
    "post_id": 59,
    "title": "Looking for dual-lens camera and NVR to start a new setup with, moving away from Yi cameras",
    "author": "gislands",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mf3b1j/looking_for_duallens_camera_and_nvr_to_start_a/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-01T17:52:11Z",
    "flair": null,
    "post_text": "Hi all, I have been lurking and reading for about the last week and am interested in getting a dual lens camera and an NVR to start with to begin a hardwired POE setup. I most likely will add more cameras down the road. Right now I have eight Yi cameras, I know about all the issues and the ads on the app, part of the reason I am moving on. That being said, I guess I'd lean towards an eight-port NVR. I have been looking at Hikvision and Amcrest products primarily, so to give you a sense, I am looking to spend $600-$800 or so on both the NVR and a dual-lens camera. I am looking to monitor about 50 feet of area on the front of my house by a garage and have it shoot out about 100 feet past the driveway into the street. \n\nThe question I have right now is about the Amcrest dual lens cameras on Amazon. One comes in at $400 and is 8MP per lens, and the cheaper $180 one appears to be 4MP per lens. Oh, and the $400 one has 131 feet of night color while the $180 one has 65 feet of night color. I am not sure if that is worth the extra $220, including twice the megapixels, or if that is a gimmick. Below are the links to the two cameras.\n\nAlso, I am pretty open to other brands, and to be honest, I have no real idea about NVRs and whether more expensive ones offer features worth the extra cost. All I know is some require you to buy an HDD, and some have them installed. \n\nMy main focus in this system would be ease of monitoring from an iPhone. I have had enough of watching goofy ads on the Yi app. I even tried to toggle off the personal ads, but I still seem to get them. Oh, and something from a brand that has a good reputation and products, as I can see myself replacing the rest of the Yi cameras in the future. The camera in my front is the one I look at probably 95% of the time, so that is the top priority now. \n\nI am open to everyone's opinion and expertise. This is a really interesting subreddit, and I have enjoyed all the information that is posted. Thanks in advance. G\n\n[https://www.amazon.com/gp/product/B0C9F5XK7D/ref=ewc\\_pr\\_img\\_3?smid=AM1AKWRN957PC&amp;psc=1](https://www.amazon.com/gp/product/B0C9F5XK7D/ref=ewc_pr_img_3?smid=AM1AKWRN957PC&amp;psc=1)  \n[https://www.amazon.com/gp/product/B0D2SB4CCS/ref=ewc\\_pr\\_img\\_4?smid=AM1AKWRN957PC&amp;psc=1](https://www.amazon.com/gp/product/B0D2SB4CCS/ref=ewc_pr_img_4?smid=AM1AKWRN957PC&amp;psc=1)"
  },
  {
    "post_id": 60,
    "title": "SZSINOCAM QG4 camera is completely dead after pressing Reset + Power",
    "author": "vranica1337",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mf1uim/szsinocam_qg4_camera_is_completely_dead_after/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-01T16:57:11Z",
    "flair": null,
    "post_text": "Hello everyone,\nI have problem with my SZSINOCAM QG4 4G camera. I unintentionally pressed the Reset and Power buttons at the same time, after which the camera completely shut down and has not powered on since.\n\nAt the moment, the only sign of life is the red charging LED, which does turn on when I connect the device to a 5V/2A power source.\n\n"
  },
  {
    "post_id": 61,
    "title": "YI Home/Kami Cameras - Paywalled all recorded video?",
    "author": "fatalPORKshank",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mexvd9/yi_homekami_cameras_paywalled_all_recorded_video/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-01T14:24:41Z",
    "flair": null,
    "post_text": "This system usability seems to have been nosediving recently. Starting with all the annoying ads on app startup to now seemingly paywalling the motion-detect recorded clips. When I try to watch a recorded clip, instead of the video very slowly loading for playback, I get a \"*Subscribe to Kaim Cloud to unlock all detected video contents*\" message. I used to be able to view a 6-second clip without subscription and could subscribe for longer clips or additional detection features. \n\nIs ALL playback now behind a subscription?? Really?? "
  },
  {
    "post_id": 62,
    "title": "Best security Cameras for GTA Canada",
    "author": "Flimsy_Adeptness1506",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mevs5i/best_security_cameras_for_gta_canada/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-01T12:57:01Z",
    "flair": null,
    "post_text": "Looking to see what are some best and affordable cameras that everyone been using that doesnt need much maintenance like frequent batter changing or charging, with a good storage options."
  },
  {
    "post_id": 63,
    "title": "Install on a dividing fence panel legal in uk ?",
    "author": "ianncc",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mes784/install_on_a_dividing_fence_panel_legal_in_uk/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-01T09:47:07Z",
    "flair": null,
    "post_text": null
  },
  {
    "post_id": 64,
    "title": "How to Automatically Disable Camera Alarm When I'm Home?",
    "author": "crepuscopoli2",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1meregy/how_to_automatically_disable_camera_alarm_when_im/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-08-01T08:56:48Z",
    "flair": null,
    "post_text": "Hi there!\n\nI bought an Imou camera with alarm features including motion detection, lights, and notifications that are triggered when it detects movement. It's a great device, but I want it to work only during specific times (from night to morning) **and** only when I'm not at home. When I’m home, I want the alarm to be completely disabled.\n\nI managed to set up the time schedule using the app’s \"Schedule\" feature, but how can I make it automatically turn off when I’m at home?\n\nAny suggestions?"
  },
  {
    "post_id": 65,
    "title": "Outdoor IP Camera Installation Under Angled Eave",
    "author": "Itchy_Worry4226",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1me9mw5/outdoor_ip_camera_installation_under_angled_eave/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-31T18:37:41Z",
    "flair": null,
    "post_text": "This is my first post here, and I’m hoping to get some advice on installing security cameras. I saw another post on reddit with an image that’s basically the same setup I have, but the thread was closed without any clear answers.\n\nI’ve got a slanted eave and need to drop the camera about 6 to 7 inches so the view isn’t obstructed. I’ll be using bullet cameras and want the installation to look neat and professional.\n\nHas anyone dealt with this before? Any suggestions for angled brackets or poles that would work well for this kind of mount?"
  },
  {
    "post_id": 66,
    "title": "How the heck do I take this down?",
    "author": "kelirving2",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1me7nqv/how_the_heck_do_i_take_this_down/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-31T17:22:43Z",
    "flair": null,
    "post_text": "I want to replace this trash 2mp camera that came with the house, but have no idea how to take it down. \n\nI removed both side screws, tried spinning the camera out, and spinning the casing to no avail."
  },
  {
    "post_id": 67,
    "title": "I need one wired camera with a continuous feed",
    "author": "Particular_Ladder925",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1me4o9t/i_need_one_wired_camera_with_a_continuous_feed/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-31T15:30:10Z",
    "flair": null,
    "post_text": "I am looking to setup a camera in my store that can see the front door. I work in an office and cannot see the door directly, I just want to see someone walk in on a small monitor so I know when to get up. I do not need any video storage, just a live feed I can view from my desk without any subscriptions. Wired is fine, but if there is a wireless option I won't have to drill holes to feed cables for that would be nice"
  },
  {
    "post_id": 68,
    "title": "Why dahua camera lens are set in the wrong way!",
    "author": "Spirited_Wolverine59",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mdvgh1/why_dahua_camera_lens_are_set_in_the_wrong_way/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-31T07:50:03Z",
    "flair": null,
    "post_text": "Everytime i need to change the angle of the lens, you can move it down but only up! which doesn't make sense to me, or am I wrong?"
  },
  {
    "post_id": 69,
    "title": "Is this layout good",
    "author": "mvrdoesthings",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mdj4ye/is_this_layout_good/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-30T21:31:26Z",
    "flair": null,
    "post_text": "Blue are doors , and the long stripe is a glass door wall \n\nIm gonna go with \n\nreolink duo 3v Poe (the one in the garden)\n\nReolink rlc 820-a black (the one by my driveway)\n\nAnd I have a reolink cx820 but not shure where to mount it .. \n\n "
  },
  {
    "post_id": 70,
    "title": "24/7 recording indoor system",
    "author": "andytumbles",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mcy08u/247_recording_indoor_system/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-30T05:13:46Z",
    "flair": null,
    "post_text": null
  },
  {
    "post_id": 71,
    "title": "Recommendation needed for Android /iOS apps that support bidirectional audio over RTSP or ONVIF",
    "author": "lolololxdtz",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mcxwjy/recommendation_needed_for_android_ios_apps_that/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-30T05:07:54Z",
    "flair": null,
    "post_text": "I'm experimenting building my own camera but it comes that I cannot find a good client app that support this adequately already."
  },
  {
    "post_id": 72,
    "title": "Quick review: Set up the new Baseus S2 as a Fox/Badger Cam and captured this in the middle of the night",
    "author": "robbiekhan",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mcu2le/quick_review_set_up_the_new_baseus_s2_as_a/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-30T01:51:40Z",
    "flair": null,
    "post_text": "Impressed by the quality really, it's 4K and even the IR night vision is good, though I prefer colour so the spotlight gets used on motion detection.\n\nI've now got the N1 series, S1 Pro Solar (not as good), S1 Lite Solar (new, good) and this S2 which is also solar with sun tracking panel, both of these are good quality IMO but you do also need a Micro SD card whereas the S1 Pro has internal storage as well as SD card slot. The N1 series connect to the Home Hub which has internal storage and HDD/SSD enclosure. Only the older models need the Home hub, newer models connect directly to wifi and then the app/cloud for anytime access like Ring cameras.\n\nOverall I am impressed with the Baseus app, the functionality offers some unique things over Ring's app (I have the Video Doorbell Pro 2), but otherwise functions and feels the same level of polished as Ring's app, just with no cloud sub needed.\n\nI think for the price, can't go wrong really, long as your home WiFi connection is robust. For ref my router is a Linksys Velop MX4200 Mesh series, I only have 1 in the middle of the house, and that is reached by the S2 by the shed at the end of the garden, as well as the S1 lite upstairs."
  },
  {
    "post_id": 73,
    "title": "Non-PRC/Chinese entry level system",
    "author": "WishboneTemporary232",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mct5r6/nonprcchinese_entry_level_system/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-30T01:08:34Z",
    "flair": null,
    "post_text": "I'm looking for an affordable entry level camera system that is not produced by a Chinese company.\n\nAny suggestions?\n\n"
  },
  {
    "post_id": 74,
    "title": "swann max ranger 4k mini vs Eufy 4k range?",
    "author": "davidsparky122",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mcnil7/swann_max_ranger_4k_mini_vs_eufy_4k_range/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-29T21:04:20Z",
    "flair": null,
    "post_text": "I currently own 2x  Eufy 2c pro have them them for about a year now and the interface is very easy to navigate and no cost of using this also I have them plugged into external solar chargers and they have lasted this whole time without having to charge. However they are very limiting in detail and what you can see. I’m looking at the new swann max ranger 4k mini range. It’s cheap affordable and I’m keen to hear how these have held up for people? "
  },
  {
    "post_id": 75,
    "title": "Home System Reccomendations",
    "author": "Union-Lurker",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mcjf5k/home_system_reccomendations/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-29T18:30:09Z",
    "flair": null,
    "post_text": "Recently had a roommate relapse hard and suddenly vanish from the homestead. If you are familiar with users you may know that this means all my catalytic converters are on borrowed time.\n\nSecurity cameras have been on the to do list for a few years but everything these days seems like open internet cloud based systems. Ideally I only need to access one or two cameras on my home network and maybe have them record to my NAS. Is this something you can do these days or am I just an old head? \n\nThanks y'all"
  },
  {
    "post_id": 76,
    "title": "Recommendations for a continuous recording battery powered camera, or audio triggered one.",
    "author": "Mazel2v",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mcfjgp/recommendations_for_a_continuous_recording/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-29T16:08:09Z",
    "flair": null,
    "post_text": "The neighbour has been verbally harassing us, so installing cameras that can record audio. \n\nI'm hoping to find a battery powered camera with local storage that is either:\n\n1. recording continuously so I can go back and clip footage every time there is an incident.  \nor   \n2. An audio triggered recording (sometimes there is no visual trigger and he is screaming at us from his backyard which we can't point at, with us inside.) \n\nAny recommendations would be great. "
  },
  {
    "post_id": 77,
    "title": "Need a camera with rtsp support",
    "author": "sumin101",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mcdert/need_a_camera_with_rtsp_support/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-29T14:47:21Z",
    "flair": null,
    "post_text": "like the title says.\n\nI need a stand alone 4G Sim camera (or wifi) which can stream the footage via rtsp to my api endpoint using something like opencv.\n\nim struggling to find something compatible. Reolink seems to only allow rtsp streaming if you purchase the NVR or homehub with the camera.\n\nas a minimum i need the camera to be able to stream via rtsp to my own application, but ideally, it would be perfect if it is 4g sim compatible and solar powered."
  },
  {
    "post_id": 78,
    "title": "Remove user from CloudEdge account",
    "author": "SophieMemphis",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mc8zmd/remove_user_from_cloudedge_account/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-29T11:34:05Z",
    "flair": null,
    "post_text": "I recently kicked my alcoholic husband out of the house. After he left, I realized he still has access to the two Yeskamo cameras via the CloudEdge account and can see me coming and going.... a very unsettling feeling given how unpredictable he is.\n\nHere are the steps I have taken so far:\n\n* Changed the WiFi password\n* Deleted camera device and resynced within CloudEdge account\n\nIs this enough? Would by Ex still have access to the cameras if he opened the app?"
  },
  {
    "post_id": 79,
    "title": "Best indoor and outdoor Dahua cameras ?",
    "author": "Maanu1141",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mc7o4h/best_indoor_and_outdoor_dahua_cameras/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-29T10:18:39Z",
    "flair": null,
    "post_text": "**Hello everyone!**  \n  \nI'm looking to upgrade my current Dahua NVR system and would really appreciate your input. I’d like to add an exterior camera to cover the outside of my local market, and also replace the existing camera monitoring the counter with a high-end model. Ideally, the new counter camera should offer crystal clear image ( when i playback the video to still keep the high quality when i zoom in — I need to clearly see the banknotes when they’re counted or handed over by customers )  \n  \nFor the exterior camera, I’m aiming for something reliable and high-quality. If it has built-in lights or features that can help deter thieves or burglars at night, that would be a huge bonus.  \n  \nI’ve spoken to a few security camera vendors in my area, but it feels like they’re just trying to push what they have in stock. So I’d much rather hear real recommendations from you guys.  \n  \nAlso, I’d like to install two additional cameras on my house for personal security and to monitor the surroundings when I’m not home. Since the market is located at my house's ground floor, I can connect them directly to the market's NVR also.  \n  \nMy budget is around **€150 to €300 per camera if there's something really worth it.**  \n  \nThanks in advance — I really appreciate your help!"
  },
  {
    "post_id": 80,
    "title": "Looking for a budget-friendly home security camera without subscriptions",
    "author": "Exciting_Wrap9690",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mc4mjp/looking_for_a_budgetfriendly_home_security_camera/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-29T07:00:14Z",
    "flair": null,
    "post_text": "I'm in search of a reliable home security camera that's easy to set up and doesn't require any subscriptions. Any recommendations?"
  },
  {
    "post_id": 81,
    "title": "Indoor Security Camera Question",
    "author": "Excellent_Tree_1459",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mc2ajc/indoor_security_camera_question/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-29T04:40:11Z",
    "flair": null,
    "post_text": null
  },
  {
    "post_id": 82,
    "title": "Swann DVR8-5580 camera issues",
    "author": "Waste_Revolution4457",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mbwx51/swann_dvr85580_camera_issues/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-29T00:15:44Z",
    "flair": null,
    "post_text": "Hi, Currently using the DVR8-5580 for a few years and recently not all of the cameras are working (down to 2 from 7). I have replaced the power supply ( for the cameras which hasn't helped. Is the DVR itself on the way out or the cameras(all swann but some are different models)? I'm not sure which to try next? Thanks!"
  },
  {
    "post_id": 83,
    "title": "Using tools/devices to mask/hide cameras on network (stealth)?",
    "author": "Downtown_Ordinary504",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mbu1k2/using_toolsdevices_to_maskhide_cameras_on_network/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-28T22:11:26Z",
    "flair": null,
    "post_text": "Any options to hide my Wifi network thus hiding any live cameras?\n\nThe goal is to stop Wifi intrusion/disabling property cameras remotely, which can be done if someone gains access to my network and/or they pick up my wifi signal.\n\n"
  },
  {
    "post_id": 84,
    "title": "Do Hikvision IP PoE Cameras Work Without NVR? Zoom/Orientation Control?",
    "author": "Public-Process6081",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mbkm6c/do_hikvision_ip_poe_cameras_work_without_nvr/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-28T16:18:12Z",
    "flair": null,
    "post_text": null
  },
  {
    "post_id": 85,
    "title": "Is this setup OK?",
    "author": "Solidus-Prime",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mbjxza/is_this_setup_ok/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-28T15:53:58Z",
    "flair": null,
    "post_text": "Each \"zone\" will have it's own PoE switch. All cameras in that zone plug into it. Then a single cable from each PoE switch in each zone goes to a \"main\" PoE switch that sits next to the NVR, which also plugs into this main PoE."
  },
  {
    "post_id": 86,
    "title": "Cannot identify this camera",
    "author": "Vik8000",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mbdfr8/cannot_identify_this_camera/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-28T11:17:20Z",
    "flair": null,
    "post_text": null
  },
  {
    "post_id": 87,
    "title": "USB-C to micro adapter? (For Tapo A201 / C425)",
    "author": "PracticlySpeaking",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1max755/usbc_to_micro_adapter_for_tapo_a201_c425/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-27T20:50:01Z",
    "flair": null,
    "post_text": null
  },
  {
    "post_id": 88,
    "title": "No WiFi at all, Free standing, nice looking home security camera with local storage only. No smarts, just record.",
    "author": "ShmooelYakov",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mavp02/no_wifi_at_all_free_standing_nice_looking_home/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-27T19:48:54Z",
    "flair": null,
    "post_text": "I'm looking for a system that is just one or two cameras, with no Wi-Fi signal for someone to connect to, and stores the video on either a large SD card, external HD, or DVR. I didn't want smarts, apps, remote access or anything. I'd also need it to be able to be free standing on a flat aurface and nice or discreet enough to be placed in a living room. It's like basic is harder now, I know I know everything is \"as a service\". Please help."
  },
  {
    "post_id": 89,
    "title": "Baby monitor help!",
    "author": "grangerthegoatgryff",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1masneu/baby_monitor_help/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-27T17:46:59Z",
    "flair": null,
    "post_text": null
  },
  {
    "post_id": 90,
    "title": "Camera rec for outdoor home surveillance?",
    "author": "EnoughPoem4132",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1manjhn/camera_rec_for_outdoor_home_surveillance/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-27T14:22:33Z",
    "flair": null,
    "post_text": "A high capacity Airbnb moved in across the street from our house in a quiet, residential neighborhood. It’s been such a bummer! This house has been a huge nuisance and we need to be documenting the disruptive and destructive behavior. We are dealing with parties, ride shares dropping off big groups of people, intoxicated people hanging out in the front yard and street, reckless driving, loud noise and illegal parking.\n\nI purchased a solar powered ieGeek brand camera. It is motion activated and even after playing with the settings a ton, it catches every kind of motion EXCEPT the ones we want across the street. Our tree blowing in the wind and cars driving by will set it off, but not activity at the rental property. We’ve only been able to capture things when we know it’s happening and we can manually record using the app. Of course the bad behavior is often happening in the middle of the night, and the camera stinks in the dark, even on the highest sensitivity motion detection. It has a “human detection” feature, but it doesn’t work. I played with the settings and even danced around in the front yard in front of the camera and it did not record me. \n\nDoes anyone have a rec for a camera that would be better for this kind of surveillance? Maybe something that just continually records and we could go through the footage and grab what we need? I’m not tech-savvy so not even sure what to look for. We have a Ring doorbell, so I’m wondering if one of their products could be a good fit? To capture the right angle, the camera needs to be in a place where we can not easily run a cord. I’m hoping to keep the cost reasonable. "
  },
  {
    "post_id": 91,
    "title": "Identify this camera",
    "author": "djchrisj123",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1madfrr/identify_this_camera/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-27T04:36:46Z",
    "flair": null,
    "post_text": "Recently bought a house with this camera attached. Other side of camera not shown shows brand name Flir but not sure what model it is exactly "
  },
  {
    "post_id": 92,
    "title": "What to keep in mind when hiring pros to install wired security cameras?",
    "author": "OJ_Jane",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1mabrvu/what_to_keep_in_mind_when_hiring_pros_to_install/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-27T03:05:39Z",
    "flair": null,
    "post_text": "Hi, \nI’m planning to install a wired 4K security camera system (4 outdoor camera) on a home in the Seattle area. I’m leaning toward hiring professionals for the installation to make sure it’s done right and the wiring is clean.\n\nI’d love your advice on a few things:\n\t•\tWhat should I look for or ask when choosing a company or installer?\n\t•\tAny red flags or common mistakes to avoid?\n\t•\tRoughly how much should I expect to pay for professional installation ? (Ballpark estimates are fine)\n\nAppreciate any tips or insights you’re willing to share!\n"
  },
  {
    "post_id": 93,
    "title": "Hurricane strength camera",
    "author": "NervousClock2555",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1maap8i/hurricane_strength_camera/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-27T02:08:58Z",
    "flair": null,
    "post_text": "Moving to the beach.  Any suggestions on outdoor security cameras that could withstand potential hurricanes?   Preferably wireless and operating on WiFi.  "
  },
  {
    "post_id": 94,
    "title": "What can I do better",
    "author": "zackz99",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1ma8yqg/what_can_i_do_better/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-27T00:40:48Z",
    "flair": null,
    "post_text": null
  },
  {
    "post_id": 95,
    "title": "Can anyone identify this security camera make and model? (needed to scare trespassers away)",
    "author": "Traditional-Gas3477",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1ma3dqa/can_anyone_identify_this_security_camera_make_and/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-26T20:25:52Z",
    "flair": null,
    "post_text": "I've watched an urbex video where a man heard some click and looked up to see some camera with its IR sensor activated before being spooked and then bolting out of there.  I need this type of camera that has that creepy look  because I am a custodian owner of a massive facility that is often frequented by kids which is very annoying.\n\nIs this likely a security camera if it makes a click and then shows a red LED/IR sensor?\n\nCan I just add more security cameras but dress them up in miniature doll clothing to give that weird and creepy vibe???"
  },
  {
    "post_id": 96,
    "title": "Are there any wireless cameras that work only on my WiFi?  No subscription, no \"sign up\", etc....",
    "author": "LisaMay9",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1ma075m/are_there_any_wireless_cameras_that_work_only_on/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-26T18:12:46Z",
    "flair": null,
    "post_text": "I'm new to security cameras, I just want to be able to look at my iphone or iPad and see a live view of my driveway or child in the next room.  No recording, no artifcial inteligience, nothing special.  But every time I buy a set of security cameras that say \"wireless\" I end up being extorted for some kind of subscription.  I have powerful wifi (thank you Starlink) does anyone know of any kind of small camera I can use and leave plugged in to check the other side of the house without having to sign up and/or pay or give access to some third party to use the cameras?  \n\n  \nFor what it is worth, I have power outlets where I want the cameras, and they don't have to be night vision or even color.\n\n  \nThank you!"
  },
  {
    "post_id": 97,
    "title": "Wireless Security Camera that filters out cars",
    "author": "bss05",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m9z6rm/wireless_security_camera_that_filters_out_cars/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-26T17:31:13Z",
    "flair": null,
    "post_text": "I have an issue where a crazy neighbor is walking down the road in front of our house and shouts abuse at us on a daily basis, and occasionally trespasses onto our land. I thought putting a camera up on a tree by the road might dissuade him and I can collect footage in case we ever need to prosecute him. \n\nMy concerns are : \n\n1) The road is 100 ft from the house so it can't be wired - I'm hoping that buying a wifi extender will extend the range to the unit. I could have it by the house but it wouldnt be visible from the road and woudnt act as a deterrent. \n\n2) The road is busy and cars are passing almost every minute of the day. How good are the AI units in filtering out cars? It will be directed down the road - and the turning is 200ft away so that's a lot of road it will be capturing.\n\n3) I'm on a tight budget. Not keen on a subscription model.   \n\nI thought this unit might be good as it has 2 cameras so can capture him as he passes by - [https://www.amazon.com/gp/product/B0DWFKVNV3?smid=A8EBZYH92U6B8&amp;th=1](https://www.amazon.com/gp/product/B0DWFKVNV3?smid=A8EBZYH92U6B8&amp;th=1) \n\nBut if the AI isn't good about filtering cars then the SD card will be full in a day. \n\nI have read the Reolink Altas PT Ultra might be a solution as it records 24/7.\n\nWould greatly appreciate any suggestions!"
  },
  {
    "post_id": 98,
    "title": "System to catch vandalism",
    "author": "EntropySimian",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m9va93/system_to_catch_vandalism/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-26T14:52:52Z",
    "flair": null,
    "post_text": "I'm pretty certain that my neighbors lawn people are kicking in my side fence to harass my dogs. There are many broken boards that could only have gotten that way by being hit from the other side. The fence is only 2 years old and is well maintained. \nI'm looking for a camera that I can run all day, but more importantly, that records locally. I want to be able to review footage for 2-3 months and quickly find when the damage happens. I thought if there's a recording software that generateds a few pictures every day as a summary feed for quick reference, that would be great. Even better if I can host an AI to review footage. \nDoes anyone have suggestions for a solution? "
  },
  {
    "post_id": 99,
    "title": "Security camera for home",
    "author": "Powerful-Low-6726",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m9fd61/security_camera_for_home/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-26T00:17:48Z",
    "flair": null,
    "post_text": "I recently purchased a home and I’m looking for a subscription free service for home monitoring/ security. Any recommendations?"
  },
  {
    "post_id": 100,
    "title": "Tactacam defend cell camera alternatives?",
    "author": "Graham_Wellington3",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m998nl/tactacam_defend_cell_camera_alternatives/",
    "num_likes": 0,
    "num_dislikes": 0,
    "num_comments": 0,
    "num_shares": 0,
    "created_utc": "2025-07-25T19:58:55Z",
    "flair": null,
    "post_text": "In need of some cellular cameras. 2-4. The camera seems great all around except for its paywall for viewing video or pictures. \n\nIs there an alternative that is similar?"
  },
    {
      "post_id": 101,
      "title": "Help with this Security system",
      "author": "CptRoast",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1m7r3bz/help_with_this_security_system/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-24T01:18:40Z",
      "flair": null,
      "post_text": null
    },
    {
      "post_id": 102,
      "title": "Best outdoor camera with no need for WiFi, and is solar?",
      "author": "soft_femme",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1m7r2vr/best_outdoor_camera_with_no_need_for_wifi_and_is/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-24T01:18:04Z",
      "flair": null,
      "post_text": "Hi, we have a farm that has recently had some illegal hunting done on it. I want to set up a couple cameras out there, but they would need to be solar because there’s no power and also have the capability to use an SD card. I see people recommend Reolink and I have one in my house, but I have no power (and thus no internet) at the farm. Would a trail cam be better? TYIA!"
    },
    {
      "post_id": 103,
      "title": "I ran three new cctv cables and added three new cameras to my dvr all in the same area, but one of them flickers.",
      "author": "wolfgheist",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1m7pvi1/i_ran_three_new_cctv_cables_and_added_three_new/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-24T00:21:03Z",
      "flair": null,
      "post_text": null
    },
    {
      "post_id": 104,
      "title": "Security cam system with storage to PC HDD?",
      "author": "sbielawa",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1m7p5kt/security_cam_system_with_storage_to_pc_hdd/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-23T23:48:10Z",
      "flair": null,
      "post_text": "Looking for a security camera system which allows saving video direct to PC, rather than to an SD card or cloud service which I have to pay for.  \n\nAccessing the cameras via an app is also needed in case we are not home and I want a live view.\n\nBut the point is the video data is saved to a PC one way or another."
    },
    {
      "post_id": 105,
      "title": "Camera with an app and gives up 12 or 24 hours to view footage for free",
      "author": "IndependentPiano1827",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1m7ov7e/camera_with_an_app_and_gives_up_12_or_24_hours_to/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-23T23:35:11Z",
      "flair": null,
      "post_text": "A friend had this camera but they don’t recall its name. I’m looking for a security/recording camera that comes with an app. The app lets you view the footage for up to 12 or 24 hours. I can’t remember which is correct. \n\nI just need something simple with no subscription. I don’t need the footage long term either. "
    },
    {
      "post_id": 106,
      "title": "Nest Cam question",
      "author": "Nice-Macaron-3746",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1m7nc3j/nest_cam_question/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-23T22:29:26Z",
      "flair": null,
      "post_text": null
    },
    {
      "post_id": 107,
      "title": "Reliable camera with remote access and notifications",
      "author": "Simple-Seaweed424",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1m7n6lk/reliable_camera_with_remote_access_and/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-23T22:22:59Z",
      "flair": null,
      "post_text": "I currently have tried Arlo, Wyze and Blinks. The Arlo has been the best out of the three but still really struggling. The cameras die really quickly and either don’t record at all or record clips every minute for 24 hours a day. They also get so messed up when the WiFi goes out. I need to uninstall and reinstall the cameras/ redo all the setting every time. The Arlo have the widest view and the camera quality is the best. But they are so unreliable. Feels like when I really need them they are offline. \n\nI want to be able to watch all four corners of my house on the outside as well as a couple cameras where the dogs are alone during the day in the house that I can turn off when we are home. \n\nI’d like to be able to see the footage live and get notifications to my phone with movement or sounds (barking). \n\nDoes such a thing exist? I’m not super tech savvy but could figure things out if I needed to do something more than just screwing cameras in the wall and downloading an app. "
    },
    {
      "post_id": 108,
      "title": "Avycon Cameras + Reolink NVR",
      "author": "Nickypicky_1",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1m7m9ij/avycon_cameras_reolink_nvr/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-23T21:46:17Z",
      "flair": null,
      "post_text": "Hello everyone, \n\nI had a client purchase a Reolink NVR for their Avycon cameras and I am completely stumped on how to add them. \n\nI spoke with Avycon support and they said Onvif is enabled by default but they also performed a factory reset on one of the cameras for me to test. The Reolink also supports and has Onvif enabled. \n\nI’m not sure why I cannot add the camera. Any help or advice would be great! Thanks. "
    },
    {
      "post_id": 109,
      "title": "I’m looking for video cameras for my business that don’t rely on Internet and can’t be deleted by anyone at my front desk. Can anyone point me in the right direction? I’m having a serious security issue at my business.",
      "author": "Unfair_Minimum_581",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1m7kbk0/im_looking_for_video_cameras_for_my_business_that/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-23T20:30:21Z",
      "flair": null,
      "post_text": null
    },
    {
      "post_id": 110,
      "title": "Camera for barn",
      "author": "barvetski",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1m7jql6/camera_for_barn/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-23T20:08:28Z",
      "flair": null,
      "post_text": "Need a camera to put in the barn. Must haves\n\n-easy install (like magnet or sticky easy) no screws\n-theres no WiFi so needs a memory card for storage\n-could possibly get a power source but ideally would like battery powered \n-needs to capture video\n-needs to be small/inconspicuous, no light on it\n\nAny help appreciated "
    },
    {
      "post_id": 111,
      "title": "Wanting mutiple cameras for the track.",
      "author": "Kindly_Teach_9285",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1m75dxh/wanting_mutiple_cameras_for_the_track/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-23T10:14:06Z",
      "flair": null,
      "post_text": "I need a few cameras to record at the same time when I run at the track.\n\nIn car: facing me, the shifter and the windshield\n\nIn the grill: showing the front of the car\n\nOutside the car: side of the track recording my launches and run down the track\n\nI'll also need a way to splice the videos together. Not sure what software is reasonable to use. This is just for me, to gather more track data. What cheap cameras can I use to make this happen? How would I record the cameras in/on the car? Thanks for any help!"
    },
    {
      "post_id": 112,
      "title": "Camera Recommendations For A Church",
      "author": "rrodg12",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1m74jds/camera_recommendations_for_a_church/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-23T09:21:08Z",
      "flair": null,
      "post_text": "Looking to purchase my church some security cameras. At the point I'm considering Unifi due to there AIs,expandability and ability to view on a web browser remove though the account. Im just asking here to see if anyone else k ow of any other possible alternatives. "
    },
    {
      "post_id": 113,
      "title": "Odd Question",
      "author": "5h4ckl3ford",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1m73zfb/odd_question/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-23T08:44:16Z",
      "flair": null,
      "post_text": "https://preview.redd.it/5qm5qv666lef1.jpg?width=700&amp;format=pjpg&amp;auto=webp&amp;s=72475761c718c33de183bfa8b03604c3206a4ada\n\nI apologise this isnt a strictly Security camera question.\n\nAt my place of business I have a coil lifter very similar to this but it has been reengineered and in the reengineering the operator's vision is now somewhat obstructed, is the short range camera or technology (I thought maybe RF or something that could do the trick?) \n\nWe are trying to avoid having to use a SIM card (on going cost) and there is no wifi signal in yard."
    },
    {
      "post_id": 114,
      "title": "How exactly is it possible to have remote access to cameras with no cloud account?",
      "author": "BBGonda",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1m6xox4/how_exactly_is_it_possible_to_have_remote_access/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-23T02:37:26Z",
      "flair": null,
      "post_text": "I recently setup some Tapo C120 cameras around the house and over the weekend I was surprised to discover I can access them remotely to live stream, change settings, etc. I was out of the house in another part of the city, nowhere close enough to be connected my house’s wifi, and I was still able to live stream all four cameras from my phone via the app. I had assumed I could only access the cameras while at home connected to my house’s wifi. I don’t have a cloud subscription or account, and all four cameras record locally to the microSD cards I've installed in each.\n\nI'm new to this tech and I'd like to understand  know how this is possible, since the main reason I purchased these cameras is that I didn't want anything on the cloud servers and all recording to be hard recorded, so locally on drives like a microSD. I suspect the Tap app enables remote control/access of the cameras through the TP-Link cloud server. Once the cameras are configured and connected via the app and my Tapo ID, it establishes a link via the TP-Link cloud server to my cameras and that’s how I can live stream remotely and change any settings/make commands. \n\nIf this is correct, my question then is are my live streams and short detection videos when the cameras are triggered uploaded to the cloud server and that’s how I can view them remotely? I mean, how else would I be able to remotely access the live stream and the video clips if they weren’t first uploaded to the TP-Link cloud server? I can edit these videos as well, really anything I could do on the app via my house’s Wifi. My concerns are for my privacy really and the reason I set these up to only record locally to a microSD. It would be helpful to understand what the intricacies of the tech process here are, and to what extend my videos and live streams are on the TP-Link cloud servers. Thank you!"
    },
    {
      "post_id": 115,
      "title": "Vichome firmware update notice",
      "author": "MsChiSox",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1m6k7xb/vichome_firmware_update_notice/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-22T17:23:08Z",
      "flair": null,
      "post_text": "Hi, just got a firmware update notice in the Vicohome app for a couple of cameras. Can I just select \"later\" and not deal with it now without any issues? Looks like a new update and may have bugs in it"
    },
    {
      "post_id": 116,
      "title": "NVR to PC",
      "author": "flashly79",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1m6aiwf/nvr_to_pc/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-22T10:30:49Z",
      "flair": null,
      "post_text": "I have a Swann NVR887080RN with 4x cameras attached via ethernet cable.  All cameras are working to the NVR and show up on my connected TV.  I have previously had the ethernet connected to my PC when 3x cameras were connected and was able to watch the cameras using the Swann app, HOWEVER, once I connected the 4th camera I have not been able to watch it any more on my PC.  I have absolutely no idea what I've done to make it longer work. If I remove the 4th camera I can still no longer watch anything through my PC. The ethernet cable is connected directly from the NVR to my PC. I'm using Starlink as my internet which runs to my PC through WiFi. \n\nAny idea what I'm doing wrong?  It may have just been a fluke last time I connected so please keep it simple with any explanation. (I'm getting old :P )"
    },
    {
      "post_id": 117,
      "title": "Genuinely curious: what kind of \"technical capability\" is required to review apartment security footage?",
      "author": "bluemoonshade",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1m5tu3z/genuinely_curious_what_kind_of_technical/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-21T20:21:03Z",
      "flair": null,
      "post_text": "My apartment managers sent out this email to all residents and it made me curious what it is about reviewing security camera footage that requires technical capability. I have no particular need to see security footage at this moment, but I have an interest in this because I have come across this situation before. In college, my laptop was stolen from a campus common area in which there was a security camera. When I went to the campus security to see if they could see the security footage for any insight into who stole the laptop, they said they couldn't access the footage and didn't have the expertise to review it even if they did. In my mind, it seems it shouldn't be hard to pull up footage from the date and approximate time an event happened and then examine the footage, but I also want to give people the benefit of the doubt that they aren't being difficult for no reason or lazy. Is there something more complicated about the process? Is it more about legal liability/not wanting to have to get involved in any sort of court proceedings? Are they renting cameras from the actual police and therefore don't own it or have log in credentials? If anyone knows why this is a phenomenon, let me know! Super curious.\n\nEdited photo to take out city name. "
    },
    {
      "post_id": 118,
      "title": "New home construction - Ring vs Eufy vs Ubiquity Unifi?",
      "author": "lawstudent420",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1m5tccl/new_home_construction_ring_vs_eufy_vs_ubiquity/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-21T20:02:34Z",
      "flair": null,
      "post_text": null
    },
    {
      "post_id": 119,
      "title": "New to cameras. Need advice",
      "author": "MrNakedPanda",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1m5s064/new_to_cameras_need_advice/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-21T19:12:05Z",
      "flair": null,
      "post_text": "Hey y’all, I’m wanting the bare minimum here but I’m not sure I can get what I want. Any help is appreciated. I’m reasonably tech savvy but I’m not interested in complicated setup and maintaining a server or some central hub. I only need 1 camera. \n\nRight off the bat I’ll say I’m not paying for a subscription service. \n\nI want just 1 camera for inside a small apartment, that will give me notifications if it catches movement. If I can get live video of that movement that’s even better. We will only use the camera when away and at night. I don’t want an internet capable (I.e hackable) camera watching me all day, so I also don’t want cloud services if possible. Local storage is preferred. I do understand that getting live footage goes thru an app and they can aquire it that way… if I have to deal with that then I will. But local storage is still preferred because I’m not paying anyone to store footage I don’t care about long term. \n\nDo they make cameras that will just write over old data when the card storage is used up, essentially making it infinite storage? I don’t care about cataloging footage. It’s purely for notifying me if there is a break in or something. The apartment does not have an alarm system. \n\nDue to other post recommends. I’m looking at Reolink Poe cameras, something like an RLC-540A. But I’m having trouble determining if Poe means I can just splice it into my existing cat6 network, or if I would have to run new lines (deal breaker). I’m not interested in having to buy special software or a hub of some type, because again it’s only 1 camera for when we are not occupying the space. \n\nAm I being unrealistic with these requirements or is there something that fits the bill? \n"
    },
    {
      "post_id": 120,
      "title": "replacement needed for watchnet evi-1621-2T",
      "author": "ThatOneHypedGuy",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1m5o759/replacement_needed_for_watchnet_evi16212t/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-21T16:51:59Z",
      "flair": null,
      "post_text": null
    },
    {
      "post_id": 121,
      "title": "Need help identifying this security camera",
      "author": "GuitaristKage",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1m5mx4r/need_help_identifying_this_security_camera/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-21T16:04:09Z",
      "flair": null,
      "post_text": "Some added context : For around the last 3 years our Neighbor has been surveilling our backyard , side of our house , and front yard . this wouldn’t be an issue if it wasn’t also meant with constant stalking , Harrasment , and multiple police calls to our house . Other examples are motion activated lights specifically on our side of the house and no other. We have 2 cameras for legal evidence but don’t survey everything, recently when one of our cameras had to be charged he cut down a post of ours in our backyard which we were gonna use to create a blind so he couldn’t watch us on his camera , since the camera was down we have no evidence or proof and are therefore not doing anything about this . Can anyone help us know what Brand of camera this is and if it has the ability to record audio . Any legal advice would be nice too , there’s also plenty more examples of harassment but the list goes on for a long time"
    },
    {
      "post_id": 122,
      "title": "looking for cheap security camera with seperate local storage",
      "author": "Final-Scheme-7360",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1m5lnsy/looking_for_cheap_security_camera_with_seperate/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-21T15:17:08Z",
      "flair": null,
      "post_text": "anyone know cheap camera with seperate sd card storage other than blink?\n\ni know blink has sync module but most other cameras seem to have sd card slot on camera\n\ni want one cheap camera with sd card hidden somewhere like blink"
    },
    {
      "post_id": 123,
      "title": "Moved into a house with a PoE camera setup. How do start I using it?",
      "author": "Baked_Brain",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1m5aib0/moved_into_a_house_with_a_poe_camera_setup_how_do/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-21T05:27:26Z",
      "flair": null,
      "post_text": "Just moved into a new house and found this set up. Im trying to figure out how to actually use it. Inside the wardrobe, there's a PoE injector. Outside, there's a floodlight camera. No brand labels except for a serial number. "
    },
    {
      "post_id": 124,
      "title": "New home. Is this a camera?",
      "author": "Logical-Security7368",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1m5afys/new_home_is_this_a_camera/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-21T05:23:42Z",
      "flair": null,
      "post_text": "I just moved and realized this in the back yard. I took a picture and google told me it’s a camera but my question is is it actually a camera or is it like the base to a camera and the lens is missing. In other words could someone be watching and I need to take it down? Or is it just the plastic base and there’s no lens"
    },
    {
      "post_id": 125,
      "title": "WIFI Camera with connection failover",
      "author": "Pikatchu714",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1m5a9p2/wifi_camera_with_connection_failover/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-21T05:13:23Z",
      "flair": null,
      "post_text": "Is there a WIFI battery camera which has the below options.\n\n1-Connect to Home WIFI , if internet goes down(it has to monitor internet because usually it won't connect to 2nd wifi with the same SSID if the home router didn't shutdown) it connect to 2nd WIFI with different SSID\n\n2-Connect to home WIFI , If internet goes down , failover to 4G SIM Connection embedded in the camera."
    },
    {
      "post_id": 126,
      "title": "Market Validation for new product",
      "author": "Head_Arrival_6592",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1m538rr/market_validation_for_new_product/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-20T23:21:22Z",
      "flair": null,
      "post_text": "Hey everyone, I am trying to create a new security product and trying to do market validation. The survey is 8 8-question MC and takes 1-2 minutes"
    },
    {
      "post_id": 127,
      "title": "Best home security camera",
      "author": "MotorEbb652",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1m528xe/best_home_security_camera/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-20T22:37:09Z",
      "flair": null,
      "post_text": "I noticed it in a window of a building that has about 5 visible cameras. "
    },
    {
      "post_id": 128,
      "title": "IWFCam - No Memory Detected",
      "author": "Membrainn",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1m4s7cs/iwfcam_no_memory_detected/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-20T15:48:34Z",
      "flair": null,
      "post_text": "Does anyone already experienced having a problem detecting there memory card? I already tried to format it via app but it just keeps loading for like 7-10mns then follow a message \"Session timed out\". \n\nI used 2 different memory cards just to be sure. Did a format as well via PC to FAT32 and EXFAT. Nothing works. Please help. "
    },
    {
      "post_id": 129,
      "title": "Seeking suggestions for basic home wireless NVR and IP camera setup",
      "author": "pineapplepizzabong",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1m4rsma/seeking_suggestions_for_basic_home_wireless_nvr/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-20T15:31:51Z",
      "flair": null,
      "post_text": "The title pretty much sums it up. I am looking for help and suggestions on what to buy for a small and simple home security system. There are so many options that I find myself fairly overwhelmed.\n\n* I only need support for two to four cameras.\n* The cameras would be outside.\n* I already have a bunch of SSD HDs lying around for the NVR.\n* The two places I have marked for cameras already have DC power from a previous ADT home security system. AC power would also be easy to provide.\n* Since the NVR would be local to my network my goal would be avoid apps and subscriptions and I would simply view the videos locally as needed.\n* I would prefer a WiFi compatible NVR and IP cameras so I don't have to run a bunch of Ethernet cable. My wireless network reaches outside just fine and has plenty of bandwidth currently.\n* 1080p video quality is fine and 30fps would be nice to have but not necessary. I don't need 4K@60fps or anything like that haha.\n* IP cameras that have some level of low light support would be another nice to have.\n\nWhat do y'all think? Thank you for helping out a security camera beginner!"
    },
    {
      "post_id": 130,
      "title": "Camera System",
      "author": "Standard_Practice_29",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1m4ehia/camera_system/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-20T03:05:21Z",
      "flair": null,
      "post_text": "I'm searching for a camera system to install in the four corners of my house that meets the following criteria:\n\n- No monthly subscription fees: This is critical.\n- Application or browser-controlled: The app must not have subscription-based features, as I want a fully functional default option without extra fees.\n- Solar-powered: Sustainability is important to me.\n- Wi-Fi enabled: For easy connectivity.\n- Local storage: Must have continuous recording capabilities in a loop"
    },
    {
      "post_id": 131,
      "title": "Where would a good spot for a security camera be for my garage . Condo townhouse",
      "author": "Frenchbulldogcanada",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1m4c0hj/where_would_a_good_spot_for_a_security_camera_be/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-20T00:57:23Z",
      "flair": null,
      "post_text": null
    },
    {
      "post_id": 132,
      "title": "HELP Need Advice on Camera System to Keep Elderly Mom Safe",
      "author": "AdhesivenessOver840",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1m473lf/help_need_advice_on_camera_system_to_keep_elderly/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-19T21:08:11Z",
      "flair": null,
      "post_text": "I need advice on an indoor camera system for my mom who's 96. My sisters and I have been taking 24/7 shifts at her house since a hospitalization. She's well enough to be on her own, but we want to make sure she's ok when we're not there. We just got a medical alarm system set-up. Now we need to get a camera system set up. We're looking for: Wide-angle view; night vision, audio so we can talk to her from our houses, phone app viewing (Apple), quiet/silent, small and discreet. We'll need 6 cameras altogether. Anything else we haven't thought about?"
    },
    {
      "post_id": 133,
      "title": "Question or suggestion about AOSU cameras DOA",
      "author": "Void_Listener",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1m45k1t/question_or_suggestion_about_aosu_cameras_doa/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-19T20:01:24Z",
      "flair": null,
      "post_text": "I just bought the four pack of cameras from Amazon with solar panels for under $300. Seemed like a good deal. One arrived dead with no picture. All four connected to the hub. Taking them about 8 feet away from the hub turned the feed into a slide show. Anything further resulted in lost connections with an occassional single frame. The dead one being the exception, it only send a blue/green screen. I've seen good reviews but these came out of the box in a bad state. If they're broken out of the box, I don't want to deal with them.  \n\nI have been using Arlo cameras but they are now turning off features if you don't use their subscription service. Does anyone have good deals on a reliable 4 camera system? "
    },
    {
      "post_id": 134,
      "title": "Which 180° panoramic PoE camera with person detection under $300?",
      "author": "riverviewpark",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1m40qvt/which_180_panoramic_poe_camera_with_person/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-19T16:41:24Z",
      "flair": null,
      "post_text": "I need to replace an existing 110° horizontal field of view (FOV) turret camera, would like a wider FOV.  Considering Amcrest's IP8M-DLB2998EW-AI dual-lens camera with in-camera image stitching, but open to alternatives with similar functionality.\n\nNeeds to be PoE, [Synology-supported](https://www.synology.com/en-us/compatibility/camera/37665) as a single stitched image stream, and should offer RTSP and storage/backup via MicroSD and SFTP, and in-camera person detection.\n\nLeaning towards the Amcrest for the FOV (H:180° x V:81°) has more vertical field compared to Reolink Duo 3 (H: 180°; V: 55°) and also because Reolink still only offers cleartext FTP, no SFTP support.\n\nAre there other turret/bullet cameras worth considering in my budget?"
    },
    {
      "post_id": 135,
      "title": "Yi camera. Don't buy it",
      "author": "Public_Key8956",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1m3uf1q/yi_camera_dont_buy_it/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-19T11:55:48Z",
      "flair": null,
      "post_text": "I have 3 of these cameras and I bought them a while ago. The app now is infested with ads. You can't skip it. You have to wait like 30 seconds before you can see the place you are monitoring. Piece of junk anymore. "
    },
    {
      "post_id": 136,
      "title": "Fuzzy lines on camera at night",
      "author": "Azztrix",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1m3tuzk/fuzzy_lines_on_camera_at_night/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-19T11:24:27Z",
      "flair": null,
      "post_text": "Howdy people I have a ptz camera 54x zoom Sony chip 8mp Aliexpress job which works surprisingly well except at night it has a bunch of fuzzy lines like from IR feedback or something. Once the picture focuses it's reasonably clear I guess just got these weird lines. It gets programmed via preset values just wondering if there is a fix or if I should just get another. I've attached a picture of my paddock and horse for example which is about 40 meters away. "
    },
    {
      "post_id": 137,
      "title": "Does anyone use this modem?",
      "author": "Unlikely_Wombat10",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1m3rr2a/does_anyone_use_this_modem/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-19T09:08:30Z",
      "flair": null,
      "post_text": "I'm looking for a 4g wifi router/modem that I can hook up to a solar panel to provide wifi to a couple of solar cameras. Just wondering if anyone could share their experiences or thoughts on this one? Or maybe had a suggestion of a more suitable one. I dont want to spend a lot of money as it's only temporary. I will get the power connected eventually🤞 I'm in Australia."
    },
    {
      "post_id": 138,
      "title": "Eufy",
      "author": "FLEAL76",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1m3m332/eufy/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-19T03:25:48Z",
      "flair": null,
      "post_text": "I just received an order of Eufy C31 door bell video camera. I bought it because it has an onboard built-in camera which could be used to keep the camera on when the power goes out. Next thing that is important is 24/7 video recording. And it would get power from the current doorbell transformer. I also want to use the original chime. Well, I temp installed the doorbell after setting it up and when I connected it to the doorbell transformer power it detected power and then gave me other options. Basically it either allows 24/7 recording without the use of my original chime or it allows use of my original chime without 24/7 recording. Both features are not allowed to function together by which is a major deal breaker for me. Anyone know if a workaround is possible? The reality is that this is a simple fix with a firmware update if Eufy so chose. I don’t have any interest in a camera with a subscription and that’s why I’ve stuck with eufy.  I emailed eufy support about it and am waiting for their response."
    },
    {
      "post_id": 139,
      "title": "best bedroom security cameras ?",
      "author": "digigirlwurld",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1m3fnz3/best_bedroom_security_cameras/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-18T22:16:12Z",
      "flair": null,
      "post_text": "hi reddit i’m looking for a security camera that can be mounted on the ceiling in a corner ! a lot of the ones i’ve seen online are desktop with limited plugins , but also they seem too sleek for me . if anyone has any suggestions i would really appreciate it !!"
    },
    {
      "post_id": 140,
      "title": "Installing mesh/AP in between NVR and POE switch that is connected to 4 cameras",
      "author": "jeggernawt",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1m3cyap/installing_meshap_in_between_nvr_and_poe_switch/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-18T20:23:42Z",
      "flair": null,
      "post_text": "https://preview.redd.it/2ukma27hxodf1.png?width=1799&amp;format=png&amp;auto=webp&amp;s=6159c951fef7c9b6414661b70555891ce62f8f27\n\nWe recently switched ISP providers. Previous provider took back their mesh system. New ISP does have better wifi coverage throughout our home, except in the garage and basement bathroom(wifi reaches about 70% of the time). Now in order to get full wifi coverage in the garage, I was thinking of getting a single unit of a TP link wifi extender/AP/mesh. Problem is, I'm not sure if it'll work with how I setup the cameras for our home. We do spend a lot of time in the garage to hangout as well, so we do need wifi there.\n\nCurrently, 4 cameras are connected to a POE switch in the garage, that POE is connected via ethernet to the NVR in the living room that is directly connected to our NAH/Modem/Router.  \nWould my attached diagram work for both wifi in the garage and NVR receiving the camera signals?\n\nAny advise/answer would be greatly appreciated before I make a purchase.\n\nedit: all connections are hard-wired. i just didnt want to have to drill extra holes. the AP would act as a pass-through in between the NVR and POE switch.  \nNVR in living room to the POE switch in the garage are connected via an ethernet line that runs outside the house. i don't have the skills to run these lines within the walls nor do i have the time. lol. and would/could not spend upwards and maybe over $1000 CAD on getting it done professionally."
    },
    {
      "post_id": 141,
      "title": "Recomendation for DVR using Trackmix wifi.",
      "author": "u_siciliano",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1m2rv3p/recomendation_for_dvr_using_trackmix_wifi/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-18T03:32:49Z",
      "flair": null,
      "post_text": null
    },
    {
      "post_id": 142,
      "title": "LTS camera adjustment",
      "author": "BloodyNightwalker",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1m2rqlt/lts_camera_adjustment/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-18T03:26:18Z",
      "flair": null,
      "post_text": "Hello everybody quick question. I’m the building maintenance for our building and I need to slightly adjust these LTS cameras and I cannot for the life of me figure out how to adjust them. They are very tight. I am not the one that installed them, but they need to be adjusted Any assistance is greatly appreciated"
    },
    {
      "post_id": 143,
      "title": "Aosu cameras connecting to monitor.",
      "author": "Mike-huntts",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1m2qp35/aosu_cameras_connecting_to_monitor/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-18T02:33:49Z",
      "flair": null,
      "post_text": "Anyone have any idea how I can connect my aosu cameras to a computer monitor? Want to have it continuously running beside my tv with the cameras up. "
    },
    {
      "post_id": 144,
      "title": "Ring Camera hacked?!",
      "author": "Ok_Accountant_4954",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1m2nz8s/ring_camera_hacked/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-18T00:23:39Z",
      "flair": null,
      "post_text": null
    },
    {
      "post_id": 145,
      "title": "Whats wrong",
      "author": "cashma352",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1m2lkgu/whats_wrong/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-17T22:36:10Z",
      "flair": null,
      "post_text": "Why are my cameras doing this"
    },
    {
      "post_id": 146,
      "title": "Hiseeu",
      "author": "jnctx2020",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1m2emco/hiseeu/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-17T18:02:47Z",
      "flair": null,
      "post_text": "Hello we just purchased a hiseeu system for our business and the led lights we have a affecting the cameras so that black lines are running through the screen. Anyone know what I can do to fix this or a similar system that will work. Our older revo system works fine with the lights but it's from 2008 and needs replacing. Any help would be great thank you "
    },
    {
      "post_id": 147,
      "title": "Looking for wireless, solar, no subscription security camera",
      "author": "Spetz",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1m2dp4v/looking_for_wireless_solar_no_subscription/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-17T17:27:55Z",
      "flair": null,
      "post_text": "I’m looking for a wireless security camera for the side of my house. The plan is to have the camera sit behind a motion activated security light from Sansi as a deterrent.\n\nCriteria:\n\n* No monthly subscription – critical\n* Application or browser controlled, but the application must not have subscription fee based options, because this means that the default option without subscription is not good enough.\n* Solar powered\n* Wifi\n* Local storage with continuous recording in loop capability\n* No budget limit, but I do not want to run wires through my house.\n\nThanks for the advice in advance."
    },
    {
      "post_id": 148,
      "title": "Help document emotional abuse in Texas",
      "author": "mugskitten",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1m2d4x8/help_document_emotional_abuse_in_texas/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-17T17:06:35Z",
      "flair": null,
      "post_text": "Hi, I am working to try and find a camera that will accurately record situations in my house. My stbx husband is extremely volatile and emotionally abusive, screaming, broken furniture, a broken window, doors, punched holes in walls ect. My current blink cameras are notorious for not activating when motion is sensed right away so a lot is missed. I have filed for divorce, just waiting for him to be served, if it was just me I would just leave, but I have 4 kids, one works locally, and school starts in a few weeks, and we have 2 ferrets, and 8 cats whom he has threatened to kill. So please help me find a c camera solution that I can document this for court. "
    },
    {
      "post_id": 149,
      "title": "Security Camera Recommendations",
      "author": "Anxious_Hearing9607",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1m2a6wv/security_camera_recommendations/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-17T15:13:53Z",
      "flair": null,
      "post_text": "What are some budget-friendly security cameras that i can place around the perimeter of my home?\n\nI’m 18F and I live with my mom, her boyfriend, oldest brother, his gf and 4 of his kids. \nWe do live on a budget and just this morning someone broke into both of our storage buildings next to our single-wide trailer and camper, and poured gasoline on my brother’s reptiles while it was me and my nephew home alone.\n\nThis is not the first time someone has attempted to break into our storage buildings."
    },
    {
      "post_id": 150,
      "title": "UNV NVR having issues with cameras extended via network",
      "author": "LightGuy48",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1m26cbn/unv_nvr_having_issues_with_cameras_extended_via/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-17T12:34:13Z",
      "flair": null,
      "post_text": "I'm working on a UNV NVR system with 100% UNV cameras, no third party hardware. The NVR is a 302-16E-P16-B.  Due to the facility layout having multiple buildings we have four cameras in another building and those four cameras are connected via fiber back to the NVR and plugged into switchport 16 on the rear 16 port PoE switch of the NVR.\n\nHowever, for some reason the NVR does not seem to 'like' a 2nd switch where multiple cameras are residing on one interface,  I've seen this before at another site too where multiple cameras shared one interface.  Sometimes one or two cameras will disappear and then reappear, sometimes they all disappear. The connection is via two Cisco switches on a GB fiber connection via Cisco SFP's.  Cisco switches show no port errors, no connection drops, nothing abnormal on the line between the buildings.\n\nSo is the built in switch on the NVR not a true switch or something unique to the UNV unit where it only wants to see one camera per interface?   Is there a workaround to fix the issue of the cameras disappearing and reappearing?  Thanks!"
    },
    {
      "post_id": 151,
      "title": "Need advice for buying a security camera for my apartment",
      "author": "andreas_kieling",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1m20dw8/need_advice_for_buying_a_security_camera_for_my/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-17T06:37:23Z",
      "flair": null,
      "post_text": null
    },
    {
      "post_id": 152,
      "title": "Is this setup worth it",
      "author": "SAFETYfirsst",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1m1tq5m/is_this_setup_worth_it/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-17T00:47:04Z",
      "flair": null,
      "post_text": "Very new to Security Cameras, and need a setup similar to this for my business. My question is, will this work off grid (More than 1000ft away from a currently established wifi connection. Also, is this way overpriced, and if so, how much would I save building this by myself.\n\nhttps://preview.redd.it/fymc3gl90cdf1.png?width=2356&amp;format=png&amp;auto=webp&amp;s=60269eeae2dd21664013b46ce4d62f9f9687e4b1\n\nhttps://preview.redd.it/3wntwi1a0cdf1.png?width=850&amp;format=png&amp;auto=webp&amp;s=5fb3b8995f71f543e64652ad2f1efe7f34d88c85\n\n"
    },
    {
      "post_id": 153,
      "title": "Swann Security camera not recording",
      "author": "Sunor-",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1m1cl2i/swann_security_camera_not_recording/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-16T13:27:35Z",
      "flair": null,
      "post_text": "Hello just got a new swann security camera set. ive set up 2 cameras 2 days ago yet theyve not been recording anything. theyve got a 256gb micro sd inside aswell however nothing has been captured. i want it to record 24/7 not just motion."
    },
    {
      "post_id": 154,
      "title": "tight budget, camera system that uses google one storage",
      "author": "nexgenasian",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1m13v0w/tight_budget_camera_system_that_uses_google_one/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-16T04:58:08Z",
      "flair": null,
      "post_text": "Is there a security camera that lets you set up google one as the storage? I'd like to store data to the cloud whenever there's motion or sound and get alerts. I'm on a budget of about $100 a camera and would like to only pay for the google one subscription. Preferably it would also only use so much of the google one drive and delete older files say after 10 GBs.  Thanks for the help in advance!"
    },
    {
      "post_id": 155,
      "title": "DW Spectrum cloud issues",
      "author": "hamel2021",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1m10qwq/dw_spectrum_cloud_issues/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-16T02:14:12Z",
      "flair": null,
      "post_text": "Is anyone using DW Spectrum and having issues with the cloud accounts getting timed out weekly?  I have multiple sites that have clients logged in with a cloud account for remote view of their systems and in the past few months I have been having them get timed out every week even though on those servers the settings are set to not limit session duration.  When this happens my phone and laptop will have issues getting back into the cloud account as well.  I have raised multiple support tickets and have gotten nowhere with support.  The last one was to update to the latest version which has been done on all the sites but then again tonight it timed out again.  It also seems to be hit and miss on whether I can just sign them right back in or I have to wait for an hour or so like tonight.  The only thing i have noticed is that systems that are on V5 still do not appear to have this issue.  Just V6..  "
    },
    {
      "post_id": 156,
      "title": "Camera for catching fly tippers",
      "author": "lonelydaduk",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1m0oecx/camera_for_catching_fly_tippers/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-15T17:42:02Z",
      "flair": null,
      "post_text": "I need a camera that’s covert, battery powered and can see number plates at night.\n\nAt home I have a unifi system but this location up the road from my house is used by fly tippers weekly. Driving to work and seeing fridges, mattresses and the contents of some unscrupulous house clearing is depressing me so I need to take some vigilante action and capture them.\n\nI’ve done some base research but I think most night cameras reflect number plates (i know my unifi cameras do) so looking for recommendations.\n\n"
    },
    {
      "post_id": 157,
      "title": "First time security camera",
      "author": "Copingphonix79",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1m0ldrm/first_time_security_camera/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-15T15:50:30Z",
      "flair": null,
      "post_text": "First time wiring up security cameras in new home what y'all think. Mounted the box under desk. "
    },
    {
      "post_id": 158,
      "title": "YI Home can't view clips anymore unless you have cloud... time to sent camera to the trash",
      "author": "elyuma",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1m0it46/yi_home_cant_view_clips_anymore_unless_you_have/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-15T14:11:24Z",
      "flair": null,
      "post_text": null
    },
    {
      "post_id": 159,
      "title": "Camera for license plates/stalker",
      "author": "Organic-Distance",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1m0hwfp/camera_for_license_platesstalker/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-15T13:33:24Z",
      "flair": null,
      "post_text": "Hi!\nI have an issue with a person surveilling my house. She never enters the property but does drive by and stop on the street to \"look\". Lawyers advised to see if I can record her and we can show a pattern of obsession. (Not looking far advise on how to deal with her)\nAnyhow, I do have a home security system (eufy) but the house is further back from the street and the cams wouldn't capture anything. I also live on a street with frequent traffic. \nSo what I'm looking for is a solution that only records the stalkers car, even at night, and doesn't need wifi as the signal might not always reach to the street. I'm also not a super technical person, easy out of the box setup would be great!"
    },
    {
      "post_id": 160,
      "title": "I need help my car was burned in my back yard can somone identify this camera",
      "author": "pl3ase_help",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1m06t47/i_need_help_my_car_was_burned_in_my_back_yard_can/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-15T03:06:02Z",
      "flair": null,
      "post_text": " Someone burned my car in my backyard i have no insurance  im screwed... this trailer has a camera   point at my back yard   he said it dont work i think hes lying and is covering for his brother  who i think did it i have some evidence but not enough.  does this have onboard storage ? Or anything? I need help im completely  doomed\n"
    },
    {
      "post_id": 161,
      "title": "Tech advice - non wifi camera solutions",
      "author": "Alternative_lane",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1m06qql/tech_advice_non_wifi_camera_solutions/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-15T03:02:42Z",
      "flair": null,
      "post_text": "Hello lovely reddits !\n\nSo I am in need of advice, I am looking for security cameras that record to a USB or memory card. I don't have Internet other than my phone. I do not require it to be in real time alert.\n\nI have problems with my landlord entering the property unannounced, and am concerned it's happening when I'm not at home. Illegal and creepy.\n\nI'd like to catch em in the act, so what set up do I need? It's short term, and I can't drill holes and stuff. Some sort of rechargeable nanny cam? One for the front porch, and one for the lounge room area.\n\nCheers!"
    },
    {
      "post_id": 162,
      "title": "How to view VicoHome camera's past alerts? Using the app is best?",
      "author": "MsChiSox",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1m00jn1/how_to_view_vicohome_cameras_past_alerts_using/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-14T22:23:46Z",
      "flair": null,
      "post_text": "Hi, After the notification on my phone from the app has been closed (for a motion alert for example) - how do I find those recording clips? Thank you so much, this is new to me, VicoHome.\n\nEdited to add - if the alerts are older than a couple of days and I have the free plan - if I subscribe now to the extended plan in the cloud - will it retroactively make those prior ones viewable? Or, just more going forward? \n\nThanks!"
    },
    {
      "post_id": 163,
      "title": "Camera",
      "author": "Latter_Wolverine_627",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1lzvrjr/camera/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-14T19:20:32Z",
      "flair": null,
      "post_text": "Does anyone have any advice so I want to put up a camera at my sons grave we know who’s doing the damaging and that, police won’t do anything unless they have it on video the graveyard is a 5 minute walk from me so I don’t have access to wifi or Bluetooth, does anyone have any suggestions on cameras that will work don’t want to go wasting money that’s doesn’t work if there is a camera that would work\nTIA."
    },
    {
      "post_id": 164,
      "title": "Side Mount PTZ - Oriented to Side (not Down)",
      "author": "Sycamorepod",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1lztqzd/side_mount_ptz_oriented_to_side_not_down/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-14T18:06:47Z",
      "flair": null,
      "post_text": "Is anyone aware of a side-mount/wall-mount PTZ where the the orientation is to the side, rather than down.  It would resemble a dome or turret mounted to wall, but be motorized to pan at 180 degrees and tilt at least 90.  "
    },
    {
      "post_id": 165,
      "title": "Whole House Recommendations",
      "author": "Actual-Stand-4757",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1lyyfga/whole_house_recommendations/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-13T17:24:55Z",
      "flair": null,
      "post_text": "Hey all! New to the wireless security world and could use some help. Also, I’m not specifically worried about local storage or subscriptions. I’m am look a quality brand of camera for a wired doorbell, internal camera, and external camera. I have had a Ring doorbell in the past and enjoyed it and the app, but never had anything else Ring. I currently have a Blink doorbell and few camera, but despise the app and the reaction time for motion. Thanks!"
    },
    {
      "post_id": 166,
      "title": "Camera no audio or pan and tilt",
      "author": "bluemoon1333",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1lyxo4o/camera_no_audio_or_pan_and_tilt/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-13T16:54:19Z",
      "flair": null,
      "post_text": "I live in a apartment and the rules are I can have a security camera inside my apartment but it can't have the ability to record audio and it can't be able to pan and tilt. Is there any simple wifi camera that has this ideally I'd be able to connect it to my Synology nas or the cloud so if I am robbed the footage is safe? "
    },
    {
      "post_id": 167,
      "title": "Security camera with a long battery life",
      "author": "Similar-Surround8113",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1ly9tvp/security_camera_with_a_long_battery_life/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-12T20:09:53Z",
      "flair": null,
      "post_text": "I'm looking for a camera with a battery life that lasts months or a wired one that is inconspicuous. I'm trying to place it on a cluttered vanity with the only outlet being behind the vanity. I also need it to stream to my phone and notify me when there's a person in the room like a ring doorbell but without the obnoxious noises. i really need it to be not noticeable."
    },
    {
      "post_id": 168,
      "title": "PoE connection not working but tester shows the cable is OK",
      "author": "ezeaizen",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1ly7llv/poe_connection_not_working_but_tester_shows_the/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-12T18:33:59Z",
      "flair": null,
      "post_text": "I’m installing a Reolink Poe doorbell camera. \nI just run an Ethernet cable through the attic and put the connectors. The tester shows the cable is ok, but the camera shows disconnected on the NVR. \nI tested the camera with a short cable next to the NVR and the camera works perfectly.\nIs it possible that even if the tester shows everything that the cable is OK , something can still be wrong with it? "
    },
    {
      "post_id": 169,
      "title": "What can I get for a single security camera that records 24/7 without a DVR setup?",
      "author": "Ramblewolf",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1ly62g7/what_can_i_get_for_a_single_security_camera_that/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-12T17:30:17Z",
      "flair": null,
      "post_text": "I'm trying to get a security camera setup for my room, Since I live with a questionable drug addict who I don't trust at all. I also lock my door, But have 1 day a week that I'm not able to do that, and want to make sure my stuff isnt stolen or tampered with. I've tried looking for different type of CCTV type cameras, But almost all the ones I've seen require a whole DVR setup. I just want 1 single camera that can constantly record, and save to an SD card or something similar, and to have the ability to set up my camera to wifi and check on it from my phone, or go back and watch the recording. Any recommendations?"
    },
    {
      "post_id": 170,
      "title": "Is this a good install",
      "author": "Ok-Blacksmith-7021",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1ly2hke/is_this_a_good_install/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-12T14:58:58Z",
      "flair": null,
      "post_text": "I hired a guy to install a cctv outside of my home. He us plugging the cameras into existing outlets i have around my home. Is this a good job and the standard way of installing these things?\n\nMy concerns are 1. It looks bad. 2. It won't last long outside in the elements. 3. Anyone can just unplug my camera by going up to it.\n\nDid I just get a lazy guy or should I have specified I wanted a more professional job?"
    },
    {
      "post_id": 171,
      "title": "Searching for a CCTV camera that offers clear audio to monitor the cashier in a noisy reception area.",
      "author": "Familiar_Tension_638",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1lxyx22/searching_for_a_cctv_camera_that_offers_clear/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-12T12:10:21Z",
      "flair": null,
      "post_text": null
    },
    {
      "post_id": 172,
      "title": "Looking for a security camera that can run off a power bank",
      "author": "WhatThisGirlSaid",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1lxvi19/looking_for_a_security_camera_that_can_run_off_a/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-12T08:30:44Z",
      "flair": null,
      "post_text": "I have a romoss sense 8p 30,000mah that I run some closet motion sensor lights for the front door and wondering if there is a cheap security camera I can attach to that just for simple motion detection people detection purely for delivery notification nothing else.. No other features needed besides maybe night detection\n\nNo recording or two way talk or any other fancy features required\n\nJust looking for the cheapest camera with no subscription fee required to notify me when someone opens my door to leave food inside the front door on my phone and desktop pc\n\nThere is no nearby mains power to the door unless I run an obstructive extension cable that's why trying to find a camera that can already use an existing power bank there\n\nNo ring or doorbell type cameras either as I will most likely be pointing it at the front door room rather than outside the door itself\n\nI might get a second camera to put on the window indoor to point outside to get a second feed of the front door in case people leave the delivery outside for example instead of inside the house\n\nSo what are some options for this"
    },
    {
      "post_id": 173,
      "title": "Discreet visual and audio camera",
      "author": "lucybashh",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1lxlesm/discreet_visual_and_audio_camera/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-11T23:16:15Z",
      "flair": null,
      "post_text": "Hi everyone,\n\nCan anyone please recommend a small spy camera that I can put anywhere in my front room that looks like an ornament, something no one wouldn’t notice at all if they looked twice at it?\n\nOne preferably that would only start recording if there was movement / sound and is a USB to wall plug chargeable that comes with an app i can downloaded to an app on my phone to save videos?\n\nThank you x"
    },
    {
      "post_id": 174,
      "title": "Need long distance NV security camera",
      "author": "goober2199",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1lwxz7y/need_long_distance_nv_security_camera/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-11T04:43:01Z",
      "flair": null,
      "post_text": "Hello. Im looking for a security camera to watch over my garden. I want it to have good night vision because that is when it's most vulnerable. I would need 100+ feet clear Night vision. Wifi, good battery / solar.\nI've been researching and looking online but im getting overwhelmed with all the options. Any insight is appreciated,  thank you\n"
    },
    {
      "post_id": 175,
      "title": "Solar &amp; Cellular Outdoor Cameras",
      "author": "Relevant_Act2046",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1lwwaco/solar_cellular_outdoor_cameras/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-11T03:12:58Z",
      "flair": null,
      "post_text": "I’m looking for an outdoor surveillance camera that would be good for a remote setting.\n\nNo wifi is available on this site and neither is electricity so I think a solar/cellular camera may be the best fit for this kind of application. Please advise if you have another suggestion. \n\nI know of Reolink and have installed a couple previously but their PIR motion detection isn’t the best and their night vision is worse. \n\nWhat other brands or models of cameras would you recommend for this kind of application? \n\nRequirements:\nReasonably priced\nSolar powered\nCellular based\nDecent night vision and motion detection.\n\nThank you hive mind."
    },
    {
      "post_id": 176,
      "title": "Can anyone identify this security camera?",
      "author": "Aviorwolf",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1lwuxxm/can_anyone_identify_this_security_camera/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-11T02:06:44Z",
      "flair": null,
      "post_text": "^(My neighbor put this up pointing at my backyard. Sorry for the poor photo quality!)\n\nhttps://preview.redd.it/2w0joshwk5cf1.jpg?width=1318&amp;format=pjpg&amp;auto=webp&amp;s=4699ac96e3b73e7b310f45c50c6aaf088311ec90\n\n"
    },
    {
      "post_id": 177,
      "title": "wifi mini hidden spy camera wireless hd 1080p",
      "author": "RepeatPlayful3779",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1lwrmfu/wifi_mini_hidden_spy_camera_wireless_hd_1080p/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-10T23:27:47Z",
      "flair": null,
      "post_text": "I found this camera at my house. I used Google Lens and it gave me the title above. Problem is I don't know what app to install on my android phone so I can view the camera. Anyone know? Please help. I've been trying to figure this out half of the day. I'm getting very frustrated. Thank y'all in advance. Feel free to add me."
    },
    {
      "post_id": 178,
      "title": "Lorex security cameras",
      "author": "EmeraldFireWolf",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1lwqn3a/lorex_security_cameras/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-10T22:45:32Z",
      "flair": null,
      "post_text": null
    },
    {
      "post_id": 179,
      "title": "24/7 Video recording review/“scrubbing”",
      "author": "yanksfold",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1lwjtvf/247_video_recording_reviewscrubbing/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-10T18:12:01Z",
      "flair": null,
      "post_text": "Is there a quality system that has ability to do “scrubbing” for review of video (vs viewing recorded clips)?   Nest does it well but I would prefer anything but Google!"
    },
    {
      "post_id": 180,
      "title": "Our AirBnb has these throughout the home with privacy shield open - what are they and how to tell if these are live?",
      "author": "BitcoinRigNoob",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1lwghes/our_airbnb_has_these_throughout_the_home_with/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-10T16:01:46Z",
      "flair": null,
      "post_text": "Airbnb has motion sensors with what looks like camera lens through the living areas, hallways etc. we've been here a few days and I didn't notice. \n\nAre these cameras or are they part of the motion sensor lens? Unsure - help appreciated. I've met the host and can't imagine her to do something sinister. "
    },
    {
      "post_id": 181,
      "title": "Mobotix jpg url on newer models Mx-VB1A-8-IR-VA",
      "author": "smhick",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1lwf388/mobotix_jpg_url_on_newer_models_mxvb1a8irva/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-10T15:06:45Z",
      "flair": null,
      "post_text": "We recently purchased a new Mx-VB1A-8-IR-VA and we were wondering how we can grab a still jpg image from the camera.\n\nOn our older Mobotix M15 camera we just used the following URL [http://192.168.1.1/record/current.jpg](http://192.168.1.1/record/current.jpg) and we see a still image from the camera\n\nBut testing this on the new Mx-VB1A-8-IR-VA camera doesn't seem to work\n\nNew camera IP is [192.168.1.2](http://192.168.1.2)\n\nTested\n\n[http://192.168.1.2/record/current.jpg](http://192.168.1.2/record/current.jpg)\n\nand get the following error Access Error: 404 -- Not Found\n\nI'm able to open up the mjpeg live stream no problem via the following URL\n\n[http://192.168.1.2/live/stream3](http://192.168.1.2/live/stream3)\n\nDoes the newer Mx-VB1A-8-IR-VA support grabbing jpg images from a URL?\n\nCamera Firmware version = &lt;mb20250619UX&gt;"
    },
    {
      "post_id": 182,
      "title": "PoE doorbell cameras options",
      "author": "WishboneTemporary232",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1lwef1q/poe_doorbell_cameras_options/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-10T14:39:26Z",
      "flair": null,
      "post_text": "Looking for a PoE doorbell camera. Are there any other options aside from Reolink?\n\nHoping to use with my Swann NVR."
    },
    {
      "post_id": 183,
      "title": "Simple live camera suggestions?",
      "author": "KarnifalChimera",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1lw56xs/simple_live_camera_suggestions/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-10T05:57:15Z",
      "flair": null,
      "post_text": "Alright, I think this is the right place to ask this? I'm trying to find a basic camera to monitor my barn. I don't need any audio features, absolutely don't want to deal with a subscription, don't really need it to record anything. I just need to be able to look in frequently to check on them without walking out there at all hours, especially when I have girls expecting babies. Night vision would be important but motion detection is not, the animals would set it off every few minutes and that seems silly. It would be technically indoors (the barn is a concrete block building but it does have little screened vents at the top and bottom of two walls) so it won't get wet but it could get cold (just above freezing at the lowest). There is power out there in the form of a regular outlet (I run ac and fans in the summer) so I'd prefer a wired camera. The wifi does just about reach I believe but doing high demand things like video calls in there has had some crunchiness. I imagine that if its just sending video out, no audio, and not receiving anything back it should work? I'd look into cellular but I have a feeling that would be more expensive and I'm on a tighter budget with this. \n\nI did do some looking of my own at first but all the cheap cameras seem to require subscriptions and have all sorts of extra bells and whistles that really seem like overkill in this situation. I just need to know when one of the girls goes into labor or check in when I'm off the farm just in case. Any help here would be awesome!"
    },
    {
      "post_id": 184,
      "title": "Altered with security cameras",
      "author": "chronosthetitan",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1lw2uis/altered_with_security_cameras/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-10T03:41:33Z",
      "flair": null,
      "post_text": "I’ll be on my app and hear from the cameras but if you save the footage there’s no sound. Sometimes the cameras go out. Am I being WiFi jammed?"
    },
    {
      "post_id": 185,
      "title": "Best Way to Share Tapo C402 Camera Access with Immediate Family",
      "author": "bbgarnett",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1lvxjy9/best_way_to_share_tapo_c402_camera_access_with/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-09T23:21:52Z",
      "flair": null,
      "post_text": "I just ordered two TP-Link **Tapo SolarCam C402 Kits** and they’ll be arriving next week. Will be using them strictly with a Micro SD card and no cloud storage.  We're planning to install them at our family cabin so everyone can keep an eye on the place when we’re not there—mainly to monitor the garden, lake area, and any animals that might be getting into things. I was wondering if there’s any way to set the cameras up so I can give people a **link** to view the feed, **without requiring everyone to download the Tapo app**. Ideally, I’d like it to be **“public” in the sense that it's easily accessible** (like via a URL), but still **private so that only immediate family members can view it**—not just anyone with the link. If that’s not possible, is there at least a way for multiple people to have their own Tapo accounts and log in to view the cameras and or get notifications? Just looking for the simplest way to share access with family without making it a hassle. Thanks!"
    },
    {
      "post_id": 186,
      "title": "Continuous Live Stream Help",
      "author": "InsignificantUnit137",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1lvt7xy/continuous_live_stream_help/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-09T20:21:26Z",
      "flair": null,
      "post_text": "Hi everyone! I need some help. I work at a mall and we recently got a rooftop beehive. My boss wants a continuous live stream of the beehive to stream to a TV on the mall floor. The problem is that we don’t have a computer to run the stream so we need the feed to go from the camera straight to the TV somehow. We can buy a smart TV and weatherproof camera but are at a loss on what to get and how to actually set it up. None of us are very tech savvy, we just want a way to watch our bees! Any help is very appreciated!!! Thank you!"
    },
    {
      "post_id": 187,
      "title": "Blink outdoor 3/4 the right option?",
      "author": "Jay20W",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1lvr9x1/blink_outdoor_34_the_right_option/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-09T19:04:44Z",
      "flair": null,
      "post_text": "A friend of mine would like to put in some outdoor security at her barn. She’s looking to put in about 6 cameras total, all outside covering the exterior and pathways to her barn (she boards and trains horses) I was thinking she might like the Blink outdoor cameras because they are relatively simple, WiFi, enabled, motion activated and have IR for night time. My only concern is battery life. Trying to keep the overall bill under $500 and open to recommendations "
    },
    {
      "post_id": 188,
      "title": "Non-subscription, closed network options?",
      "author": "WARowland",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1lvq24i/nonsubscription_closed_network_options/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-09T18:17:26Z",
      "flair": null,
      "post_text": "Looking for a home system with wireless cameras, but that I can set up without an internet connection? Just not sure if there's anything out there like it. \n\nBasically, is there a system that let's me connect the cameras to a non-internet wifi network (basically a router with no-modem) and transfer footage to an offline central storage hub that way (like an computer or harddrive also on the network)\n\nWould a normal wifi-camera set up allow me to do that?\n\nSorry if the question doesn't quite make sense. Im just not familiar enough with the industry to know what terminology to even look for. I've been hesitant to look at home secuirty systems because I don't like the idea of someone potentially being able to get into my home Internet wifi, and access the system from the internet (yes, I'm paranoid).\n\nFigure with a non-internet connected wifi, at least someone would have to be phsycially close to try to get in.\n\nThoughts? Ideas? "
    },
    {
      "post_id": 189,
      "title": "Wireless/Solar + 4G/LTE Outdoor Security Cameras for 5-Building Industrial Park – Recommendations?",
      "author": "Hungry_Coconut930",
      "url": "https://www.reddit.com/r/SecurityCamera/comments/1lvmgnx/wirelesssolar_4glte_outdoor_security_cameras_for/",
      "num_likes": 0,
      "num_dislikes": 0,
      "num_comments": 0,
      "num_shares": 0,
      "created_utc": "2025-07-09T15:57:42Z",
      "flair": null,
      "post_text": "We’ve looked at Reolink Go/Go PT Plus, Arlo Go 2, and Eufy 4G Cam S330, but real-world feedback would help. Budget is flexible for reliability.\n\nWhat works well for you? \nWe would need roughly 4-6 cameras. \n\nThanks in advance! "
    }
]